-- phpMyAdmin SQL Dump
-- version 4.5.1
-- http://www.phpmyadmin.net
--
-- Host: localhost
-- Generation Time: Jun 13, 2016 at 12:55 AM
-- Server version: 5.5.49-0ubuntu0.14.04.1
-- PHP Version: 5.5.9-1ubuntu4.17

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `db_logistic`
--

-- --------------------------------------------------------

--
-- Table structure for table ` 2559`
--

CREATE TABLE ` 2559` (
  `unitname` varchar(255) DEFAULT NULL,
  `description` varchar(255) DEFAULT NULL,
  `budgetyear` varchar(255) DEFAULT NULL,
  `method` varchar(255) DEFAULT NULL,
  `budget` varchar(255) DEFAULT NULL,
  `saler` varchar(255) DEFAULT NULL,
  `approvedate` varchar(255) DEFAULT NULL,
  `country` varchar(255) DEFAULT NULL,
  `peroid` varchar(255) DEFAULT NULL,
  `editor` varchar(255) DEFAULT NULL,
  `remark` varchar(255) DEFAULT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Dumping data for table ` 2559`
--

INSERT INTO ` 2559` (`unitname`, `description`, `budgetyear`, `method`, `budget`, `saler`, `approvedate`, `country`, `peroid`, `editor`, `remark`) VALUES
('', 'โครงการดำรงขีดความสามารถและเพิ่มประสิทธิภาพโรงงานของ ศอว.ศอพท. ประจำปี 59', '', 'พิเศษ', '', 'บริษัท อินดี้ ซัพพลาย เอ็นจิเนียริ่ง จำกัด', 'รมว.กห. อนุมัติ เมื่อ 29 ธ.ค.58', 'ประเทศไทย', NULL, NULL, NULL),
('', 'พท.ศอพท.ขออนุมัติสร้างระบบผลิตไฟฟ้าและสูบน้ำด้วยพลังแสงอาทิตย์แบบเคลื่อนที่ ขนาดไม่น้อยกว่า 1,200 วัตต์ พร้อมติดตั้ง จำนวน 200 ระบบ (เงินจากกระทรวงพลังงาน)', '', 'e -bidding', '', 'บริษัท โซลาร์ตรอน  จำกัด(มหาชน)', 'รมว.กห. อนุมัติ เมื่อ 23 มี.ค.59', 'ประเทศไทย', NULL, NULL, NULL),
('บก.ทท', '(ผท.ทหาร) ซื้อกล้องถ่ายภาพทางอากาศเชิงเลข พร้อมชุดอุปกรณ์ จำนวน ๑ ชุด (๑๑ รายการ)', '', 'e - bidding', '', 'บริษัท โกลเบิล อินฟอร์เมชั่น จำกัด', 'รมว.กห. อนุมัติ เมื่อ 24 ธ.ค.58', 'ประเทศไทย', NULL, NULL, NULL),
('บก.ทท', 'ศรภ. จัดซื้อระบบรวบรวมข้อมูลข่าวกรองทางการสื่อสารแบบดิจิตอล', '', 'พิเศษ', '', 'บริษัท กันโน่ ซิสเต็มส์ อินทีเกรชั่น จำกัด ', 'รมว.กห. อนุมัติ เมื่อ 7 ก.พ.59', 'ประเทศไทย', NULL, NULL, NULL),
('บก.ทท', 'สยย.ทหาร โครงการก่อสร้างบ้านพักข้าราชการ บก.ทท. ระยะที่ 2 พื้นที่ทุ่งสีกัน 1 และ 4', '', 'e - bidding', '', 'กิจการร่วมค้า เอนคอน - เสรี', 'รมว.กห. อนุมัติ เมื่อ 9 มี.ค.59', 'ประเทศไทย', NULL, NULL, NULL),
('ทบ.', '(ขส.ทบ.) การจ้างเหมาส่งกำลังและซ่อมบำรุงชิ้นส่วนซ่อมสำหรับฟื้นฟู ฮ.ท.1 จำนวน 1 งาน', '', 'พิเศษ', '', 'บริษัท โรยัลสกาย จำกัด', 'รมว.กห. อนุมัติ เมื่อ 26 ธ.ค.58', 'ประเทศไทย', NULL, NULL, NULL),
('ทบ.', '(ยย.ทบ.) โครงการก่อสร้างอาคาร ม.พัน 31', '', 'พิเศษ', '', 'บริษัท วิทย์การช่าง จำกัด', 'รมว.กห. อนุมัติ เมื่อ 26 ธ.ค.58', 'ประเทศไทย', NULL, NULL, NULL),
('ทบ.', '(ขส.ทบ.) การจ้างเหมาส่งกำลังและซ่อมบำรุงชิ้นส่วนซ่อมสำหรับฟื้นฟู ฮ.ท.212 จำนวน 1 งาน', '', 'พิเศษ', '', 'บริษัท โรยัลสกาย จำกัด', 'รมว.กห. อนุมัติ เมื่อ 30 ธ.ค.58', 'ประเทศไทย', NULL, NULL, NULL),
('ทบ.', '(สส.)  จัดหาระบบเครื่องมือแผนที่อัตโนมัติ จำนวน 3 ระบบ', '', 'พิเศษ', '', 'บริษัท วสุรัตน์ แอนด์ แอสโซซิเอท จำกัด ', 'รมว.กห. อนุมัติ เมื่อ 30 ธ.ค.58', 'ประเทศไทย', NULL, NULL, NULL),
('ทบ.', '(สพ.ทบ.) จ้างซ่อมรถยนต์บรรทุก ขนาด 1 1/4 ตัน ยูนิมอก จำนวน 60 คัน', '', 'พิเศษ', '', 'กิจการร่วมค้าอิทธิพร', 'รมว.กห. อนุมัติ เมื่อ 30 ธ.ค.58', 'ประเทศไทย', NULL, NULL, NULL),
('ทบ.', '(สพ.ทบ.) จ้างซ่อมปรับปรุง รสพ. M113 A1 ให้เป็น รสพ. M113 A2 I จำนวน 6 คัน', '', 'พิเศษ', '', 'บริษัท ชัยเสรีเม็ททอล แอนด์รับเบอร์ จำกัด ', 'รมว.กห. อนุมัติ เมื่อ 30 ธ.ค.58', 'ประเทศไทย', NULL, NULL, NULL),
('ทบ.', '(สพ.ทบ.) ขออนุมัติจ้างผลิต/ประกอบ รยบ.ขนาดเบา 4x4 แบบ 51B (ปรับปรุงใหม่) จำนวน 251 คัน ', '', 'พิเศษ', '', 'บริษัท เอส.เอส. ออโตโมทีฟอินดัสตรี จำกัด', 'รมว.กห. อนุมัติ เมื่อ 14 ม.ค.59', 'ประเทศไทย', NULL, NULL, NULL),
('ทบ.', 'สพ.ทบ. จ้างซ่อมปรับปรุงปืนใหญ่ต่อสู้อากาศยาน ขนาด 20 มม. วัลแคน อัตตาจรจำนวน 4 หน่วยยิง', '', 'พิเศษ', '', 'บริษัท ISRAEL MILITARY INDUSTRIES LTD รัฐอิสราเอล', 'รมว.กห. อนุมัติ เมื่อ 5 ก.พ.59', 'รัฐอิสราเอล', NULL, NULL, NULL),
('ทบ.', 'สพ.ทบ. จัดหากระสุนปืนเล็กขนาด 5.56 มม. ธรรมดา จำนวน 18,008,150 นัด', '', 'พิเศษ', '', 'บริษัท POONGSAN ', 'รมว.กห. อนุมัติ เมื่อ', 'ประเทศไทย', NULL, NULL, NULL),
('ทบ.', 'สพ.ทบ. จัดหากระสุนปืนเล็ก ขนาด 5.56 มม. ชนิดธรรมดา มีแกนเหล็ก จำนวน 22,000,000 นัด', '', 'พิเศษ', '', 'บริษัท POONGSAN CORPORATION  สาธารณรัฐเกาหลี', 'รมว.กห. อนุมัติ  20 ก.พ.59', ' สาธารณรัฐเกาหลี', NULL, NULL, NULL),
('ทบ.', 'โครงการจัดหาระบบการติดต่อ สื่อสารทางยุทธวิธีจำนวน ๕ รายการ ', '', 'พิเศษ', '', 'บริษัท จันทร์เกษม อินเตอร์เนทชั่นแนล จำกัด', 'รมว.กห. อนุมัติ เมื่อ 19 ก.พ.59', 'ประเทศไทย', NULL, NULL, NULL),
('ทบ.', 'ขส.ทบ. จัดหาอุปกรณ์ระบบตรวจจับแจ้งเตือนและป้องกันอาวุธนำวิถีต่อสู้อากาศยาน พร้อมการติดตั้ง, การฝึกอบรมการใช้งานและการซ่อมบำรุง ', '', 'พิเศษ', '', 'บริษัท Elbit Systems Eletro-option Elop LTD รัฐอิสราเอล ', 'รมว.กห. อนุมัติ เมื่อ 29 ก.พ.59', 'รัฐอิสราเอล', NULL, NULL, NULL),
('ทบ.', 'สพ.ทบ. จัดหากระสุนปืนใหญ่กลางวิถีโค้ง ขนาด 155 มม. ชนิดส่องแสงเพิ่มระยะกลาง (ILLUM-ER-BT) จำนวน 450 นัด', '', 'พิเศษ', '', 'บริษัท รอยัล ดีเฟนส์ จำกัด', 'รมว.กห. อนุมัติ เมื่อ 3 มี.ค.59', 'ประเทศไทย', NULL, NULL, NULL),
('ทบ.', 'พธ.ทบ.  จ้างผลิตเสื้อยืดคอรูปตัววี (สีกากีแกมเขียว และสีพรางลายดิจิตอล) จำนวน 449,711 ตัว', '', 'e - bidding', '', 'บริษัท ไทยทูเวย์ แฟบริค จำกัด', 'รมว.กห. อนุมัติ เมื่อ 3 มี.ค.59', 'ประเทศไทย', NULL, NULL, NULL),
('ทบ.', 'สพ.ทบ. จัดหากระสุนปืนใหญ่เบาวิถีโค้ง ขนาด 105 มม. ชนิดควัน RP เพิ่มระยะกลาง (RED PHOSPHOROUS ER-BT) จำนวน 720 นัด', '', 'พิเศษ', '', 'บริษัท รอยัล ดีเฟนส์ จำกัด', 'รมว.กห. อนุมัติ เมื่อ 3 มี.ค.59', 'ประเทศไทย', NULL, NULL, NULL),
('ทบ.', 'พธ.ทบ. จ้างผลิตรองเท้าทรงสูงครึ่งน่อง จำนวน 142,785 คู่', '', 'e - bidding', '', 'บริษัท เอส แอนด์ อาร์ ฟุตแวร์ จำกัด', 'รมว.กห. อนุมัติ เมื่อ 3 มี.ค.59', 'ประเทศไทย', NULL, NULL, NULL),
('ทบ.', 'สพ.ทบ. จัดหากระสุนปืนใหญ่กลางวิถีโค้ง ขนาด 155 มม. ชนิดระเบิดแรงสูง (Super High Explosive) จำนวน 750 นัด', '', 'พิเศษ', '', 'บริษัท ISRAEL MILITARY INDUSTRIES LTD (I.M.I)', 'รมว.กห. อนุมัติ เมื่อ 8 มี.ค.59', 'รัฐอิสราเอล', NULL, NULL, NULL),
('ทบ.', 'สพ.ทบ. จัดหาลูกระเบิดยิงจากเครื่องยิงลูกระเบิด ขนาด60 มม. ชนิดส่องแสง แบบที่ 1 จำนวน 1,970 นัด', '', 'พิเศษ', '', 'บริษัท ISRAEL MILITARY INDUSTRIES LTD (I.M.I)', 'รมว.กห. อนุมัติ เมื่อ 9 มี.ค.59', 'รัฐอิสราเอล', NULL, NULL, NULL),
('ทบ.', 'สส.  โครงการจัดหาชุดวิทยุทดแทน AN/PRC-624 (ระยะที่ 1 ห้วงที่3) จัดหาชุดวิทยุVHF/FM ทางทหารระดับหมู่-มว. ชนิดมือถือ จำนวน 1,307 ชุด', '๕๙ - ๖๑', 'พิเศษ', '', 'บริษัท Elbit System Land  And C41 Ltd.รัฐอิสราเอล', 'รมว.กห. อนุมัติ เมื่อ 9 มี.ค.59', 'รัฐอิสราเอล', NULL, NULL, NULL),
('', 'สส.  โครงการจัดหาเครื่องมือสื่อสาร (หน่วย ส.) จำนวน ๖ รายการ ได้แก่', '', 'พิเศษ', '', 'บริษัท Elbit System Land  And C41 Ltd.รัฐอิสราเอล', 'รมว.กห. อนุมัติ เมื่อ 13 มี.ค.59', 'รัฐอิสราเอล', NULL, NULL, NULL),
('ทบ.', 'สส.  โครงการจัดหาเครื่องมือด้านการข่าวตาม อจย.ขกท.', '', 'พิเศษ', '', 'บริษัท เพลสซิ่ง แวลู จำกัด', 'รมว.กห. อนุมัติ เมื่อ 13 มี.ค.59', 'ประเทศไทย', NULL, NULL, NULL),
('ทบ.', 'สพ.ทบ. จัดหาระบบเครื่องควบคุมการยิง รถถัง เอ็ม 60 เอ 3 จำนวน 15 ระบบ', '๕๙ - ๖๑', 'พิเศษ', '', 'บริษัท Elbit System Land  And C41 Ltd.รัฐอิสราเอล', 'รมว.กห. อนุมัติ เมื่อ 14 มี.ค.59', 'รัฐอิสราเอล', NULL, NULL, NULL),
('ทบ.', 'สพ.ทบ. โครงการจัดหา ถ. ทดแทน (ถ.เอ็ม 41) ระยะที่ 2 รถถังหลัก (Main Battle Tank VT4)  จำนวน ๒๘ คัน', '๕๙ - ๖๑', 'G TO G', '', 'รัฐบาลสาธารณรัฐประชาชนจีน (สปจ.)', 'รมว.กห. อนุมัติ เมื่อ 17 มี.ค.59', 'สาธารณรัฐประชาชนจีน (สปจ.)', NULL, NULL, NULL),
('ทบ.', 'ยย.ทบ. จ้างเหมางานก่อสร้างเรือนรับรองทำเนียบรัฐบาล', '๕๙ - ๖๐', 'พิเศษ', '', 'กิจการร่วมค้า วิทย์การช่าง  -ไซเลนเทค ', 'รมว.กห. อนุมัติ เมื่อ 18 มี.ค.59', 'ประเทศไทย', NULL, NULL, NULL),
('ทบ.', 'สส. จัดหาเครื่องมือตรวจระบบเรดาร์ จำนวน 3 ชุด ', '', 'พิเศษ', '', 'หจก.ไซแอนติ รีเสริช์', 'รมว.กห. อนุมัติ เมื่อ 21 มี.ค.59', 'ประเทศไทย', NULL, NULL, NULL),
('ทบ.', 'สส.  จัดหาระบบสื่อสารดาวเทียมแบบยุทธวิธีสนับสนุนหน่วยระดับกองพล จำนวน 3 ระบบ', '', 'พิเศษ', '', 'บริษัท ล๊อกซเลย์ ไวร์เลส จำกัด', 'รมว.กห. อนุมัติ เมื่อ 22 มี.ค.59', 'ประเทศไทย', NULL, NULL, NULL),
('ทบ.', 'สพ.ทบ. จัดหาปืนเล็กกล ขนาด 5.56 มม. แบบที่ 1 จำนวน 1,948 กระบอก', '๕๙ - ๖๑', 'พิเศษ', '', 'บริษัท ISRAEL WEAPON INDUSTRIES (IWI) LTD ', 'รมว.กห. อนุมัติ เมื่อ 22 มี.ค.59', 'รัฐอิสราเอล', NULL, NULL, NULL),
('ทบ.', 'สพ.ทบ. จ้างซ่อมปืนใหญ่กลางกระสุนวิถีโค้ง 37 ขนาด 155 มม. M109 A5 อัตตาจร จำนวน ๑๐ หน่วยยิง จ้างซ่อมรถสายพานบรรทุกกระสุน M992 A1 จำนวน 10 คัน', '', 'พิเศษ', '', 'บริษัท ฟิโก้ เทคโนโลยี เอ็นจีเนียริ่ง จำกัด', 'รมว.กห. อนุมัติ เมื่อ 24 มี.ค.59', 'ประเทศไทย', NULL, NULL, NULL),
('ทบ.', 'สพ.ทบ. จัดหารถยนต์บรรทุก ขนาด 2 1/2 ตัน จำนวน 404 คัน', '๕๙ - ๖๑', 'พิเศษ', '', 'บริษัท อิทธิพร อิมปอร์ จำกัด', 'รมว.กห. อนุมัติ เมื่อ 24 มี.ค.59', 'ประเทศไทย', NULL, NULL, NULL),
('ทบ.', '(สพ.ทบ.) ซื้อปืนกล 38 ขนาด 7.62 มม.จำนวน 1,359 กระบอก', '๕๙ - ๖๑', 'พิเศษ', '', 'บริษัท รอยัล ดีเฟนส์ จำกัด', 'รมว.กห. อนุมัติ เมื่อ 23 มี.ค.59', 'ประเทศไทย', NULL, NULL, NULL),
('ทร.', 'อร. จ้างซ่อมทำเครื่องใหญ่ ขวา - ซ้าย ตราอักษร MTU รุ่น 20V1163 TB83 ขั้น major OverHaul ร.ล.รัตนโกสินทร์', '', 'พิเศษ', '', 'บริษัท ยูพีเอส เอ็นจิน เซอร์วิส เซ็นเตอร์ จำกัด', 'รมว.กห. อนุมัติ เมื่อ 20 ก.พ.59', 'ประเทศไทย', NULL, NULL, NULL),
('ทร.', 'สยป.ทร. โครงการจัดหาเรือตรวจการณ์ชายฝั่ง จำนวน 5 ลำ', '๕๙ - ๖๑', 'พิเศษ', '', 'บริษัท มาร์ซัน จำกัด', 'รมว.กห. อนุมัติ เมื่อ 1 มี.ค.59', 'ประเทศไทย', NULL, NULL, NULL),
('ทร.', 'ขออนุมัติจ้างปรับปรุงเรือล่าทำลายทุ่นระเบิดใกล้ฝั่ง ชุด ร.ล.บางระจัน', '', 'พิเศษ', '', 'บริษัท THALES UK Ltd. สหราชอาณาจักร บริเตนใหญ่และไอร์แลนด์เหนือ', 'รมว.กห. อนุมัติ เมื่อ 22 มี.ค.59', ' สหราชอาณาจักร บริเตนใหญ่และไอร์แลนด์เหนือ', NULL, NULL, NULL),
('ทอ.', 'ขออนุมัติจ้างเหมาบริการสนับสนุนเครื่องยนต์ และอุปกรณ์ Line Replacement Unit (LRUs) สำหรับ บ.ข.๒๐/ก', '', 'พิเศษ', '', 'องค์การรักษาความปลอดภัยด้านการส่งออกทางทหารสวีเดน (The Swedish Defence and Security Export Agency (Försvarsexportmynigheten : FXM))  ราชอาณาจักรสวีเดน', 'รมว.กห. อนุมัติ เมื่อ 24 ก.ย.58', 'ราชอาณาจักรสวีเดน', NULL, NULL, NULL),
('ทอ.', 'ขออนุมัติจ้างก่อสร้างอาคารรับรองบุคคลสำคัญที่ท่าอากาศยานทหาร 2 กองบิน 6', '', 'พิเศษ', '', 'บริษัท อิตาเลียนไทย ดีเวล๊อปเมนต์ จำกัด(มหาชน)', 'รมว.กห. อนุมัติ เมื่อ 1 ก.พ.59', 'ประเทศไทย', NULL, NULL, NULL),
('ทอ.', 'ชย.ทอ. สร้างโรงเก็บ บ.ปฏิบัติการสงครามอิเล็กทรอนิกส์ ที่ บน.7', '', 'พิเศษ', '', 'บริษัท ทีมวิศว์ คอนสรัคชั่น จำกัด', 'รมว.กห. อนุมัติ เมื่อ 7 ก.พ.59', 'ประเทศไทย', NULL, NULL, NULL),
('ทอ.', 'ชย.ทอ. จ้างสร้างโรงตรวจซ่อม ฮ.พระราชพาหนะ พร้อมอุปกรณ์ และสิ่งอำนวยความสะดวก จำนวน 1 โรง', '๕๙ - ๖๐', 'พิเศษ', '', 'บริษัท ที.พี.เอส  วัสดุภัณฑ์ จำกัด', 'รมว.กห. อนุมัติ เมื่อ 20 ก.พ.59', 'ประเทศไทย', NULL, NULL, NULL),
('ทอ.', 'ชย.ทอ. งานติดตั้งระบบผลิตไฟฟ้าด้วยเซลล์แสงอาทิตย์ ขนาด ๑ เมกะวัตต์ ที่ บน.2', '', 'พิเศษ', '', 'กิจการร่วมค้า สมาร์ทพาวเวอร์ เอ็นจีเนียริ่ง ไทยวิจิตรประภา', 'รมว.กห. อนุมัติ เมื่อ 22 มี.ค.59', 'ประเทศไทย', NULL, NULL, NULL),
('ทอ.', 'ชย.ทอ. งานติดตั้งระบบผลิตไฟฟ้าด้วยเซลล์แสงอาทิตย์ ขนาด ๑ เมกะวัตต์ น้ำพอง ที่ ฝูง.237', '', 'พิเศษ', '', 'บริษัท ไทยรีนิวเอเบิล จำกัด', 'รมว.กห. อนุมัติ เมื่อ 24 มี.ค.59', 'ประเทศไทย', NULL, NULL, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `cologistic_h`
--

CREATE TABLE `cologistic_h` (
  `id` int(11) NOT NULL,
  `flagid` int(11) NOT NULL,
  `cotypeid` int(11) NOT NULL,
  `title` varchar(250) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `cologistic_h`
--

INSERT INTO `cologistic_h` (`id`, `flagid`, `cotypeid`, `title`) VALUES
(1, 1, 1, 'การปฏิรูประบบงานด้านส่งกำลังบำรุง');

-- --------------------------------------------------------

--
-- Table structure for table `cotype`
--

CREATE TABLE `cotype` (
  `idcotype` int(11) NOT NULL COMMENT 'รหัส',
  `cotypename` varchar(250) NOT NULL COMMENT 'ชื่อประเภท'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `cotype`
--

INSERT INTO `cotype` (`idcotype`, `cotypename`) VALUES
(1, 'ขออนุมัติแผนจัดซื้อ/จัดจ้าง'),
(2, 'การขออนุมัติจัดซื้อจัดจ้าง'),
(3, 'การลงนามในสัญญา'),
(4, 'การแก้ไขสัญญา');

-- --------------------------------------------------------

--
-- Table structure for table `country`
--

CREATE TABLE `country` (
  `idcountry` int(11) NOT NULL COMMENT 'รหัส',
  `countryname_th` varchar(100) NOT NULL COMMENT 'ชื่อประเทศภาษาไทย',
  `countryname_en` char(50) NOT NULL COMMENT 'ชื่อประเทศภาษาอังกฤษ',
  `picture` varchar(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `country`
--

INSERT INTO `country` (`idcountry`, `countryname_th`, `countryname_en`, `picture`) VALUES
(1, 'สหรัฐอเมริกา', 'The United States', 'us.png'),
(2, 'เกาหลีใต้', 'South Korea', 'kr.png'),
(3, 'จีน', 'China', 'cn.png'),
(4, 'แคนาดา', 'Canada', 'ca.png'),
(5, 'ออสเตรเลีย', 'Australia', 'au.png'),
(6, 'ญี่ปุ่น', 'Japan', 'jp.png'),
(7, 'ใต้หวัน', 'Taiwan', 'tw.png'),
(8, 'สิงคโปร์', 'Singapore', 'sg.png'),
(9, 'สเปน', 'Spain', 'sn.png'),
(10, 'สวีเดน', 'Sweden', 'sd.png'),
(11, 'ปากีสถาน', 'Pakistan', 'pk.png'),
(12, 'โรมาเนีย', 'Romania', 'ro.png'),
(13, 'ออสเตรเลีย', 'Australia', 'au.png'),
(14, 'ฝรั่งเศส', 'France', 'fr.png'),
(15, 'รัสเซีย', 'Ruasia', 'rs.png'),
(16, 'ไทย', 'Thailand', 'th.png');

-- --------------------------------------------------------

--
-- Table structure for table `file`
--

CREATE TABLE `file` (
  `id` int(11) NOT NULL COMMENT 'รหัส',
  `title` tinytext NOT NULL COMMENT 'ชื่อเอกสาร',
  `filename` varchar(200) DEFAULT NULL COMMENT 'ไฟล์เอกสาร',
  `coid` int(11) NOT NULL COMMENT 'ความร่วมมือ'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `file`
--

INSERT INTO `file` (`id`, `title`, `filename`, `coid`) VALUES
(1, 'sdfsd', '', 1),
(2, 'sdfsd', '1-2016-06-12-01-26-40-1.xlsx', 1),
(3, 'fsdsd', '2-2016-06-12-01-26-51-1.xlsx', 2);

-- --------------------------------------------------------

--
-- Table structure for table `flag`
--

CREATE TABLE `flag` (
  `idflag` int(11) NOT NULL COMMENT 'รหัส',
  `countryname_th` varchar(100) NOT NULL COMMENT 'ชื่อประเทศภาษาไทย',
  `countryname_en` char(50) NOT NULL COMMENT 'ชื่อประเทศภาษาอังกฤษ',
  `picture` varchar(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `flag`
--

INSERT INTO `flag` (`idflag`, `countryname_th`, `countryname_en`, `picture`) VALUES
(1, 'สหรัฐอเมริกา', 'The United States', 'us.png'),
(2, 'เกาหลีใต้', 'South Korea', 'kr.png'),
(3, 'จีน', 'China', 'cn.png'),
(4, 'แคนาดา', 'Canada', 'ca.png'),
(5, 'ออสเตรเลีย', 'Australia', 'au.png'),
(6, 'ญี่ปุ่น', 'Japan', 'jp.png');

-- --------------------------------------------------------

--
-- Table structure for table `industryplan`
--

CREATE TABLE `industryplan` (
  `id` int(11) NOT NULL COMMENT 'รหัส',
  `planyear` varchar(4) NOT NULL COMMENT 'ปี',
  `plandate` date NOT NULL COMMENT 'ว.ด.ป.',
  `plandetail` text NOT NULL COMMENT 'สรุปสาระสำคัญ',
  `planfile` varchar(200) DEFAULT NULL COMMENT 'เอกสาร',
  `industrydid` int(11) NOT NULL COMMENT 'สรุปสาระสำคัญ'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Table structure for table `industry_d`
--

CREATE TABLE `industry_d` (
  `id` int(11) NOT NULL COMMENT 'รหัส',
  `industryhid` int(11) NOT NULL COMMENT 'ชื่อเรื่อง',
  `background` text NOT NULL COMMENT 'ความเป็นมา',
  `objecttive` text NOT NULL COMMENT 'วัตถุประสงค์',
  `about` text NOT NULL COMMENT 'เรื่องที่เกี่ยวข้องกับ กห.',
  `status` text COMMENT 'สรุปสาระสำคัญ'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `industry_d`
--

INSERT INTO `industry_d` (`id`, `industryhid`, `background`, `objecttive`, `about`, `status`) VALUES
(1, 1, 'sdfsd', 'sdfsd', 'sdf', 'sdf'),
(2, 2, 'sdfsd', 'sdfsd', 'fsd', 'sdfsdf'),
(4, 4, 'sdf', 'sfd', 'sdf', NULL),
(5, 5, 'sfd', 'sdfs', 'sf', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `industry_h`
--

CREATE TABLE `industry_h` (
  `id` int(11) NOT NULL COMMENT 'รหัส',
  `title` varchar(250) NOT NULL COMMENT 'ชื่อเรื่อง'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `industry_h`
--

INSERT INTO `industry_h` (`id`, `title`) VALUES
(1, 'การปฏิรูปด้านการส่งกำลังบำรุง'),
(2, 'คณะทำงานแก้ไขปัญหาการบุกรุกที่ดินในความครอบครอง ดูแลใช้ประโยชน์ของหน่วยงานทางทหาร'),
(4, 'การประชุม'),
(5, 'การพัฒนาที่ดิน 3 ปี');

-- --------------------------------------------------------

--
-- Table structure for table `log`
--

CREATE TABLE `log` (
  `log_id` smallint(6) NOT NULL,
  `username` varchar(30) COLLATE utf8_unicode_ci NOT NULL,
  `url_address` tinytext COLLATE utf8_unicode_ci NOT NULL,
  `ip_address` varchar(30) COLLATE utf8_unicode_ci NOT NULL,
  `log_type` varchar(30) COLLATE utf8_unicode_ci NOT NULL,
  `log_date` datetime NOT NULL,
  `log_fulltext` text COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `log`
--

INSERT INTO `log` (`log_id`, `username`, `url_address`, `ip_address`, `log_type`, `log_date`, `log_fulltext`) VALUES
(1, 'admin', 'site', '127.0.0.1', 'login', '2016-03-14 23:04:55', 'User admin login[ UserID=admin ] "site"   From 127.0.0.1'),
(2, 'rattana.t', 'site', '127.0.0.1', 'login', '2016-03-15 01:50:48', 'User rattana.t login[ UserID=rattana.t ] "site"   From 127.0.0.1'),
(3, 'admin', 'site', '127.0.0.1', 'login', '2016-03-15 14:52:35', 'User admin login[ UserID=admin ] "site"   From 127.0.0.1'),
(4, 'admin', 'site', '127.0.0.1', 'login', '2016-03-15 15:23:23', 'User admin login[ UserID=admin ] "site"   From 127.0.0.1'),
(5, 'admin', 'site', '127.0.0.1', 'login', '2016-03-15 21:54:01', 'User admin login[ UserID=admin ] "site"   From 127.0.0.1'),
(6, 'admin', 'site', '127.0.0.1', 'login', '2016-03-15 23:02:08', 'User admin login[ UserID=admin ] "site"   From 127.0.0.1'),
(7, 'admin', 'site', '127.0.0.1', 'login', '2016-03-15 23:03:35', 'User admin login[ UserID=admin ] "site"   From 127.0.0.1'),
(8, 'admin', 'site', '127.0.0.1', 'login', '2016-03-15 23:07:20', 'User admin login[ UserID=admin ] "site"   From 127.0.0.1'),
(9, 'admin', 'site', '127.0.0.1', 'login', '2016-03-15 23:11:54', 'User admin login[ UserID=admin ] "site"   From 127.0.0.1'),
(10, 'admin', 'site', '127.0.0.1', 'login', '2016-03-15 23:20:34', 'User admin login[ UserID=admin ] "site"   From 127.0.0.1'),
(11, 'admin', 'site', '127.0.0.1', 'login', '2016-03-17 00:34:15', 'User admin login[ UserID=admin ] "site"   From 127.0.0.1'),
(12, 'admin', 'site', '127.0.0.1', 'login', '2016-03-21 10:36:00', 'User admin login[ UserID=admin ] "site"   From 127.0.0.1'),
(13, 'admin', 'site', '127.0.0.1', 'login', '2016-03-21 10:47:18', 'User admin login[ UserID=admin ] "site"   From 127.0.0.1'),
(14, 'admin', 'tbluser', '127.0.0.1', 'UpdateUser', '2016-03-21 10:49:17', 'User admin UpdateUser[ UserID=3 saichon.c\n                        สายชล ช้างแก้วมณี saichon.c@navy.mi.th ] "tbluser"   From 127.0.0.1'),
(15, 'admin', 'tbluser', '127.0.0.1', 'UpdateUser', '2016-03-21 10:50:00', 'User admin UpdateUser[ UserID=2 rattana.t\n                        รัตนะ เต้นปักษี rattana.t@navy.mi.th ] "tbluser"   From 127.0.0.1'),
(16, 'admin', 'tbluser', '127.0.0.1', 'UpdateUser', '2016-03-21 10:50:15', 'User admin UpdateUser[ UserID=1 admin\n                        รัตนะ เต้นปักษี rattana.t@navy.mi.th ] "tbluser"   From 127.0.0.1'),
(17, 'admin', 'site', '127.0.0.1', 'login', '2016-03-21 12:33:27', 'User admin login[ UserID=admin ] "site"   From 127.0.0.1'),
(18, 'admin', 'tbluser', '127.0.0.1', 'UpdateUser', '2016-03-21 13:41:43', 'User admin UpdateUser[ UserID=1 admin\n                        รัตนะ เต้นปักษี rattana.t@navy.mi.th ] "tbluser"   From 127.0.0.1'),
(19, 'admin', 'tbluser', '127.0.0.1', 'UpdateUser', '2016-03-21 13:41:56', 'User admin UpdateUser[ UserID=3 saichon.c\n                        สายชล ช้างแก้วมณี saichon.c@navy.mi.th ] "tbluser"   From 127.0.0.1'),
(20, 'admin', 'site', '127.0.0.1', 'login', '2016-03-21 13:42:11', 'User admin login[ UserID=admin ] "site"   From 127.0.0.1'),
(21, 'admin', 'site', '127.0.0.1', 'login', '2016-03-21 13:43:29', 'User admin login[ UserID=admin ] "site"   From 127.0.0.1'),
(22, 'admin', 'tbluser', '127.0.0.1', 'UpdateUser', '2016-03-21 13:48:02', 'User admin UpdateUser[ UserID=4 test\n                        ทดสอบ ระบบ mail ] "tbluser"   From 127.0.0.1'),
(23, 'admin', 'site', '127.0.0.1', 'login', '2016-03-21 13:49:07', 'User admin login[ UserID=admin ] "site"   From 127.0.0.1'),
(24, 'admin', 'site', '127.0.0.1', 'login', '2016-03-21 13:59:57', 'User admin login[ UserID=admin ] "site"   From 127.0.0.1'),
(25, 'admin', 'site', '127.0.0.1', 'login', '2016-03-21 17:24:57', 'User admin login[ UserID=admin ] "site"   From 127.0.0.1'),
(26, 'admin', 'site', '127.0.0.1', 'login', '2016-03-21 17:28:09', 'User admin login[ UserID=admin ] "site"   From 127.0.0.1'),
(27, 'admin', 'site', '127.0.0.1', 'login', '2016-03-22 05:38:55', 'User admin login[ UserID=admin ] "site"   From 127.0.0.1'),
(28, 'admin', 'site', '127.0.0.1', 'login', '2016-03-24 13:10:32', 'User admin login[ UserID=admin ] "site"   From 127.0.0.1'),
(29, 'admin', 'site', '127.0.0.1', 'login', '2016-03-24 13:37:41', 'User admin login[ UserID=admin ] "site"   From 127.0.0.1'),
(30, 'admin', 'site', '127.0.0.1', 'login', '2016-03-28 20:40:28', 'User admin login[ UserID=admin ] "site"   From 127.0.0.1'),
(31, 'admin', 'site', '127.0.0.1', 'login', '2016-03-28 20:40:40', 'User admin login[ UserID=admin ] "site"   From 127.0.0.1'),
(32, 'admin', 'site', '127.0.0.1', 'login', '2016-03-29 09:10:59', 'User admin login[ UserID=admin ] "site"   From 127.0.0.1'),
(33, 'admin', 'site', '127.0.0.1', 'login', '2016-03-29 10:18:24', 'User admin login[ UserID=admin ] "site"   From 127.0.0.1'),
(34, 'admin', 'tbluser', '127.0.0.1', 'UpdateUser', '2016-03-29 10:19:28', 'User admin UpdateUser[ UserID=4 akadet.j\n                        อัครเดช จุณศิริ akadet.j@navy.mi.th ] "tbluser"   From 127.0.0.1'),
(35, 'admin', 'site', '127.0.0.1', 'login', '2016-03-29 11:49:06', 'User admin login[ UserID=admin ] "site"   From 127.0.0.1'),
(36, 'admin', 'site', '127.0.0.1', 'login', '2016-03-29 11:59:34', 'User admin login[ UserID=admin ] "site"   From 127.0.0.1'),
(37, 'admin', 'site', '127.0.0.1', 'login', '2016-03-29 13:20:05', 'User admin login[ UserID=admin ] "site"   From 127.0.0.1'),
(38, 'admin', 'site', '127.0.0.1', 'login', '2016-05-11 08:45:31', 'User admin login[ UserID=admin ] "site"   From 127.0.0.1'),
(39, 'admin', 'site', '127.0.0.1', 'login', '2016-05-11 08:47:21', 'User admin login[ UserID=admin ] "site"   From 127.0.0.1'),
(40, 'admin', 'site', '127.0.0.1', 'login', '2016-05-16 13:23:44', 'User admin login[ UserID=admin ] "site"   From 127.0.0.1'),
(41, 'admin', 'site', '10.102.40.248', 'login', '2016-05-16 13:37:43', 'User admin login[ UserID=admin ] "site"   From 10.102.40.248'),
(42, 'admin', 'site', '127.0.0.1', 'login', '2016-05-16 14:55:31', 'User admin login[ UserID=admin ] "site"   From 127.0.0.1'),
(43, 'admin', 'site', '127.0.0.1', 'login', '2016-05-29 20:32:11', 'User admin login[ UserID=admin ] "site"   From 127.0.0.1'),
(44, 'admin', 'site', '127.0.0.1', 'login', '2016-05-29 20:32:39', 'User admin login[ UserID=admin ] "site"   From 127.0.0.1'),
(45, 'admin', 'site', '127.0.0.1', 'login', '2016-06-05 21:29:57', 'User admin login[ UserID=admin ] "site"   From 127.0.0.1'),
(46, 'admin', 'site', '127.0.0.1', 'login', '2016-06-09 22:39:16', 'User admin login[ UserID=admin ] "site"   From 127.0.0.1'),
(47, 'admin', 'site', '127.0.0.1', 'login', '2016-06-11 21:47:36', 'User admin login[ UserID=admin ] "site"   From 127.0.0.1'),
(48, 'admin', 'site', '127.0.0.1', 'login', '2016-06-12 23:09:24', 'User admin login[ UserID=admin ] "site"   From 127.0.0.1');

-- --------------------------------------------------------

--
-- Table structure for table `manual`
--

CREATE TABLE `manual` (
  `idmanul` int(11) NOT NULL COMMENT 'รหัส',
  `description` varchar(255) NOT NULL COMMENT 'ชื่อเอกสาร',
  `file` varchar(255) NOT NULL COMMENT 'ไฟล์เอกสาร',
  `createdate` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT 'วันที่บันทึก',
  `createby` varchar(20) NOT NULL COMMENT 'ผู้บันทึก'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `manual`
--

INSERT INTO `manual` (`idmanul`, `description`, `file`, `createdate`, `createby`) VALUES
(8, 'ทดสอบ', 'ชี้แจง นขต.สนผ.กห.  ธ.ค.58.ppt', '2016-03-21 06:27:21', 'admin'),
(9, 'sdfsdfsdsdsd', '2558.xlsx', '2016-06-05 19:14:01', 'admin'),
(10, 'sdfsdfsdsdsd', '2558.xlsx', '2016-06-05 19:14:53', 'admin');

-- --------------------------------------------------------

--
-- Table structure for table `operation`
--

CREATE TABLE `operation` (
  `idoperation` int(11) NOT NULL COMMENT 'รหัส',
  `oyear` varchar(4) NOT NULL COMMENT 'ปี',
  `odate` date NOT NULL COMMENT 'วันที่',
  `description` varchar(255) NOT NULL COMMENT 'รายการ',
  `file` varchar(255) NOT NULL COMMENT 'เอกสาร',
  `createdate` timestamp NULL DEFAULT CURRENT_TIMESTAMP COMMENT 'วันที่บันทึก',
  `createby` varchar(20) DEFAULT NULL COMMENT 'ผู้บันทึก'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `operation`
--

INSERT INTO `operation` (`idoperation`, `oyear`, `odate`, `description`, `file`, `createdate`, `createby`) VALUES
(1, '2559', '2016-03-20', 'ทดสอบระบบ', 'doc.xlsx', '0000-00-00 00:00:00', 'admin');

-- --------------------------------------------------------

--
-- Table structure for table `plan`
--

CREATE TABLE `plan` (
  `id` int(11) NOT NULL COMMENT 'รหัส',
  `planyear` varchar(4) NOT NULL COMMENT 'ปี',
  `plandate` date NOT NULL COMMENT 'ว.ด.ป.',
  `plandetail` text NOT NULL COMMENT 'สรุปสาระสำคัญ',
  `planfile` varchar(200) DEFAULT NULL COMMENT 'เอกสาร',
  `coid` int(11) NOT NULL COMMENT 'ความร่วมมือ'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Table structure for table `procure`
--

CREATE TABLE `procure` (
  `idprocure` int(11) NOT NULL COMMENT 'รหัส',
  `unitname` varchar(100) NOT NULL COMMENT 'หน่วย',
  `description` varchar(255) NOT NULL COMMENT 'รายการ',
  `procure_type` enum('จัดซื้อ','จัดจ้าง') NOT NULL COMMENT 'จัดซื้อ/จ้าง',
  `budgetyear` varchar(10) NOT NULL COMMENT 'งบปี',
  `method` varchar(100) DEFAULT NULL COMMENT 'วิธีการจัดซื้อ/จ้าง',
  `budget` decimal(15,2) DEFAULT NULL COMMENT 'วงเงิน',
  `approve_type` enum('รมว.กห','ปล.กห.','หน.นขต.สป.') NOT NULL COMMENT 'อำนาจอนุมัติ',
  `procure_status` enum('การดำเนินการ ของ นขต.สป. และเหล่าทัพ','การดำเนินการของ สงป.กห.','นำเรียน ปล.กห./รมว.กห.','รมว.กห.อนุมัติแล้ว','ปล.กห.อนุมัติแล้ว') DEFAULT NULL COMMENT 'สถานะ',
  `approvedate` date DEFAULT NULL COMMENT 'วันที่ รมว.กห/ปล.กห..อนุมัติ',
  `saler` varchar(255) DEFAULT NULL COMMENT 'ผู้ขาย/ผู้รับจ้าง',
  `product` varchar(255) DEFAULT NULL COMMENT 'ผลิตภัณฑ์/ตราอักษร',
  `approve_budget` decimal(15,2) DEFAULT NULL,
  `country` varchar(100) DEFAULT NULL COMMENT 'ประเทศ',
  `period` int(5) DEFAULT NULL COMMENT 'ระยะเวลาส่งมอบ',
  `editor` date DEFAULT NULL COMMENT 'วันที่แก้ไขสัญญา',
  `remark` text COMMENT 'หมายเหตุ',
  `file` varchar(255) DEFAULT NULL COMMENT 'เอกสารอ้างอิง'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `procure`
--

INSERT INTO `procure` (`idprocure`, `unitname`, `description`, `procure_type`, `budgetyear`, `method`, `budget`, `approve_type`, `procure_status`, `approvedate`, `saler`, `product`, `approve_budget`, `country`, `period`, `editor`, `remark`, `file`) VALUES
(1, 'รอ.', 'รอ. ขออนุมัติจ้างงานโครงการก่อสร้างอาคารปฏิบัติการและที่พักเตรียมพร้อม รอ. บริเวณวัดสร้อยทอง เขตบางซื่อ กรุงเทพฯ ตามผลการประกวดราคาจ้างด้วยวิธีการทางอิเล็กทรอนิกส์', 'จัดจ้าง', '57-61', '', 0.00, 'ปล.กห.', '', '2014-08-20', 'บริษัท ไอยเรศ จำกัด', '', 878500000.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(2, 'ทท.', 'บก.ทท. (นทพ.) ขออนุมัติซื้อชุดขุดเจาะบ่อน้ำตื้น ตามผลการประกวดราคาซื้อด้วยวิธีการทางอิเล็กทรอนิกส์', 'จัดซื้อ', '57', '', 0.00, '', 'ปล.กห.อนุมัติแล้ว', '2014-06-13', 'บริษัท สิมะอารีย์ เอ็นจิเนียริ่ง จำกัด', '', 142699000.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(3, 'ทท.', 'บก.ทท.(ศรภ.) ขออนุมัติซื้อรถยนต์นั่งและรถยนต์ปฏิบัติการติดตั้งเกราะป้องกันกระสุน ตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ', 'จัดซื้อ', '57', '', 0.00, '', '', '2014-06-13', 'บริษัท โกลบอล อาร์เมอร์ (ประเทศไทย) จำกัด', '', 175421000.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(4, 'ทท.', 'บก.ทท. (สส.ทหาร) ขออนุมัติซื้อพร้อมติดตั้งเพื่อปรับปรุงเครือข่ายระบบโทรคมนาคมทหาร พร้อมอุปกรณ์ประกอบตามโครงการพัฒนาระบบโทรคมนาคมทหาร ตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ', 'จัดซื้อ', '57-60', '', 0.00, 'ปล.กห.', '', '2014-07-17', 'บริษัท สามารถคอมเทค จำกัด', '', 534575210.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(5, 'ทท.', 'บก.ทท.(นทพ.) ขออนุมัติซื้อยุทโธปกรณ์สายช่างตามโครงการเพิ่มขีดความสามารถยุทโธปกรณ์สายช่าง ของ นทพ. (ระยะที่ 1) \n( รถเกลี่ย จำนวน 15 คัน )', 'จัดซื้อ', '57', '', 0.00, '', '', '2014-12-30', 'บริษัท ยูซึไอ คอนสตรัคชั่น จำกัด', '', 106822000.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(6, 'ทท.', 'บก.ทท.(นทพ.) ขออนุมัติซื้อ\nรถขุดตักแขนยาว จำนวน 6 คัน', 'จัดซื้อ', '57', '', 0.00, '', '', '2014-12-30', 'บริษัท อีซูซุ ประกิตมอเตอร์ บ้านโป่ง จำกัด', '', 35340000.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(7, 'ทท.', 'บก.ทท.(นทพ.) ขออนุมัติซื้อ\nรถยนต์บรรทุกเทท้าย จำนวน 30 คัน', 'จัดซื้อ', '57', '', 0.00, '', '', '2014-12-30', 'บริษัท ยูซึไอ คอนสตรัคชั่น จำกัด', '', 125575000.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(8, 'ทท.', 'บก.ทท. (สยย.ทหาร) ขออนุมัติจ้างก่อสร้างอาคารแผนกช่างกลโลหะ รร.ชท.สปท.ตามผลการประกวดราคาจ้างด้วยวิธีการทางอิเล็กทรอนิกส์', 'จัดจ้าง', '55-59', '', 0.00, '', '', '2014-12-30', 'บริษัท ดีวีพี คอนสตรัคชั่น จำกัด', '', 119248500.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(9, 'ทท.', 'บก.ทท. (สยย.ทหาร) ขออนุมัติจ้างก่อสร้างอาคารบ้านพักสวัสดิการข้าราชการ นทพ. (พื้นที่นาวง) ตามผลการประกวดราคาจ้างด้วยวิธีการทางอิเล็กทรอนิกส์', 'จัดจ้าง', '57-60', '', 0.00, '', '', '2015-07-24', 'ห้างหุ้นส่วนจำกัด สตาร์เฟอร์นิเจอร์', '', 200000000.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(10, 'ทบ.', 'ทบ.(พธ.ทบ.) ขออนุมัติซื้อผ้าสีพราง (ต้านการยับ หน้ากว้างไม่น้อยกว่า 45 นิ้ว ความยาวม้วนละ 40 เมตร เศษที่เหลือไม่นับ) จำนวน 1.365,207 เมตร ตามผลการประกวดราคาซื้อด้วยวิธีการทางอิเล็กทรอนิกส์', 'จัดซื้อ', '57', '', 0.00, '', '', '2014-02-21', 'บริษัท เลิศพิพัฒน์วัฒนา จำกัด', '', 256931957.40, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(11, 'ทบ.', 'ทบ.(สพ.ทบ.) ขออนุมัติซื้อ สป.5 สำหรับอาวุธที่ติดตั้งบนยานเกราะล้อยาง แบบ BTR-3E1 ตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ', 'จัดซื้อ', '57', '', 0.00, 'ปล.กห.', '', '1970-01-01', 'บริษัท UKRSPCEXPORT ประเทศยูเครน', '', 60003527.20, 'ประเทศยูเครน', NULL, '0000-00-00', '', NULL),
(12, 'ทบ.', 'ทบ.(สส.) ขออนุมัติซื้อชุดวิทยุระดับหมวดขึ้นไป จำนวน 6 รายการ ตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ', 'จัดซื้อ', '57-60', '', 0.00, 'ปล.กห.', '', '1970-01-01', 'บริษัท Elbit Systems Land And C4I Ltd.  รัฐอิสราเอล', '', 372886421.30, 'รัฐอิสราเอล', NULL, '0000-00-00', '', NULL),
(13, 'ทบ.', 'ทบ.(สพ.ทบ.) ขออนุมัติซื้อกระสุนปืนเล็ก ขนาด 5.56 มม. ชนิดธรรมดามีแกนเหล็ก จำนวน 15,512,447 นัด ตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ', 'จัดซื้อ', '57', '', 0.00, '', '', '2014-09-23', 'บริษัท CHINA NORTH INDUSTRIES CORPORATION (NORINCO) สาธารณรัฐประชาชนจีน', '', 146.00, 'สาธารณรัฐประชาชนจีน', NULL, '0000-00-00', '', NULL),
(14, 'ทบ.', 'ทบ.(สส.) ขออนุมัติซื้อเรดาร์แจ้งเตือนภัยเนิ่น แบบที่ 1 จำนวน 1 ระบบ ตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ', 'จัดซื้อ', '57-59', '', 0.00, '', '', '2014-09-26', 'บริษัท Airbus Defence and Space GmbH. สหพันธ์สาธารณรัฐเยอรมนี', '', 524999317.57, 'สหพันธ์สาธารณรัฐเยอรมนี', NULL, '0000-00-00', '', NULL),
(15, 'ทบ.', 'ทบ.(สพ.ทบ.) ขออนุมัติซื้อปืนกลอากาศ ขนาด .50 นิ้ว (12.7 มิลลิเมตร) จำนวน 5 ชุด ตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ', 'จัดซื้อ', '57', '', 0.00, '', '', '2014-09-29', 'บริษัท รอยัล ดีเฟนส์ จำกัด', '', 69500000.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(16, 'ทบ.', 'ทบ.(สพ.ทบ.) ขออนุมัติซื้อชุดอุปกรณ์แจ้งเตือนอาวุธนำวิถี/ป้องกันภัยอากาศยาน ระบบเลเซอร์ รุ่น MUSIC สำหรับ ฮ.ท.60 พร้อมการติดตั้ง การฝึกอบรมและการใช้งานและการซ่อมบำรุง จำนวน  1 ชุด ตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ', 'จัดซื้อ', '57', '', 0.00, '', '', '2014-10-10', 'บริษัท Elbit Systems Electro - optics Elop Ltd. \nรัฐอิสลาเอล', '', 89460000.00, 'รัฐอิสลาเอล', NULL, '0000-00-00', '', NULL),
(17, 'ทบ.', 'ทบ.(ขส.ทบ.) ขออนุมัติซื้อระบบเครื่องยนต์ และ สป.เพิ่มเติม สำหรับ ฮ.ท.17 จำนวน 9 รายการ พร้อมหลักสูตรการฝึกอบรม จำนวน 2 รายการ   ตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ', 'จัดซื้อ', '57', '', 0.00, '', '', '2014-12-08', 'บริษัท ดาต้าเกท จำกัด', '', 89370000.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(18, 'ทบ.', 'ทบ./ศปก.ทบ.(สส.) ขออนุมัติซื้อระบบเรดาร์กำหนดที่ตั้งอาวุธยิงสนับสนุนระยะไกล สนับสนุนการปฏิบัติภารกิจของ พล.ป. ตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ', 'จัดซื้อ', '57', '', 0.00, '', '', '2014-12-08', 'บริษัท อัพเดท ดีเวลลอปเม้นท์ จำกัด', '', 950000000.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(19, 'ทบ.', 'ทบ.(สพ.ทบ.) ขออนุมัติซื้อรถยนต์บรรทุก ขนาด 2 1/2 ตัน จำนวน 100 คัน ตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ', 'จัดซื้อ', '57', '', 0.00, '', '', '2014-12-22', 'บริษัท อิทธิพร อิมปอร์ต จำกัด', '', 361125000.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(20, 'ทบ.', 'ทบ.(ขส.ทบ.) ขออนุมัติซื้อรถยนต์โดยสารขนาดใหญ่ ปรับอากาศ แบบที่ 6 จำนวน 165 คัน ตามผลการประกวดราคาซื้อด้วยวิธีการทางอิเล็กทรอนิกส์', 'จัดซื้อ', '57', '', 0.00, '', '', '2014-11-09', 'บริษัท อิทธิพร อิมปอร์ต จำกัด', '', 985149000.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(21, 'ทบ.', 'ทบ.(พธ.ทบ.) ขออนุมัติจ้างผลิตรองเท้าสูงครึ่งน่อง จำนวน 164,537 คู่ ตามผลการประกวดราคาจ้างด้วยวิธีการทางอิเล็กทรอนิกส์', 'จัดจ้าง', '57', '', 0.00, '', '', '2014-02-21', 'บริษัท เอส แอนด์ อาร์ ฟุตแวร์ จำกัด', '', 179180793.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(22, 'ทบ.', 'ทบ.(พธ.ทบ.) ขออนุมัติจ้างผลิตเครื่องแบบสนาม จำนวน 61,556 ชุด ตามผลการประกวดราคาจ้างด้วยวิธีการทางอิเล็กทรอนิกส์', 'จัดจ้าง', '57', '', 0.00, '', '', '2014-03-12', 'บริษัท เสรียุทธภัณฑ์ จำกัด', '', 108892564.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(23, 'ทบ.', 'ทบ.(สพ.ทบ.) ขออนุมัติจ้างซ่อมและปรับปรุงรถถังเบาแบบ 21 (สกอร์เปี้ยน) จำนวน 19 คัน ตามผลการดำเนินกรรมวิธีจัดจ้างโดยวิธีพิเศษ', 'จัดจ้าง', '57', '', 0.00, '', '', '2014-06-13', 'บริษัท อัพเดท ดีเวลลอปเม้นท์ จำกัด', '', 399475000.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(24, 'ทบ.', 'ทบ.(ยย.ทบ.) ขออนุมัติจ้างก่อสร้างอาคารเฉลิมพระเกียรติ สมเด็จพระนางเจ้าฯพระบรมราชินีนาถ ของ รพ.รร.6   ตามผลการดำเนินกรรมวิธีประกวดราคาจ้างด้วยวิธีการทางอิเล็กทรอนิกส์', 'จัดจ้าง', '57-59', 'พิเศษ', 0.00, 'ปล.กห.', 'การดำเนินการ ของ นขต.สป. และเหล่าทัพ', '2014-08-28', 'บริษัท เบ็ญจมาศ จำกัด', '', 2588950000.00, '', NULL, '0000-00-00', '', ''),
(25, 'ทบ.', 'ทบ./ศปก.ทบ.(พธ.ทบ.) ขออนุมัติจ้างผลิตเสื้อเกราะป้องกันกระสุน (กอ.รมน.ภาค 4 สน.) ตามผลการดำเนินกรรมวิธีจัดจ้างโดยวิธีพิเศษ', 'จัดจ้าง', '57', '', 0.00, '', '', '2014-09-24', 'บริษัท ช.ไพศาล จำกัด', '', 73851450.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(26, 'ทบ.', 'ทบ.(ขส.ทบ.) ขออนุมัติจ้างซ่อมคืนสภาพ บ.ท.41 หมายเลข 41060 จำนวน 1 โครงการ ตามผลการดำเนินกรรมวิธีจัดจ้างโดยวิธีพิเศษ', 'จัดจ้าง', '57', '', 0.00, '', '', '2014-10-06', 'บริษัท โรยัลสกาย จำกัด', '', 78200000.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(27, 'ทบ.', 'ทบ.(สส.) ขออนุมัติจ้างซ่อมโครงสร้าง ระบบติดต่อสื่อสารและไฟฟ้าของ ฮ.ท.17 หมายเลข 764 M03 ตามผลการดำเนินกรรมวิธีจัดจ้างโดยวิธีพิเศษ', 'จัดจ้าง', '57', '', 0.00, '', '', '2014-11-24', 'บริษัท JSC "Roso boronexport"\nสหพันธรัฐรัสเซีย', '', 63155238.03, 'สหพันธรัฐรัสเซีย', NULL, '0000-00-00', '', NULL),
(28, 'ทบ.', 'ทบ.(ขส.ทบ.) ขออนุมัติจ้างซ่อม ENGINE ASSEMBLY, TWINED ฮ.ท.212 ตามผลการดำเนินกรรมวิธีจัดจ้างโดยวิธีพิเศษ', 'จัดจ้าง', '57', '', 0.00, '', '', '2014-12-25', 'บริษัท โรยัลสกาย จำกัด', '', 71150000.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(29, 'ทบ.', 'ทบ. (สพ.ทบ.) ขออนุมัติซื้อชุดอุปกรณ์แจ้งเตือนอาวุธนำวิถี/ป้องกันภัยอากาศยาน ระบบเลเซอร์ รุ่น MUSIC สำหรับ ฮ.ท.60 พร้อมการติดตั้ง การฝึกอบรมและการใช้งานและการซ่อมบำรุง จำนวน  1 ชุด ตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ', 'จัดซื้อ', '57', '', 0.00, '', '', '2014-10-10', 'บริษัท Elbit Systems Electro - optics Elop Ltd. รัฐอิสลาเอล', '', 89460000.00, 'รัฐอิสลาเอล', NULL, '0000-00-00', '', NULL),
(30, 'ทบ.', 'ทบ. (ขส.ทบ.) ขออนุมัติซื้อ ฮ.ใช้งานทั่วไปขนาดเบา แบบที่ 2 รุ่น EC-145T2 จำนวน 6 เครื่อง ตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ', 'จัดซื้อ', '57-59', '', 0.00, '', '', '2014-12-22', 'บริษัท Airbus helicopters สาธารณรัฐฝรั่งเศส', '', 2725935375.35, 'สาธารณรัฐ    ฝรั่งเศส', NULL, '0000-00-00', '', NULL),
(31, 'ทบ.', 'ทบ. (สพ.ทบ.) ขออนุมัติซื้อระบบอาวุธ ปตอ. ระยะปานกลาง-ไกล แบบที่ 1 จำนวน 1 ระบบ ตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ', 'จัดซื้อ', '57', '', 0.00, '', '', '2015-03-01', 'บริษัท MBDA FRANCE \nสาธารณรัฐฝรั่งเศส', '', 2612336540.54, 'สาธารณรัฐ     ฝรั่งเศส', NULL, '0000-00-00', '', NULL),
(32, 'ทบ.', 'ทบ. (สพ.ทบ.) ขออนุมัติซื้อรถเกราะล้อยาง ชนิดลำเลียงพล 4x4 แบบ REVA III S จำนวน 5 คัน ตามผลการดำเนินกรรมวิธีจัดซื้อ\nโดยวิธีพิเศษ', 'จัดซื้อ', '56', '', 0.00, '', '', '2015-02-20', 'บริษัท INTERGRATED CONVOY PROTECTION (PTY) LTD. \nสาธารณรัฐแอฟริกาใต้', '', 75618352.97, 'สาธารณรัฐแอฟริกาใต้', NULL, '0000-00-00', '', NULL),
(33, 'ทบ.', 'ทบ. (ขส.ทบ.) ขออนุมัติซื้อ ฮ.ใช้งานทั่วไปขนาดกลาง ยี่ห้อ Agusta แบบ AW 139 จำนวน 2 เครื่อง ตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ', 'จัดซื้อ', '57-60', '', 0.00, '', '', '2015-03-26', 'บริษัท Agusta Westland \nสาธารณรัฐอิตาลี', '', 1473871638.99, 'สาธารณรัฐอิตาลี', NULL, '0000-00-00', '', NULL),
(34, 'ทร.', 'ทร. ขออนุมัติซื้อระบบค้นหาเป้าหมายทางบก ตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ', 'จัดซื้อ', '57', '', 0.00, '', '', '2014-06-13', 'บริษัท Saab AB (publ), Electronic Defence Systems ราชอาณาจักรสวีเดน', '', 649400000.00, 'ราชอาณาจักรสวีเดน', NULL, '0000-00-00', '', NULL),
(35, 'ทร.', 'ทร.(ขส.ทร.) ขออนุมัติซื้อรถยนต์บรรทุกทางทหาร ตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ', 'จัดซื้อ', '57-59', '', 0.00, '', '', '2014-06-25', 'บริษัท พนัส แอสแซมบลีย์ จำกัด', '', 209997000.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(36, 'ทร.', 'ทร.(สพ.ทร.) ขออนุมัติซื้อกล้องตรวจการณ์ ตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ', 'จัดซื้อ', '57', '', 0.00, 'ปล.กห.', '', '2014-08-18', 'บริษัท จันทร์เกษมอินเตอร์เนทชั่นแนล จำกัด', '', 81855000.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(37, 'ทร.', 'ทร. ขออนุมัติซื้อ ฮ.ลำเลียง แบบรุ่น EC 645 T2 ตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ', 'จัดซื้อ', '57-60', '', 0.00, 'ปล.กห.', '', '2014-08-28', 'บริษัท Airbus Helicopters \nสาธารณรัฐฝรั่งเศส', '', 2492039601.60, 'สาธารณรัฐฝรั่งเศส', NULL, '0000-00-00', '', NULL),
(39, 'ทร.', 'ทร. ขออนุมัติจ้างสร้างเรือตรวจการณ์ชายฝั่ง ตามผลการดำเนินกรรมวิธีจัดจ้างโดยวิธีพิเศษ', 'จัดจ้าง', '57-59', '', 0.00, 'ปล.กห.', '', '2014-08-21', 'บริษัท มาร์ซัน จำกัด', '', 708639600.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(40, 'ทร.', 'ทร.(ชย.ทร.) ขออนุมัติจ้างก่อสร้างอาคารที่พักผู้โดยสาร ท่าอากาศยานอู่ตะเภา ในพื้นที่ กบร.กร.(ส่วนที่เหลือ) ตามผลการประกวดราคาจ้างด้วยวิธีการทางอิเล็กทรอนิกส์', 'จัดจ้าง', '55-56', '', 0.00, 'ปล.กห.', '', '2014-09-01', 'บริษัท เสรีการโยธา จำกัด', '', 619168888.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(41, 'ทร.', 'ทร.(ชย.ทร.) ขออนุมัติจ้างก่อสร้างลานจอดเครื่องบิน ท่าอากาศยานอู่ตะเภา ในพื้นที่ กบร.กร.ตามผลการประกวดราคาจ้างด้วยวิธีการทางอิเล็กทรอนิกส์', 'จัดจ้าง', '57-58', 'พิเศษ', 0.00, 'รมว.กห', 'การดำเนินการ ของ นขต.สป. และเหล่าทัพ', '2014-10-01', 'บริษัท ซัคเซ็ส เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น จำกัด', '', 102900000.00, '', NULL, '0000-00-00', '', ''),
(42, 'ทร.', 'ทร.(กบร.ทร.) ขออนุมัติจ้างซ่อมคืนสภาพ ฮ.ลล.4 (S-76B) หมายเลข 2311 ตามผลการดำเนินกรรมวิธีจัดจ้างโดยวิธีพิเศษ', 'จัดจ้าง', '57', '', 0.00, '', '', '2014-11-21', 'บริษัท Vector Aerospace Helicopter Service Inc. ประเทศแคนาดา', '', 121348875.00, 'ประเทศแคนาดา', NULL, '0000-00-00', '', NULL),
(43, 'ทร.', 'ทร. (สพ.ทร.) โครงการจัดหาเรือ\nตรวจการณ์ปืน ระยะที่ 2/2 ตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ\n- ซื้อระบบอำนวยการรบและระบบควบคุมการยิง', 'จัดจ้าง', '57-59', '', 0.00, '', '', '2014-10-06', '-บริษัท THALES NEDERLAND B.V.\nราชอาณาจักรเนเธอร์แลนด์', '', 178703552.00, 'ราชอาณาจักรเนเธอร์แลนด์', NULL, '0000-00-00', '', NULL),
(44, 'ทร.', 'โครงการจัดหาเรือตรวจการณ์ปืน ระยะที่ 2/2 ตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ \n - ซื้อระบบปืนขนาด 76/62 มม. อัตโนมัติ', 'จัดจ้าง', '57-59', '', 0.00, '', '', '2014-10-06', 'บริษัท OTO MELARA S.p.A.\nสาธารณรัฐอิตาลี', '', 91928340.42, 'สาธารณรัฐอิตาลี', NULL, '0000-00-00', '', NULL),
(45, 'ทร.', 'โครงการจัดหาเรือตรวจการณ์ปืน ระยะที่ 2/2 ตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ \n - ซื้อระบบปืนกลขนาด 30 มม.', 'จัดจ้าง', '57-59', '', 0.00, '', '', '2014-10-06', 'บริษัท MSI - Defence Systems Ltd สหราชอาณาจักรบริเตนใหญ่ และไอร์แลนด์เหนือ', '', 59999967.15, 'สหราชอาณาจักรบริเตนใหญ่ และไอร์แลนด์เหนือ', NULL, '0000-00-00', '', NULL),
(46, 'ทร.', 'ทร. (อร.) ขออนุมัติซื้ออะไหล่ซ่อมทำเครื่องจักรใหญ่ ตราอักษร MTU รุ่น 20V 1163 TB83 หมายเลข 1 2 3 และ 4 ขั้น MAJOR OVERHAUL ร.ล.เจ้าพระยา ตามผลการดำเนินกรรมวิธีจัดซื้อ\nโดยวิธีพิเศษ', 'จัดซื้อ', '57', '', 0.00, '', '', '2015-03-25', 'บริษัท MTU ASIA PTE. LTD. \nสาธารณรัฐสิงคโปร์', '', 74946695.54, 'สาธารณรัฐสิงคโปร์', NULL, '0000-00-00', '', NULL),
(47, 'ทร.', 'ทร. (ชย.ทร.) ขออนุมัติจ้างก่อสร้างลานจอดเครื่องบิน ท่าอากาศยานอู่ตะเภา ในพื้นที่ กบร.กร. ตามผลการประกวดราคาจ้างด้วยวิธีการทางอิเล็กทรอนิกส์', 'จัดจ้าง', '57-59', 'พิเศษ', 0.00, 'รมว.กห', 'การดำเนินการ ของ นขต.สป. และเหล่าทัพ', '2014-10-01', 'บริษัท ซัคเซ็ส เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น จำกัด', '', 102900000.00, '', NULL, '0000-00-00', '', ''),
(48, 'ทร.', 'ทร. (กบร.ทร.) ขออนุมัติจ้างซ่อมคืนสภาพ ฮ.ลล.4 (S-76B) หมายเลข 2311 ตามผลการดำเนินกรรมวิธีจัดจ้างโดยวิธีพิเศษ', 'จัดจ้าง', '57', '', 0.00, '', '', '2014-11-21', 'บริษัท Vector Aerospace Helicopter Service Inc. ประเทศแคนาดา', '', 121348875.00, 'ประเทศแคนาดา', NULL, '0000-00-00', '', NULL),
(49, 'ทร.', 'ทร. ขออนุมัติจ้างปรับปรุงเรือ ลทฝ. ชุด ร.ล.บางระจัน จำนวน 2 ลำ ตามผลการดำเนินกรรมวิธีจัดจ้างโดยวิธีพิเศษ', 'จัดจ้าง', '55-61', '', 0.00, '', '', '2014-09-08', 'บริษัท Atlas Elektronik GmbH สหพันธ์สาธารณรัฐเยอรมนี', '', 2499332321.52, 'สหพันธ์สาธารณรัฐเยอรมนี', NULL, '0000-00-00', '', NULL),
(50, 'ทร.', 'ทร. (ชย.ทร.) ขออนุมัติจ้างก่อสร้างสะพานท่าเทียบเรือ ฐตร.ทรภ.1 (งานก่อสร้างสะพานท่าเทียบเรือพร้อมสิ่งอำนวยความสะดวกส่วนที่เหลือ) ตามผลการดำเนินกรรมวิธีจัดจ้างด้วยวิธีประกวดราคาอิเล็กทรอนิกส์', 'จัดจ้าง', '57-59', '', 0.00, '', '', '0000-00-00', 'บริษัท โปทีม บิลเดอร์ จำกัด', '', 103006947.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(51, 'ทอ.', 'ทอ.(สพ.ทอ.) ขออนุมัติซื้ออุปกรณ์กระเปาะชี้เป้า (Targeting Pod) พร้อมระบบสนับสนุน ตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ', 'จัดซื้อ', '57-59', '', 0.00, 'ปล.กห.', '', '2014-08-01', 'บริษัท Rafael Advanced Defence System Ltd. รัฐอิสราเอล', '', 316907500.00, 'รัฐอิสราเอล', NULL, '0000-00-00', '', NULL),
(52, 'ทอ.', 'ทอ.(สพ.ทอ.) ขออนุมัติซื้อระบบอาวุธต่อสู้อากาศยานระยะปานกลาง ตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ', 'จัดซื้อ', '57-59', '', 0.00, 'ปล.กห.', '', '2014-08-15', 'บริษัท China National Precision Machinery Import&Export Corporation (CPMIEC) สาธารณรัฐประชนจีน', '', 968989676.48, 'สาธารณรัฐประชนจีน', NULL, '0000-00-00', '', NULL),
(53, 'ทอ.', 'ทอ.(สอ.ทอ.) ขออนุมัติซื้อเรดาร์ตรวจอากาศ พร้อมติดตั้งที่ บน.21 ตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ', 'จัดซื้อ', '57', '', 0.00, 'ปล.กห.', '', '2014-08-15', 'บริษัท Enterprise Electronics Corporation สหรัฐอเมริกา', '', 142475760.00, 'สหรัฐอเมริกา', NULL, '0000-00-00', '', NULL),
(54, 'ทอ.', 'ทอ.(ชอ.) ขออนุมัติซื้อ บ.ลาดตระเวนถ่ายภาพทางอากาศ พร้อมติดตั้งอุปกรณ์รองรับระบบอุปกรณ์ถ่ายภาพทางอากาศ ตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ', 'จัดซื้อ', '57-59', '', 0.00, 'ปล.กห.', '', '2014-08-16', 'บริษัท Piaggio Aero Industries S.p.A สาธารณรัฐอิตาลี', '', 310319400.00, 'สาธารณรัฐอิตาลี', NULL, '0000-00-00', '', NULL),
(55, 'ทอ.', 'ทอ.(ชอ.) ขออนุมัติซื้อเครื่องบินพระราชพาหนะสำรอง พร้อมอุปกรณ์สนับสนุนภาคพื้น อะไหล่และการฝึกอบรม ตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ', 'จัดซื้อ', '57-59', '', 0.00, 'ปล.กห.', '', '2014-08-18', 'บริษัท The Boeing Company สหรัฐอเมริกา', '', 3684837853.68, 'สหรัฐอเมริกา', NULL, '0000-00-00', '', NULL),
(56, 'ทอ.', 'ทอ.(ชอ.) ขออนุมัติซื้อเครื่องบินรับ-ส่ง บุคคลสำคัญ   พร้อมอุปกรณ์สนับสนุนภาคพื้น อะไหล่ และการฝึกอบรม ตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ', 'จัดซื้อ', '57-59', '', 0.00, 'ปล.กห.', '', '2014-08-28', 'บริษัท Joint Stock Company “Sukhoi Civil Aircraft” สหพันธรัฐรัสเซีย', '', 2928360000.00, 'สหพันธรัฐรัสเซีย', NULL, '0000-00-00', '', NULL),
(57, 'ทอ.', 'ทอ.(สอ.ทอ.) ขออนุมัติซื้อเรดาร์ป้องกันทางอากาศ พร้อมเรโดม อะไหล่ขั้นต้น และการฝึกอบรม พร้อมการติดตั้ง ณ สร.ภูสิงห์ ตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ', 'จัดซื้อ', '57-59', '', 0.00, '', '', '2014-08-17', 'บริษัท Selex ES S.p.A. สาธารณรัฐอิตาลี', '', 699700161.00, 'สาธารณรัฐอิตาลี', NULL, '0000-00-00', '', NULL),
(58, 'ทอ.', 'ทอ.(ชอ.) ขออนุมัติซื้อ ฮ.ขนาดกลางสำหรับค้นหาและช่วยชีวิตในพื้นที่การรบ ตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ', 'จัดซื้อ', '57-59', '', 0.00, '', '', '2014-09-17', 'บริษัท AIRBUS HELICOPTERS สาธารณรัฐฝรั่งเศส', '', 2148960000.00, 'สาธารณรัฐฝรั่งเศส', NULL, '0000-00-00', '', NULL),
(59, 'ทอ.', 'ทอ.(ชอ.ทอ.) ขออนุมัติจ้างเหมาบริการสนับสนุนเครื่องยนต์และอุปกรณ์ Line Replacement Unit สำหรับ บ.ข.20/ก ตามผลการดำเนินกรรมวิธีจัดจ้างโดยวิธีพิเศษ', 'จัดจ้าง', '57', '', 0.00, '', '', '2013-12-06', 'องค์การรักษาความปลอดภัยด้านการส่งออกทางทหารสวีเดน (The Swedish Defence and Security Export Agency (Försvarsexportmynigheten : FXM))', '', 591175000.00, 'สวีเดน', NULL, '0000-00-00', '', NULL),
(60, 'ทอ.', 'ทอ.ขออนุมัติจ้างสร้างอาคารพักอาศัยรวม น.ประทวน (ครอบครัว) ระยะที่ 1 ตามผลการดำเนินกรรมวิธีจัดจ้างโดยวิธีพิเศษ', 'จัดจ้าง', '57', '', 0.00, '', '', '2014-09-23', 'ห้างหุ้นส่วนจำกัด ดี-ชัย คอนสตรัคชั่น', '', 76926600.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(61, 'ทอ.', 'ทอ. ขออนุมัติจ้างสร้างโรงเก็บ บ.รับ-ส่ง บุคคลสำคัญ ตามผลการดำเนินกรรมวิธีจัดจ้างโดยวิธีพิเศษ', 'จัดจ้าง', '57-59', '', 0.00, '', '', '2014-09-24', 'บริษัท สยามธรรมนนท์ จำกัด', '', 161000000.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(62, 'ทอ.', 'ทอ.(สพ.ทอ.) ขออนุมัติจ้างปรับปรุงโครงสร้างอากาศยานและระบบ Avionics รวมทั้งระบบอาวุธของ บ.ข.18 ข/ค ตามผลการดำเนินกรรมวิธีจัดจ้างโดยวิธีพิเศษ', 'จัดจ้าง', '57-60', '', 0.00, '', '', '2014-09-25', 'บริษัท Elbit Systems Ltd.  รัฐอิสราเอล', '', 2049758000.00, 'รัฐอิสราเอล', NULL, '0000-00-00', '', NULL),
(63, 'ทอ.', 'ทอ.(ชย.ทอ.)ขออนุมัติจ้างก่อสร้างอาคารกองบัญชาการ ตามผลการดำเนินกรรมวิธีจัดจ้าง\nโดยวิธีพิเศษ', 'จัดจ้าง', '57', '', 0.00, '', '', '2014-09-29', 'บริษัท สยามธรรมนนท์ จำกัด', '', 125450000.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(64, 'ทอ.', 'ทอ.(ชย.ทอ.) ขออนุมัติจ้างก่อสร้างอาคารบริวารท่าอากาศยานทหารและระบบสาธารณูปโภคระยะที่ 2 ตามผลการดำเนินกรรมวิธีจัดจ้างโดยวิธีพิเศษ', 'จัดจ้าง', '57', '', 0.00, '', '', '2014-10-10', 'บริษัท ไทยโพลีคอนส์ จำกัด', '', 140980000.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(65, 'สป.', 'โครงการดำรงขีดความสามารถและเพิ่มประสิทธิภาพโรงงานของ ศอว.ศอพท. ประจำปี 59', 'จัดจ้าง', '59', 'พิเศษ', 0.00, '', '', '2015-12-29', 'บริษัท อินดี้ ซัพพลาย เอ็นจิเนียริ่ง จำกัด', '', 76638600.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(66, 'สป.', 'พท.ศอพท.ขออนุมัติสร้างระบบผลิตไฟฟ้าและสูบน้ำด้วยพลังแสงอาทิตย์แบบเคลื่อนที่ ขนาดไม่น้อยกว่า 1,200 วัตต์ พร้อมติดตั้ง จำนวน 200 ระบบ (เงินจากกระทรวงพลังงาน)', 'จัดจ้าง', '59', 'e - bidding', 0.00, '', '', '2016-03-23', 'บริษัท โซลาร์ตรอน  จำกัด(มหาชน)', '', 239787000.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(67, 'สป.', 'โครงการปรับปรุงพัฒนาเครื่องยิงลูกระเบิดขนาด 120 มม. แบบอัตตาจรล้อยางให้กับ รง.ปค.ศอว.ศอพท. ระยะเวลาดำเนินการ 3 ปี', 'จัดจ้าง', '59-61', 'พิเศษ', 0.00, '', '', '2016-03-25', 'บริษัท Elbit System Land  And C41 Ltd.รัฐอิสราเอล', '', 570220000.00, 'รัฐอิสราเอล', NULL, '0000-00-00', '2016-06-05', ''),
(68, 'สป.', '(สสน.สป.)โครงการก่อสร้างอาคารอเนกประสงค์พร้อมสิ่งอำนวยความสะดวกของ สป. (พื้นที่ศรีสมาน)', 'จัดจ้าง', '59', 'e - bidding', 0.00, '', '', '2016-03-29', 'บริษัท ไอยเรศ จำกัด', '', 845000000.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(69, 'สป.', 'ทสอ.กห. จ้างให้บริการสื่อสารข้อมูลอินเทอร์เน็ต ตั้งแต่ ต.ค.58 - ก.ย.59 รวม 12 เดือน ราคาเดือนละ 800,000.- บาท', 'จัดจ้าง', '59', 'พิเศษ', 0.00, 'ปล.กห.', '', '2016-09-29', 'บริษัท สามารถอินโฟเนต จำกัด', '', 9600000.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(70, 'สป.', 'ทสอ.กห. จ้างให้บริการโทรศัพท์เคลื่อนที่ ตั้งแต่ ต.ค.58 - ก.ย.59 รวม 12 เดือน ราคาเดือนละ 735,750.- บาท', 'จัดจ้าง', '59', 'พิเศษ', 0.00, 'ปล.กห.', '', '2016-09-29', 'บริษัท แอดวานซ์ไวร่เลส เน็ทเวอร์ค จำกัด', '', 9114000.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(71, 'สป.', 'ทสอ.กห. เช่าใช้โครงข่ายเส้นใยแก้วนำแสง จาก กฟภ.', 'จัดจ้าง', '59', 'พิเศษ', 0.00, 'ปล.กห.', '', '2016-09-29', 'กฟภ.', '', 25930000.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(72, 'สป.', 'พท.ศอพท. ขออนุมัติจ้างเหมาบริการที่พักของศูนย์ฝึกศุกษาบุคลากรด้านปิโตเลียม และพลังงานทหาร อ.บ้านฉาง จ.ระยอง', 'จัดจ้าง', '59', 'พิเศษ', 0.00, 'ปล.กห.', '', '2016-09-30', 'บริษัท สยามโฮเทลเลียร์ จำกัด', '', 19200000.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(73, 'สป.', 'ทสอ.กห.ขออนุมัติจัดจ้างงานโครงการดำรงสถานภาพระบบเครือข่ายการสื่อสารหลัก (Backbone) ของ กห', 'จัดจ้าง', '59', 'พิเศษ', 0.00, 'ปล.กห.', '', '2016-09-26', 'สามารถคอมเทค', '', 12800000.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(74, 'สป.', 'ทสอ.กห. ขออนุมัติจัดซื้ออุปกรณ์พร้อมติดตั้งเพื่อใช้ในโครงการเคลื่อย้ายระบบ เทคโนโลยีสารสนเทศและการสื่อสาร ณ อาคาร สป. (แจ้งวัฒนะ) ไปยัง (ศรีสมาน)', 'จัดซื้อ', '59', 'พิเศษ', 0.00, 'ปล.กห.', '', '2016-09-28', 'กนกสิน', '', 33771200.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(75, 'สป.', 'รวท.อท.ศอพท. ขออนุมัติซ่อมแซมและปรังปรุงระบบท่อดับเพลิงและสัญาณแจ้งเหตุ', 'จัดจ้าง', '59', 'พิเศษ เงินอุดหนุน', 0.00, 'ปล.กห.', '', '2016-01-28', 'วาย.โอ.เยนเนอรัล ซัพพลาย (1983)', '', 25901792.38, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(76, 'สป.', 'รภท.ศอพท. ขออนุมัติจ้างออกแบบแปลนอาคารและสิ่งอำนวยความสะดวกของ สป.(รภท.ศอพท.)(พื้นที่บ้านโป่ง)', 'จัดจ้าง', '59', 'พิเศษ', 0.00, 'ปล.กห.', '', '2016-01-29', 'บริษัท เอสคิมอาร์คีเต็ค แอนด์ แปลนเนอร์ จำกัด', '', 7000000.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(77, 'สป.', 'พท.ศอพท. ขออนุมัติซ่อมปรับปรุงเพิ่มประสิทธิภาพเครื่องเจาะน้ำมันดิบ IDECO ระยะที่ 1', 'จัดจ้าง', '59', 'พิเศษ เงินอุดหนุน', 0.00, 'ปล.กห.', '', '2016-02-18', 'วาย.โอ.เยนเนอรัล ซัพพลาย (1983)', '', 29700000.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(78, 'สป.', 'พท.ศอพท. ขออนุมัติซ่อมปรับปรุงเพิ่มประสิทธิภาพเครื่องเจาะน้ำมันดิบ PETRO ระยะที่ 1', 'จัดจ้าง', '59', 'พิเศษ เงินอุดหนุน', 0.00, 'ปล.กห.', '', '2016-03-09', 'บริษัท ร่วมพัฒนา ดีเวลป เมนต์ จำกัด', '', 29500000.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(79, 'ทท.', '(ผท.ทหาร) ซื้อกล้องถ่ายภาพทางอากาศเชิงเลข พร้อมชุดอุปกรณ์ จำนวน 1 ชุด (11 รายการ)', 'จัดซื้อ', '59', 'e - bidding', 0.00, '', '', '2015-12-24', 'บริษัท โกลเบิล อินฟอร์เมชั่น จำกัด', '', 236577000.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(80, 'ทท.', 'ศรภ. จัดซื้อระบบรวบรวมข้อมูลข่าวกรองทางการสื่อสารแบบดิจิตอล', 'จัดซื้อ', '59', 'พิเศษ', 0.00, '', '', '2016-02-07', 'บริษัท กันโน่ ซิสเต็มส์ อินทีเกรชั่น จำกัด', '', 59000000.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(81, 'ทท.', 'สยย.ทหาร โครงการก่อสร้างบ้านพักข้าราชการ บก.ทท. ระยะที่ 2 พื้นที่ทุ่งสีกัน 1 และ 4', 'จัดจ้าง', '59', 'e - bidding', 0.00, '', '', '2016-03-09', 'กิจการร่วมค้า เอนคอน - เสรี', '', 163899000.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(82, 'ทบ.', '(ขส.ทบ.) การจ้างเหมาส่งกำลังและซ่อมบำรุงชิ้นส่วนซ่อมสำหรับฟื้นฟู ฮ.ท.1 จำนวน 1 งาน', 'จัดจ้าง', '59', 'พิเศษ', 0.00, '', '', '2015-12-26', 'บริษัท โรยัลสกาย จำกัด', '', 271098601.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(83, 'ทบ.', '(ยย.ทบ.) โครงการก่อสร้างอาคาร ม.พัน 31', 'จัดจ้าง', '59', 'พิเศษ', 0.00, '', '', '2015-12-26', 'บริษัท วิทย์การช่าง จำกัด', '', 219665100.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(84, 'ทบ.', '(ขส.ทบ.) การจ้างเหมาส่งกำลังและซ่อมบำรุงชิ้นส่วนซ่อมสำหรับฟื้นฟู ฮ.ท.212 จำนวน 1 งาน', 'จัดจ้าง', '59', 'พิเศษ', 0.00, '', '', '2015-12-30', 'บริษัท โรยัลสกาย จำกัด', '', 298700805.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(85, 'ทบ.', '(สส.)  จัดหาระบบเครื่องมือแผนที่อัตโนมัติ จำนวน 3 ระบบ', 'จัดจ้าง', '59', 'พิเศษ', 0.00, '', '', '2015-12-30', 'บริษัท วสุรัตน์ แอนด์ แอสโซซิเอท จำกัด', '', 60000000.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(86, 'ทบ.', '(สพ.ทบ.) จ้างซ่อมรถยนต์บรรทุก ขนาด 1 1/4 ตัน ยูนิมอก จำนวน 60 คัน', 'จัดจ้าง', '59', 'พิเศษ', 0.00, '', '', '2015-12-30', 'กิจการร่วมค้าอิทธิพร', '', 60000000.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(87, 'ทบ.', '(สพ.ทบ.) จ้างซ่อมปรับปรุง รสพ. M113 A1 ให้เป็น รสพ. M113 A2 I จำนวน 6 คัน', 'จัดจ้าง', '59', 'พิเศษ', 0.00, '', '', '2015-12-30', 'บริษัท ชัยเสรีเม็ททอล แอนด์รับเบอร์ จำกัด', '', 65994000.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(88, 'ทบ.', '(สพ.ทบ.) ขออนุมัติจ้างผลิต/ประกอบ รยบ.ขนาดเบา 4x4 แบบ 51B (ปรับปรุงใหม่) จำนวน 251 คัน', 'จัดจ้าง', '59', 'พิเศษ', 0.00, '', '', '2016-01-14', 'บริษัท เอส.เอส. ออโตโมทีฟอินดัสตรี จำกัด', '', 342866000.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(89, 'ทบ.', 'สพ.ทบ. จ้างซ่อมปรับปรุงปืนใหญ่ต่อสู้อากาศยาน ขนาด 20 มม. วัลแคน อัตตาจรจำนวน 4 หน่วยยิง', 'จัดจ้าง', '59', 'พิเศษ', 0.00, '', '', '2016-02-05', 'บริษัท ISRAEL MILITARY INDUSTRIES LTD รัฐอิสราเอล', '', 85952000.00, 'รัฐอิสราเอล', NULL, '0000-00-00', '', ''),
(90, 'ทบ.', 'สพ.ทบ. จัดหากระสุนปืนเล็กขนาด 5.56 มม. ธรรมดา จำนวน 18,008,150 นัด', 'จัดจ้าง', '59', 'พิเศษ', 0.00, '', '', '0000-00-00', 'บริษัท POONGSAN', '', 180907001.50, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(91, 'ทบ.', 'สพ.ทบ. จัดหากระสุนปืนเล็ก ขนาด 5.56 มม. ชนิดธรรมดา มีแกนเหล็ก จำนวน 22,000,000 นัด', 'จัดจ้าง', '59', 'พิเศษ', 0.00, '', '', '2016-02-20', 'บริษัท POONGSAN CORPORATION  สาธารณรัฐเกาหลี', '', 235620000.00, 'สาธารณรัฐเกาหลี', NULL, '0000-00-00', '', ''),
(92, 'ทบ.', 'ขส.ทบ. จัดหาอุปกรณ์ระบบตรวจจับแจ้งเตือนและป้องกันอาวุธนำวิถีต่อสู้อากาศยาน พร้อมการติดตั้ง, การฝึกอบรมการใช้งานและการซ่อมบำรุง', 'จัดจ้าง', '59', 'พิเศษ', 0.00, '', '', '2016-02-29', 'บริษัท Elbit Systems Eletro-option Elop LTD รัฐอิสราเอล', '', 196000000.00, 'รัฐอิสราเอล', NULL, '0000-00-00', '', ''),
(93, 'ทบ.', 'สพ.ทบ. จัดหากระสุนปืนใหญ่กลางวิถีโค้ง ขนาด 155 มม. ชนิดส่องแสงเพิ่มระยะกลาง (ILLUM-ER-BT) จำนวน 450 นัด', 'จัดจ้าง', '59', 'พิเศษ', 0.00, '', '', '2016-03-03', 'บริษัท รอยัล ดีเฟนส์ จำกัด', '', 87750000.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(94, 'ทบ.', 'พธ.ทบ.  จ้างผลิตเสื้อยืดคอรูปตัววี (สีกากีแกมเขียว และสีพรางลายดิจิตอล) จำนวน 449,711 ตัว', 'จัดจ้าง', '59', 'e - bidding', 0.00, '', '', '2016-03-03', 'บริษัท ไทยทูเวย์ แฟบริค จำกัด', '', 104715441.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(95, 'ทบ.', 'สพ.ทบ. จัดหากระสุนปืนใหญ่เบาวิถีโค้ง ขนาด 105 มม. ชนิดควัน RP เพิ่มระยะกลาง (RED PHOSPHOROUS ER-BT) จำนวน 720 นัด', 'จัดจ้าง', '59', 'พิเศษ', 0.00, '', '', '2016-03-03', 'บริษัท รอยัล ดีเฟนส์ จำกัด', '', 126000000.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(96, 'ทบ.', 'พธ.ทบ. จ้างผลิตรองเท้าทรงสูงครึ่งน่อง จำนวน 142,785 คู่', 'จัดจ้าง', '59', 'e - bidding', 0.00, '', '', '2016-03-03', 'บริษัท เอส แอนด์ อาร์ ฟุตแวร์ จำกัด', '', 157063500.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(97, 'ทบ.', 'สพ.ทบ. จัดหากระสุนปืนใหญ่กลางวิถีโค้ง ขนาด 155 มม. ชนิดระเบิดแรงสูง (Super High Explosive) จำนวน 750 นัด', 'จัดจ้าง', '59', 'พิเศษ', 0.00, '', '', '2016-03-08', 'บริษัท ISRAEL MILITARY INDUSTRIES LTD (I.M.I)', '', 137700000.00, 'รัฐอิสราเอล', NULL, '0000-00-00', '', ''),
(98, 'ทบ.', 'สพ.ทบ. จัดหาลูกระเบิดยิงจากเครื่องยิงลูกระเบิด ขนาด60 มม. ชนิดส่องแสง แบบที่ 1 จำนวน 1,970 นัด', 'จัดจ้าง', '59', 'พิเศษ', 0.00, '', '', '2016-03-09', 'บริษัท ISRAEL MILITARY INDUSTRIES LTD (I.M.I)', '', 79475788.80, 'รัฐอิสราเอล', NULL, '0000-00-00', '', ''),
(99, 'ทบ.', 'สส.  โครงการจัดหาเครื่องมือสื่อสาร (หน่วย ส.) จำนวน 6 รายการ ได้แก่', 'จัดจ้าง', '59', 'พิเศษ', 0.00, '', '', '2016-03-13', 'บริษัท Elbit System Land  And C41 Ltd.รัฐอิสราเอล', '', 119907001.50, 'รัฐอิสราเอล', NULL, '0000-00-00', '', NULL),
(100, 'ทบ.', 'สส.  โครงการจัดหาเครื่องมือด้านการข่าวตาม อจย.ขกท.', 'จัดจ้าง', '59', 'พิเศษ', 0.00, '', '', '2016-03-13', 'บริษัท เพลสซิ่ง แวลู จำกัด', '', 80000000.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(101, 'ทบ.', 'สพ.ทบ. จัดหาระบบเครื่องควบคุมการยิง รถถัง เอ็ม 60 เอ 3 จำนวน 15 ระบบ', 'จัดจ้าง', '59-61', 'พิเศษ', 0.00, '', '', '2016-03-14', 'บริษัท Elbit System Land  And C41 Ltd.รัฐอิสราเอล', '', 648455310.00, 'รัฐอิสราเอล', NULL, '0000-00-00', '', ''),
(102, 'ทบ.', 'สพ.ทบ. โครงการจัดหา ถ. ทดแทน (ถ.เอ็ม 41) ระยะที่ 2 รถถังหลัก (Main Battle Tank VT4)  จำนวน 28 คัน', 'จัดจ้าง', '59-61', 'G TO G', 0.00, '', '', '2016-03-17', 'รัฐบาลสาธารณรัฐประชาชนจีน (สปจ.)', '', 4985391600.00, 'สาธารณรัฐประชาชนจีน (สปจ.)', NULL, '0000-00-00', '', ''),
(103, 'ทบ.', 'ยย.ทบ. จ้างเหมางานก่อสร้างเรือนรับรองทำเนียบรัฐบาล', 'จัดจ้าง', '59-60', 'พิเศษ', 0.00, '', '', '2016-03-18', 'กิจการร่วมค้า วิทย์การช่าง  -ไซเลนเทค', '', 136987000.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(104, 'ทบ.', 'สส. จัดหาเครื่องมือตรวจระบบเรดาร์ จำนวน 3 ชุด', 'จัดจ้าง', '59', 'พิเศษ', 0.00, '', '', '2016-03-21', 'หจก.ไซแอนติ รีเสริช์', '', 180000000.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(105, 'ทบ.', 'สส.  จัดหาระบบสื่อสารดาวเทียมแบบยุทธวิธีสนับสนุนหน่วยระดับกองพล จำนวน 3 ระบบ', 'จัดจ้าง', '59', 'พิเศษ', 0.00, '', '', '2016-03-22', 'บริษัท ล๊อกซเลย์ ไวร์เลส จำกัด', '', 105000000.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(106, 'ทบ.', 'สพ.ทบ. จัดหาปืนเล็กกล ขนาด 5.56 มม. แบบที่ 1 จำนวน 1,948 กระบอก', 'จัดจ้าง', '59-61', 'พิเศษ', 0.00, '', '', '2016-03-22', 'บริษัท ISRAEL WEAPON INDUSTRIES (IWI) LTD', '', 609466864.00, 'รัฐอิสราเอล', NULL, '0000-00-00', '', ''),
(107, 'ทบ.', 'สพ.ทบ. จ้างซ่อมปืนใหญ่กลางกระสุนวิถีโค้ง 37 ขนาด 155 มม. M109 A5 อัตตาจร จำนวน ๑๐ หน่วยยิง จ้างซ่อมรถสายพานบรรทุกกระสุน M992 A1 จำนวน 10 คัน', 'จัดจ้าง', '59', 'พิเศษ', 0.00, '', '', '2016-03-24', 'บริษัท ฟิโก้ เทคโนโลยี เอ็นจีเนียริ่ง จำกัด', '', 460000000.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(108, 'ทบ.', 'สพ.ทบ. จัดหารถยนต์บรรทุก ขนาด 2 1/2 ตัน จำนวน 404 คัน', 'จัดจ้าง', '59-61', 'พิเศษ', 0.00, '', '', '2016-03-24', 'บริษัท อิทธิพร อิมปอร์ จำกัด', '', 1458945000.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(109, 'ทบ.', '(สพ.ทบ.) ซื้อปืนกล 38 ขนาด 7.62 มม.จำนวน 1,359 กระบอก', 'จัดซื้อ', '59-61', 'พิเศษ', 0.00, '', '', '0000-00-00', 'บริษัท รอยัล ดีเฟนส์ จำกัด', '', 1087200000.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(110, 'ทบ.', 'สพ.ทบ. จัดหาระบบเครื่องควบคุมการยิงรถถัง เอ็ม 60 เอ 3 จำนวน 4 ระบบ', 'จัดจ้าง', '59', 'พิเศษ', 0.00, '', '', '2016-03-25', 'บริษัท Elbit System Land  And C41 Ltd.รัฐอิสราเอล', '', 216151770.00, 'รัฐอิสราเอล', NULL, '0000-00-00', '', ''),
(111, 'ทบ.', 'สพ.ทบ. จัดหาปืนเล็กยาว ขนาด 5.56 มม. แบบที่ 1 จำนวน 15,872 กระบอก', 'จัดจ้าง', '59-61', 'พิเศษ', 0.00, '', '', '2016-03-26', 'บริษัท Israel Weapon Industries (IWI) รัฐอิสราเอล', '', 1212589056.00, 'รัฐอิสราเอล', NULL, '0000-00-00', '', ''),
(112, 'ทบ.', 'พธ.ทบ. จัดซื้อผ้าสีพราง (ต้านการยับ) (หน้ากว้างไม่น้อยกว่า 45 นิ้ว ความยาวม้วนละ 40 เมตร  เศษที่เหลือไม่นับ) จำนวน 1,238,080 เมตร', 'จัดซื้อ', '59', 'e - bidding', 0.00, '', '', '2016-03-29', 'บริษัท ลัทธพลเทรดดิ้ง จำกัด', '', 233997120.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(113, 'ทบ.', 'สพ.ทบ. จัดหาระบบเครื่องควบคุมการยิง รถถัง เอ็ม 60 เอ 1 จำนวน 14 ระบบ', 'จัดจ้าง', '59-61', 'พิเศษ', 0.00, '', '', '2016-03-29', 'บริษัท Elbit System Land  And C41 Ltd.รัฐอิสราเอล', '', 648455310.00, 'รัฐอิสราเอล', NULL, '0000-00-00', '', ''),
(114, 'ทบ.', 'พธ.ทบ. จ้างผลิตเสื้อเกราะป้องกันกระสุน จำนวน 4,200 ตัว', 'จัดจ้าง', '59', 'e - bidding', 0.00, '', '', '2016-03-31', 'บริษัท ช.ไพศาล จำกัด', '', 140238000.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(115, 'ทบ.', 'พธ.ทบ. จ้างผลิตเครื่องแบบสนามแบบกระเป๋าเจาะ จำนวน 86,305 ชุด', 'จัดจ้าง', '59', 'e - bidding', 0.00, '', '', '2016-03-31', 'บริษัท เสรีชัยยุทธภัณฑ์ จำกัด', '', 153363985.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(116, 'ทบ.', 'สพ.ทบ. จัดหาลูกกระสุนปืนใหญ่กลางวิถีโค้ง ขนาด 155 มม. ชนิดระเบิด (PROJECTILE 155 MM HIGH EXPLOSIVE) จำนวน 1,900 นัด', 'จัดจ้าง', '59', 'พิเศษ', 0.00, '', '', '2016-04-08', 'บริษัท PAKISTAN ORDNANCE FACTORIES สาธารณรัฐอิสลามปากีสถาน', '', 65532900.00, 'สาธารณรัฐอิสลามปากีสถาน', NULL, '0000-00-00', '', ''),
(117, 'ทบ.', 'สพ.ทบ. จัดหาดินส่งกระสุนปืนใหญ่ ขนาด 155 มม. เอ็ม 119 (CHRGE 8) จำนวน 2,450 ชุด', 'จัดจ้าง', '59', 'พิเศษ', 0.00, '', '', '2016-04-08', 'บริษัท สยามอินเตอร์เนชั่นแนล (1994) จำกัด', '', 60230800.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(118, 'ทบ.', 'สพ.ทบ. จัดหาดินส่งกระสุนปืนใหญ่ ขนาด 155 มม. โซน 7 (CHARGE,PROPELLING 155 MM ZONE 7) จำนวน 3,162 ชุด', 'จัดจ้าง', '59', 'พิเศษ', 0.00, '', '', '2016-04-22', 'บริษัท สยามอินเตอร์เนชั่นแนล (1994) จำกัด', '', 67303170.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(119, 'ทบ.', 'ขออนุมัติเช่ายานพาหนะ สาย ขส. จำนวน 4 ประเภท', 'จัดจ้าง', '59', 'พิเศษ', 0.00, '', '', '2016-04-24', 'บริษัท เอ็ม.แซท.ดีคารเซ็นเตอร์ บริษัท ที.เค.วาย.ลีสซิ่ง จำกัด', '', 642941820.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(120, 'ทบ.', 'ซื้อระบบเฝ้าตรวจชายแดนเคลื่อนที่ (ระยะที่ 1) พร้อมอุปกรณ์ประกอบ จำนวน 3 รายการ', 'จัดซื้อ', '59', 'พิเศษ', 0.00, '', '', '2016-04-27', 'บริษัท เพลสซิ่ง แวลู จำกัด', '', 99800000.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(121, 'ทร.', 'อร. จ้างซ่อมทำเครื่องใหญ่ ขวา - ซ้าย ตราอักษร MTU รุ่น 20V1163 TB83 ขั้น major OverHaul ร.ล.รัตนโกสินทร์', 'จัดจ้าง', '59', 'พิเศษ', 0.00, '', '', '2016-02-20', 'บริษัท ยูพีเอส เอ็นจิน เซอร์วิส เซ็นเตอร์ จำกัด', '', 72800000.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(122, 'ทร.', 'สยป.ทร. โครงการจัดหาเรือตรวจการณ์ชายฝั่ง จำนวน 5 ลำ', 'จัดจ้าง', '59-61', 'พิเศษ', 0.00, '', '', '2016-03-01', 'บริษัท มาร์ซัน จำกัด', '', 705000000.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(123, 'ทร.', 'ขออนุมัติจ้างปรับปรุงเรือล่าทำลายทุ่นระเบิดใกล้ฝั่ง ชุด ร.ล.บางระจัน', 'จัดจ้าง', '59', 'พิเศษ', 0.00, '', '', '2016-03-22', 'บริษัท THALES UK Ltd. สหราชอาณาจักร บริเตนใหญ่และไอร์แลนด์เหนือ', '', 2749999995.32, 'สหราชอาณาจักร บริเตนใหญ่และไอร์แลนด์เหนือ', NULL, '0000-00-00', '', ''),
(124, 'ทร.', 'ขออนุมัติซื้อปืนกลขนาด 20 มม. แบบ GI-II', 'จัดซื้อ', '59', 'พิเศษ', 0.00, '', '', '2016-03-01', 'บริษัท รอยัล ดีเฟนส์ จำกัด', '', 53800000.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(125, 'ทร.', 'โครงการจัดหาเรือตรวจการณ์ไกลฝั่ง ระยะที่ 3/2  ( จัดซื้อระบบควบคุมบังคับบัญชาและตรวจการณ์ )', 'จัดซื้อ', '59-61', 'พิเศษ', 0.00, '', '', '2016-04-23', 'บริษัท THALES Nederlandฯ', '', 1370817600.00, 'เนเธอร์แลน', NULL, '0000-00-00', '', NULL),
(126, 'ทร.', 'โครงการจัดหาเรือตรวจการณ์ไกลฝั่ง ระยะที่ 3/2  ( จัดซื้อระบบปืนหลัก ปืน 76/62 มม.)', 'จัดซื้อ', '59-61', 'พิเศษ', 0.00, '', '', '2016-04-23', 'บริษัท Finmeccanica s.p.a', '', 333631100.00, 'สาธารณรัฐอิตาลี', NULL, '0000-00-00', '', ''),
(127, 'ทร.', 'โครงการจัดหาเรือตรวจการณ์ไกลฝั่ง ระยะที่ 3/2 ( จัดซื้อระบบปืนรอง ปืน 30 มม.)', 'จัดซื้อ', '59-61', 'พิเศษ', 0.00, '', '', '2016-04-23', 'บริษัท MSI-Defence systems', '', 130257200.00, 'สหราชอาณาจักร บริเตนใหญ่และไอร์แลนด์เหนือ', NULL, '0000-00-00', '', ''),
(128, 'ทร.', 'โครงการจัดหาเรือตรวจการณ์ไกลฝั่ง ระยะที่ 3/2 ( จัดซื้อปล่อยอาวุธนำวิถีพื้นสู่พื้น )', 'จัดซื้อ', '59-61', 'พิเศษ', 0.00, '', '', '2016-04-23', 'บริษัท ล๊อกซ์เล่ย์ จำกัด มหาชน', '', 351066700.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(129, 'ทอ.', 'ขออนุมัติจ้างเหมาบริการสนับสนุนเครื่องยนต์ และอุปกรณ์ Line Replacement Unit (LRUs) สำหรับ บ.ข.20/ก', 'จัดจ้าง', '59', 'พิเศษ', 0.00, '', '', '2015-09-24', 'องค์การรักษาความปลอดภัยด้านการส่งออกทางทหารสวีเดน (The Swedish Defence and Security Export Agency (Försvarsexportmynigheten : FXM))  ราชอาณาจักรสวีเดน', '', 1051810000.00, 'ราชอาณาจักรสวีเดน', NULL, '0000-00-00', '', ''),
(131, 'ทอ.', 'ชย.ทอ. สร้างโรงเก็บ บ.ปฏิบัติการสงครามอิเล็กทรอนิกส์ ที่ บน.7', 'จัดจ้าง', '59', 'พิเศษ', 0.00, '', '', '2016-02-07', 'บริษัท ทีมวิศว์ คอนสรัคชั่น จำกัด', '', 140000000.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(132, 'ทอ.', 'ชย.ทอ. จ้างสร้างโรงตรวจซ่อม ฮ.พระราชพาหนะ พร้อมอุปกรณ์ และสิ่งอำนวยความสะดวก จำนวน 1 โรง', 'จัดจ้าง', '59-60', 'พิเศษ', 0.00, '', '', '2016-02-20', 'บริษัท ที.พี.เอส  วัสดุภัณฑ์ จำกัด', '', 96270000.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(133, 'ทอ.', 'ชย.ทอ. งานติดตั้งระบบผลิตไฟฟ้าด้วยเซลล์แสงอาทิตย์ ขนาด 1 เมกะวัตต์ ที่ บน.2', 'จัดจ้าง', '59', 'พิเศษ', 0.00, '', '', '2016-03-22', 'กิจการร่วมค้า สมาร์ทพาวเวอร์ เอ็นจีเนียริ่ง ไทยวิจิตรประภา', '', 61340000.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(134, 'ทอ.', 'ชย.ทอ. งานติดตั้งระบบผลิตไฟฟ้าด้วยเซลล์แสงอาทิตย์ ขนาด 1 เมกะวัตต์ น้ำพอง ที่ ฝูง.237', 'จัดจ้าง', '59', 'พิเศษ', 0.00, '', '', '2016-03-24', 'บริษัท ไทยรีนิวเอเบิล จำกัด', '', 61380000.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(135, 'ทอ.', 'ชย.ทอ. สร้างอาคารผู้ป่วยนอก - อุบัติเหตุและอาคารบริวาร พร้อมสิ่งอำนวยความสะดวก จำนวน 1 งาน', 'จัดจ้าง', '59-60', 'e - bidding', 0.00, '', '', '2016-03-30', 'บริษัท อิตาเลียนไทย ดีเวลล๊อปเมนต์ จำกัด(มหาชน)', '', 950000000.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(136, 'ทอ.', 'ชย.ทอ. งานติดตั้งระบบผลิตไฟฟ้าด้วยเซลล์อาทิตย์ ขนาด 1 เมกะวัตต์ ที่ รร.การบิน', 'จัดจ้าง', '59', 'พิเศษ', 0.00, '', '', '2016-04-02', 'บริษัท พาวเวอร์โซลูชั่น เทคโนโลยี จำกัด(มหาชน)', '', 61505200.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(137, 'ทอ.', 'ชย.ทอ. . สร้างอาคารคลังพัสดุ กพอ.ชอ. พร้อมสิ่งอำนวยความสะดวก จำนวน 1 งาน', 'จัดจ้าง', '59', 'e - bidding', 0.00, '', '', '2016-04-03', 'บริษัท สยามธรรมนนท์ จำกัด', '', 163079700.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(138, 'ทอ.', 'ชย.ทอ. สร้างบ้านพักอาศัย (แฟลต) ทอ.เขต 6 หลังสถานีรถไฟดอนเมือง  ระยะที่ 1 จำนวน 1 งาน', 'จัดจ้าง', '59', 'e - bidding', 0.00, '', '', '2016-04-04', 'บริษัท รุ่งฟ้าเสริม คอร์ปอเรชั่น จำกัด', '', 290583700.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(139, 'ทอ.', 'ชย.ทอ. ระบบไฟฟ้ากำลัง ระยะที่ 2 จำนวน 1 งาน', 'จัดจ้าง', '59', 'e - bidding', 0.00, '', '', '2016-04-05', 'บริษัท สยามธรรมนนท์ จำกัด', '', 236000000.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(140, 'ทอ.', 'ชย.ทอ. สร้างอาคารที่พักอาศัย น.สัญญาบัตร พร้อมสิ่งอำนวยความสะดวก จำนวน 2 หลัง', 'จัดจ้าง', '59-60', 'e - bidding', 0.00, '', '', '2016-04-05', 'บริษัท รุ่งฟ้าเสริม คอร์ปอเรชั่น จำกัด', '', 393414000.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(141, 'ทท.', 'บก.ทท. (ผท.ทหาร) ขออนุมัติจ้างซ่อมบำรุงระดับโรงงาน บ.ถ่ายภาพทางอากาศ Beechcraft Super King Air B200 หมายเลข 93303 จำนวน 1 เครื่อง (8 รายการ) ตามโครงการซ่อมบำรุงระดับโรงงานตามระยะเวลาของ บ.ปีกติดลำตัว \nตามผลการดำเนินกรรมวิธีจัดจ้างโดยวิธีพิเศษ', 'จัดจ้าง', '58', '', 0.00, '', '', '2015-09-26', 'บริษัท โรยัลสกาย จำกัด', '', 89695000.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(142, 'ทท.', 'ศรภ. ขออนุมัติซื้อยานพาหนะ จำนวน 5 รายการ (20 คัน)', 'จัดซื้อ', '58', 'e - bidding', 0.00, '', '', '2016-03-30', 'บริษัท เอส.ซี.จี.ออโต้ อิมพอร์ต จำกัด', '', 87800000.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(143, 'ทบ.', 'ทบ. (สพ.ทบ.) ขออนุมัติซื้อผ้าสีพราง (ต้านกันยับ) (หน้ากว้างไม่น้อยกว่า 45 นิ้ว ความยาวม้วนละ 40 เมตร เศษที่เหลือไม่นับ) จำนวน 1,282,600 เมตร ตามผลการประกวดราคาซื้อด้วยวิธีการทางอิเล็กทรอนิกส์', 'จัดซื้อ', '58', '', 0.00, '', '', '2015-02-27', 'บริษัท เลิศพิพัฒน์วัฒนา จำกัด', '', 242412534.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(144, 'ทบ.', 'ทบ. (สพ.ทบ.) ขออนุมัติซื้อ สป.5 จำนวน 3 รายการ ตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ', 'จัดซื้อ', '58', '', 0.00, '', '', '2015-05-01', 'บริษัท ดาต้าเกท จำกัด', '', 80254617.50, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(145, 'ทบ.', 'ทบ. (สพ.ทบ.) ขออนุมัติซื้อกระสุนปืนใหญ่ ขนาด 90 มิลลิเมตร ชนิดระเบิด - ส่องวิถี จำนวน 600 นัด ตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ', 'จัดซื้อ', '58', '', 0.00, '', '', '2015-05-01', 'บริษัท MECAR S.A. ราชอาณาจักรเบลเยียม', '', 53457943.20, 'ราชอาณาจักรเบลเยียม', NULL, '0000-00-00', '', ''),
(146, 'ทบ.', 'ทบ. (ขส.ทบ.) ขออนุมัติซื้อชิ้นส่วนซ่อม ฮ.ท.212 จำนวน 128 รายการ ตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ', 'จัดซื้อ', '58', '', 0.00, '', '', '2015-04-30', 'บริษัท โรยัลสกาย จำกัด', '', 59800000.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(147, 'ทบ.', 'ทบ. (สพ.ทบ.) ขออนุมัติซื้อรถยนต์บรรทุก ขนาด 10 ตัน (6X6) สำหรับลากจูงปืนใหญ่ ขนาด 155 มิลลิเมตร จำนวน 7 คัน ตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ', 'จัดซื้อ', '58', '', 0.00, '', '', '2015-04-11', 'บริษัท ดาต้าเกท จำกัด', '', 58276911.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(148, 'ทบ.', 'ทบ. (สพ.ทบ.) ขออนุมัติซื้อระบบเครื่องควบคุมการยิงรถถัง เอ็ม 60 เอ 3 จำนวน 5 ระบบ ตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ', 'จัดซื้อ', '58', '', 0.00, '', '', '2015-04-07', 'บริษัท Elbit Systems  Land and C4I Ltd. รัฐอิสราเอล', '', 209999785.50, 'รัฐอิสราเอล', NULL, '0000-00-00', '', ''),
(149, 'ทบ.', 'ทบ. (ขส.ทบ.) ขออนุมัติซื้อ ฮ.ใช้งานทั่วไปขนาดกลาง ยี่ห้อ Agusta แบบ AW 139 จำนวน 2 เครื่อง ตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ', 'จัดซื้อ', '57-60', '', 0.00, '', '', '2015-03-26', 'บริษัท Agusta Westland \nสาธารณรัฐอิตาลี', '', 1473871638.99, 'สาธารณรัฐอิตาลี', NULL, '0000-00-00', '', ''),
(150, 'ทบ.', 'ทบ. (สส.) ขออนุมัติซื้อระบบเครื่องมือแผนที่อัตโนมัติ จำนวน 3 รายการ ตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ', 'จัดซื้อ', '58', '', 0.00, '', '', '2015-03-23', 'บริษัท วสุรัตน์ แอนด์ แอสโซซิเอท จำกัด', '', 60000000.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(151, 'ทบ.', 'ทบ. (ขส.ทบ.) ขออนุมัติซื้อชุดวิทยุระดับหมวดขึ้นไป จำนวน 6 รายการตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ', 'จัดซื้อ', '58-60', '', 0.00, '', '', '2015-05-26', 'บริษัท Elbit Systems  Land and C4I Ltd. รัฐอิสราเอล', '', 487788848.50, 'รัฐอิสราเอล', NULL, '0000-00-00', '', ''),
(152, 'ทบ.', 'ทบ. (สพ.ทบ.) ขออนุมัติซื้อปืนกล 38 ขนาด 7.62 มม. จำนวน 1,250 กระบอก ตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ', 'จัดซื้อ', '58-60', '', 0.00, '', '', '2015-05-27', 'บริษัท รอยัล ดีเฟนส์ จำกัด', '', 937500000.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(153, 'ทบ.', 'ทบ. (สพ.ทบ.) ซื้อกระสุนปืนเล็ก ขนาด 5.56 มม. ชนิดธรรมดามีแกนเหล็ก จำนวน 18,704,968 นัด นัดละ 0.2894 ดอลลาร์สหรัฐ หรือประมาณ 9.57 บาท ตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ', 'จัดซื้อ', '58', '', 0.00, '', '', '2015-05-27', 'บริษัท Poly Technologies INC. สาธารณรัฐประชาชนจีน', '', 178960978.46, 'สาธารณรัฐประชาชนจีน', NULL, '0000-00-00', '', ''),
(154, 'ทบ.', 'ทบ. (สส.) ขออนุมัติซื้ออากาศยานไร้นักบินขนาดกลางระยะปฏิบัติการไกล จำนวน 1 ระบบ  ตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ', 'จัดซื้อ', '58-60', '', 0.00, '', '', '2015-06-26', 'บริษัท Elbit Systems Ltd.\nรัฐอิสราเอล', '', 899991220.00, 'รัฐอิสราเอล', NULL, '0000-00-00', '', ''),
(155, 'ทบ.', 'ทบ. (สพ.ทบ.) ขออนุมัติซื้อระบบอาวุธนำวิถีต่อสู้อากาศยานระดับต่ำ แบบแล่นไต่ลำนำวิถีด้วยเลเซอร์ จำนวน 16 ชุด ตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ', 'จัดซื้อ', '58-60', '', 0.00, '', '', '2015-07-01', 'บริษัท ดาต้าเกท จำกัด', '', 749999840.00, 'ประเทศไทย', NULL, '0000-00-00', '', ''),
(156, 'ทบ.', 'ทบ. (ขส.ทบ.) ขออนุมัติซื้อระบบตรวจจับแจ้งเตือนและป้องกันอาวุธนำวิถีต่อสู้อากาศยาน ระบบเลเซอร์ รุ่น MUSIC® พร้อมการติดตั้งการฝึกอบรมการใช้งานและการซ่อมบำรุง จำนวน 3 ชุด ตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ', 'จัดซื้อ', '58', '', 0.00, '', '', '2015-07-01', 'บริษัท Elbit Systems Electro-Optics Elop Ltd.รัฐอิสราเอล', '', 268798761.00, '.รัฐอิสราเอล', NULL, '0000-00-00', '', ''),
(157, 'ทบ.', 'ทบ. (สพ.ทบ.) ขออนุมัติซื้อระบบอาวุธ ปตอ.ขนาด 35 มม. (ประเภทลำกล้อง) พร้อมเครื่องควบคุมการยิง ยี่ห้อ Oerlikon skyguard 3 air defence sytem จำนวน 4 ระบบ สำหรับกระสุนชนิด AHEAD รุ่น AHEAD/KETF 35 mm.x228 แบบ PMD 062 ตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ', 'จัดซื้อ', '58-60', '', 0.00, '', '', '2015-07-02', 'บริษัท Rheinmetall Air Defence AG สมาพันธรัฐสวิส', '', 2958393400.00, 'สมาพันธรัฐสวิส', NULL, '0000-00-00', '', ''),
(158, 'ทบ.', 'ทบ. (ขส.ทบ.) ขออนุมัติซื้อ บ.ล.ขนาดกลาง ยี่ห้อ Airbus แบบ C295W จำนวน 1 เครื่อง พร้อมการฝึกนักบินและช่าง อุปกรณ์สำหรับปฏิบัติภารกิจ ชิ้นส่วนซ่อมควบคู่ และการสนับสนุนทางการส่งกำลังบำรุง ตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ', 'จัดซื้อ', '58-60', '', 0.00, '', '', '2015-07-24', 'บริษัท Airbus Defence and Space S.A.ราชอาณาจักรสเปน', '', 1249999968.72, 'ราชอาณาจักรสเปน', NULL, '0000-00-00', '', ''),
(159, 'ทบ.', 'ทบ. (ขส.ทบ.) ขออนุมัติซื้อ ฮ.ใช้งานทั่วไปขนาดกลาง ยี่ห้อ Agusta แบบ AW 139 ผลิตภัณฑ์ของบริษัท Agusta Westland สาธารณรัฐอิตาลี จำนวน 6 เครื่อง ตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ', 'จัดซื้อ', '58-60', '', 0.00, '', '', '2015-08-02', 'บริษัท Agusta Westland สาธารณรัฐอิตาลี', '', 2467403247.01, 'สาธารณรัฐอิตาลี', NULL, '0000-00-00', '', ''),
(160, 'ทบ.', 'ทบ. (สส.) ขออนุมัติซื้อระบบการติดต่อสื่อสารทางยุทธวิธี ซึ่งเป็นผลิตภัณฑ์ของ บริษัท Elbit Systems Land and C4I Ltd.รัฐอิสราเอล จำนวน 5 รายการ ตามผลการดำเนินกรรมวิธีจัดซื้อ\nโดยวิธีพิเศษ', 'จัดซื้อ', '58', '', 0.00, '', '', '2015-08-02', 'บริษัท จันทร์เกษมอินเตอร์เนทชั่นแนล จำกัด', '', 116675556.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(161, 'ทบ.', 'ทบ. (สพ.ทบ.) ซื้อปืนเล็กสั้น ขนาด 5.56 มม. แบบที่ 1 ซึ่งเป็นผลิตภัณฑ์ยี่ห้อ IWI รุ่น MICRO TAVOR (X95) ของ บริษัท Israel Weapon Industries (IWI) Ltd. รัฐอิสราเอล จำนวน 2,000 กระบอก ตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ', 'จัดซื้อ', '58', '', 0.00, '', '', '2015-09-10', 'บริษัท Israel Weapon Industries (IWI) Ltd.รัฐอิสราเอล', '', 150790092.40, 'รัฐอิสราเอล', NULL, '0000-00-00', '', NULL),
(162, 'ทบ.', 'ทบ. (สพ.ทบ.) ขออนุมัติจ้างผลิตเครื่องแบบสนาม จำนวน 74,885 ชุด ตามผลการประกวดราคาจ้างด้วยวิธีการทางอิเล็กทรอนิกส์', 'จัดจ้าง', '58', '', 0.00, '', '', '2015-02-20', 'บริษัท เสรีชัยยุทธภัณฑ์ จำกัด', '', 132845990.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(163, 'ทบ.', 'ทบ. (สพ.ทบ.) ขออนุมัติจ้างผลิตรองเท้าทรงสูงครึ่งน่อง จำนวน 128,040 คู่ ตามผลการประกวดราคาจ้างด้วยวิธีการทางอิเล็กทรอนิกส์', 'จัดจ้าง', '58', '', 0.00, '', '', '2015-02-26', 'บริษัท เมืองทองมหาชัย จำกัด', '', 140075760.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(164, 'ทบ.', 'ทบ./ศปก.ทบ. (พธ.ทบ.) ขออนุมัติจ้างผลิตเสื้อเกราะป้องกันกระสุน \n(กอ.รมน.ภาค 4 สน.) ตามผลการดำเนินกรรมวิธีจัดจ้างโดยวิธีพิเศษ', 'จัดจ้าง', '58', '', 0.00, '', '', '2015-03-19', 'บริษัท ช.ไพศาล จำกัด', '', 113281350.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(165, 'ทบ.', 'ทบ. (สพ.ทบ.) ขออนุมัติจ้างซ่อมรถยนต์บรรทุกขนาด 1 1/4 ตัน ยูนิมอก จำนวน 100 คัน ตามผลการดำเนินกรรมวิธีจัดจ้างโดยวิธีพิเศษ', 'จัดจ้าง', '58', '', 0.00, '', '', '2015-04-21', 'กิจการร่วมค้าอิทธิพร', '', 100000000.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(166, 'ทบ.', 'ทบ. (สพ.ทบ.) ขออนุมติจ้างซ่อมปรับปรุง รสพ.เอ็ม 113 ให้เป็น รสพ.เอ็ม 113 เอ 2 ไอ (เพื่อเพิ่มประสิทธิภาพ) จำนวน 6 คัน ตามผลการดำเนินกรรมวิธีจัดจ้างโดยวิธีพิเศษ', 'จัดจ้าง', '58', '', 0.00, '', '', '2015-04-21', 'บริษัท ชัยเสรี เม็ททอล แอนด์   \nรับเบอร์ จำกัด', '', 66000000.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(167, 'ทบ.', 'ทบ. (สพ.ทบ.) ขออนุมัติจ้างซ่อมปรับปรุงปืนใหญ่ต่อสู้อากาศยาน ขนาด 20 มิลลิเมตร วัลแคน อัตตาจร จำนวน 5 หน่วยยิง  ตามผลการดำเนินกรรมวิธีจัดจ้างโดยวิธีพิเศษ', 'จัดจ้าง', '58', '', 0.00, '', '', '2015-05-01', 'บริษัท ISRAEL MILITARY INDUSTRIES LTD.(I.M.I)     \nรัฐอิสราเอล', '', 99476920.69, 'รัฐอิสราเอล', NULL, '0000-00-00', '', NULL),
(168, 'ทบ.', 'ทบ. (สพ.ทบ.) ขออนุมัติจ้างผลิต/ประกอบ รยบ.ขนาดเบา 4x4 จำนวน 2 รายการ ยี่ห้อ MITSUBISHI TRITON SIWGIE CAB 2.5 GL4WD ตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ', 'จัดจ้าง', '58', '', 0.00, '', '', '2015-07-06', 'บริษัท เอส.เอส.เอส.ออโต้โมทีฟ \nอินดัสตรี จำกัด', '', 373864000.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(169, 'ทบ.', 'ทบ.(ยย.ทบ.) ขออนุมัติจ้างก่อสร้างอาคาร บก.ดย.ทบ. ของ ดย.ทบ. ตามผลการประกวดราคาจ้างด้วยวิธีการทางอิเล็กทรอนิกส์', 'จัดจ้าง', '58-60', '', 0.00, '', '', '2015-07-24', 'กิจการร่วมค้า วิทย์การช่าง-ไซเลนเทค', '', 119290000.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(170, 'ทบ.', 'ทบ. (ทภ.3) ขออนุมัติจ้างเหมางานก่อสร้างอาคารผู้ป่วยนอกและฉุกเฉิน ของ รพ.ค่ายจิรประวัติ (แผน 1) ตามผลการประกวดราคาจ้างด้วยวิธีการทางอิเล็กทรอนิกส์', 'จัดจ้าง', '58', '', 0.00, '', '', '2015-08-27', 'กิจการร่วมค้า ที แอนด์ เอ', '', 175000000.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(171, 'ทร.', 'ทร. (อร.) ขออนุมัติซื้ออะไหล่ซ่อมทำเครื่องจักรใหญ่ ตราอักษร MTU รุ่น 20V 1163 TB83 หมายเลข 1 2 3 และ 4 ขั้น MAJOR OVERHAUL ร.ล.เจ้าพระยา ตามผลการดำเนินกรรมวิธีจัดซื้อ\nโดยวิธีพิเศษ', 'จัดซื้อ', '57', '', 0.00, '', '', '2015-03-25', 'บริษัท MTU ASIA PTE. LTD. \nสาธารณรัฐสิงคโปร์', '', 74946695.54, 'สาธารณรัฐสิงคโปร์', NULL, '0000-00-00', '', NULL),
(172, 'ทร.', 'ทร. (กบร.ทร.) ขออนุมัติซื้อเครื่องยนต์ Model PT6B-36B P/N 3116900-01 ของ ฮ.ลล.4 (S-76B) จำนวน 1 งาน (2 ชุดเครื่อง) \nตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ', 'จัดซื้อ', '58', '', 0.00, '', '', '2015-06-26', 'บริษัท โรยัลสกาย จำกัด', '', 88800000.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(173, 'ทร.', 'ทร. (สพ.ทร.) ขออนุมัติซื้อปืนกลขนาด 20 มม. GI-2 พร้อมอุปกรณ์ ผลิตภัณฑ์ของบริษัท Denel Land Systems สาธารณรัฐแอฟริกาใต้ จำนวน 6 แท่น ตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ', 'จัดซื้อ', '58-60', '', 0.00, '', '', '2015-07-01', 'บริษัท รอยัล ดีเฟนส์ จำกัด', '', 80700000.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(174, 'ทร.', 'ทร. (กบร.ทร.) ขออนุมัติจ้างซ่อมคืนสภาพ ฮ.ปด. (S-70B) หมายเลข 3205 ตามผลการดำเนินกรรมวิธีจัดจ้างโดยวิธีพิเศษ', 'จัดจ้าง', '58', '', 0.00, '', '', '2015-05-18', 'บริษัท Helicopter Support Inc.ประเทศสหรัฐอเมริกา', '', 197507200.00, 'ประเทศสหรัฐอเมริกา', NULL, '0000-00-00', '', NULL),
(175, 'ทร.', 'ทร. (ชย.ทร.) ขออนุมัติจ้างก่อสร้างอาคารที่พักนายทหารสัญญาบัตร ขนาด 80 ครอบครัว จำนวน 1 หลัง พร้อมสิ่งอำนวยความสะดวก\nและระบบสาธารณูปโภค ในพื้นที่ กบพ. ของ สพ.ทร. และ อล.ทร. ตามผลการประกวดราคาจ้างด้วยวิธีการทางอิเล็กทรอนิกส์', 'จัดจ้าง', '58', '', 0.00, '', '', '2015-06-30', 'บริษัท ร้อยเดือน จำกัด', '', 104315000.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL);
INSERT INTO `procure` (`idprocure`, `unitname`, `description`, `procure_type`, `budgetyear`, `method`, `budget`, `approve_type`, `procure_status`, `approvedate`, `saler`, `product`, `approve_budget`, `country`, `period`, `editor`, `remark`, `file`) VALUES
(176, 'ทร.', 'ทร. (สยป.ทร.) ขออนุมัติจ้างสร้างเรือตรวจการณ์ชายฝั่ง จำนวน 4 ลำ ตามผลการดำเนินกรรมวิธีจัดจ้างโดยวิธีพิเศษ', 'จัดจ้าง', '58-60', '', 0.00, '', '', '2015-07-02', 'บริษัท มาร์ซัน จำกัด', '', 489974400.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(177, 'ทร.', 'ทร. (สพ.ทร.) ขออนุมัติจ้างซ่อมปรับปรุงระบบควบคุมการยิง (คคย.) SADRAL และอาวุธปล่อยนำวิถี (อวป.) MISTRAL ของ ร.ล.จักรีนฤเบศร จำนวน 1 งาน ตามผลการดำเนินกรรมวิธีจัดจ้างโดยวิธีพิเศษ', 'จัดจ้าง', '58-60', '', 0.00, '', '', '2015-09-02', 'บริษัท MBDA France สาธารณรัฐฝรั่งเศส', '', 207785596.25, 'สาธารณรัฐฝรั่งเศส', NULL, '0000-00-00', '', NULL),
(178, 'ทร.', 'ทร. ขออนุมัติจ้างสร้างเรือลากจูงขนาดกลาง (ลจก.) จำนวน 1 ลำ พร้อมระบบ อุปกรณ์อะไหล่ เครื่องมือ เอกสาร ส่วนสนับสนุน การทดสอบทดลอง น้ำมันเชื้อเพลิง น้ำมันหล่อลื่น การฝึกอบรม การตรวจรับ และพิธีกรรมต่างๆ ตามผลการดำเนินกรรมวิธีจัดจ้างโดยวิธีพิเศษ', 'จัดจ้าง', '58-60', '', 0.00, '', '', '2015-09-08', 'บริษัท อิตัลไทยมารีน จำกัด', '', 338000000.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(179, 'ทอ.', 'ทอ. (ชอ.) ขออนุมัติซื้อเครื่องบินฝึกนักบินขับไล่ขั้นต้น จำนวน 4 เครื่อง ตามผลการดำเนินกรรมวิธีจัดซื้อโดยวิธีพิเศษ', 'จัดซื้อ', '58-60', '', 0.00, '', '', '2015-09-10', 'บริษัท Korea Aerospace Industries \nสาธารณรัฐเกาหลี', '', 3698992856.00, 'สาธารณรัฐเกาหลี', NULL, '0000-00-00', '', NULL),
(180, 'ทอ.', 'ทอ. (ชออ.) ขออนุมัติจ้างเหมาบริการสนับสนุนเครื่องยนต์และอุปกรณ์ Line Replacement Unit สำหรับ บ.ข.20/ก ตามผลการดำเนินกรรมวิธีจัดจ้างโดยวิธีพิเศษ', 'จัดจ้าง', '58', '', 0.00, '', '', '2014-09-30', 'องค์การรักษาความปลอดภัยด้านการส่งออกทางทหารสวีเดน (The Swedish Defence and Security Export Agency (Försvarsexportmynigheten : FXM))', '', 699999999.49, 'สวีเดน', NULL, '0000-00-00', '', NULL),
(181, 'ทอ.', 'ทอ. (สอ.ทอ.) ขออนุมัติจ้างซ่อม Mission System ของ บ.ค.1 (Saab 340 AEW) ระดับโรงงาน จำนวน 1 งาน ตามผลการดำเนินกรรมวิธีจัดจ้างโดยวิธีพิเศษ', 'จัดจ้าง', '58', '', 0.00, '', '', '2015-09-29', 'องค์การรักษาความปลอดภัยด้านการส่งออกทางทหารสวีเดน (The Swedish Defence and Security Export Agency (Försvarsexportmynigheten : FXM))', '', 74900000.00, 'สวีเดน', NULL, '0000-00-00', '', NULL),
(182, 'ทอ.', 'ทอ.(ชย.ทอ.) ขออนุมัติจ้างสร้างอาคารกองวิชาวิศวกรรมเครื่องกลและอุตสาหการ ตามผลการจัดจ้างด้วยวิธีประกวดราคาอิเล็กทรอนิกส์', 'จัดจ้าง', '58', '', 0.00, '', '', '2015-09-30', 'บริษัท สยามธรรมานนท์ จำกัด', '', 121600000.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(183, 'ทอ.', 'ทอ.(ชย.ทอ.) ขออนุมัติจ้างสร้างอาคารกีฬาอเนกประสงค์ ตามผลการจัดจ้างด้วยวิธีประกวดราคาอิเล็กทรอนิกส์', 'จัดจ้าง', '58', '', 0.00, '', '', '2015-09-30', 'บริษัท สยามธรรมานนท์ จำกัด', '', 188900000.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL),
(184, 'ทอ.', 'ทอ.(ชย.ทอ.) ขออนุมัติจ้างสร้างอาคานอน นนอ. ตามผลการจัดจ้างด้วยวิธีประกวดราคาอิเล็กทรอนิกส์', 'จัดจ้าง', '58', '', 0.00, '', '', '2015-09-28', 'บริษัท ไอเอสโอ เอ็นจิเนียริ่ง จำกัด', '', 247990000.00, 'ประเทศไทย', NULL, '0000-00-00', '', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `procure59`
--

CREATE TABLE `procure59` (
  `id` int(11) NOT NULL,
  `unitname` varchar(255) DEFAULT NULL,
  `description` varchar(255) DEFAULT NULL,
  `procure_type` varchar(255) DEFAULT NULL,
  `budgetyear` varchar(255) DEFAULT NULL,
  `method` varchar(255) DEFAULT NULL,
  `budget` varchar(255) DEFAULT NULL,
  `approve_type` varchar(255) DEFAULT NULL,
  `procure_status` varchar(255) DEFAULT NULL,
  `approvedate` varchar(255) DEFAULT NULL,
  `saler` varchar(255) DEFAULT NULL,
  `product` varchar(255) DEFAULT NULL,
  `approve_budget` varchar(255) DEFAULT NULL,
  `country` varchar(255) DEFAULT NULL,
  `peroid` varchar(255) DEFAULT NULL,
  `editor` varchar(255) DEFAULT NULL,
  `remark` varchar(255) DEFAULT NULL,
  `file` varchar(255) DEFAULT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Dumping data for table `procure59`
--

INSERT INTO `procure59` (`id`, `unitname`, `description`, `procure_type`, `budgetyear`, `method`, `budget`, `approve_type`, `procure_status`, `approvedate`, `saler`, `product`, `approve_budget`, `country`, `peroid`, `editor`, `remark`, `file`) VALUES
(1, 'บก.ทท', 'โครงการดำรงขีดความสามารถและเพิ่มประสิทธิภาพโรงงานของ ศอว.ศอพท. ประจำปี 59', 'ซื้อ', '', 'พิเศษ', '76638600.00', 'รมว.กห.', 'รมว.กห.อนุมัติแล้ว', ' 2015-12-29', 'บริษัท อินดี้ ซัพพลาย เอ็นจิเนียริ่ง จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(2, 'บก.ทท', 'พท.ศอพท.ขออนุมัติสร้างระบบผลิตไฟฟ้าและสูบน้ำด้วยพลังแสงอาทิตย์แบบเคลื่อนที่ ขนาดไม่น้อยกว่า 1,200 วัตต์ พร้อมติดตั้ง จำนวน 200 ระบบ (เงินจากกระทรวงพลังงาน)', 'ซื้อ', '', 'e -bidding', '239787000.00', 'รมว.กห.', 'รมว.กห.อนุมัติแล้ว', ' 2016-03-23', 'บริษัท โซลาร์ตรอน  จำกัด(มหาชน)', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(3, 'บก.ทท', '(ผท.ทหาร) ซื้อกล้องถ่ายภาพทางอากาศเชิงเลข พร้อมชุดอุปกรณ์ จำนวน ๑ ชุด (๑๑ รายการ)', 'ซื้อ', '', 'e - bidding', '236577000.00', 'รมว.กห.', 'รมว.กห.อนุมัติแล้ว', ' 2015-12-24', 'บริษัท โกลเบิล อินฟอร์เมชั่น จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(4, 'บก.ทท', 'ศรภ. จัดซื้อระบบรวบรวมข้อมูลข่าวกรองทางการสื่อสารแบบดิจิตอล', 'ซื้อ', '', 'พิเศษ', '59000000.00', 'รมว.กห.', 'รมว.กห.อนุมัติแล้ว', ' 2016-02-07', 'บริษัท กันโน่ ซิสเต็มส์ อินทีเกรชั่น จำกัด ', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(5, 'บก.ทท', 'สยย.ทหาร โครงการก่อสร้างบ้านพักข้าราชการ บก.ทท. ระยะที่ 2 พื้นที่ทุ่งสีกัน 1 และ 4', 'จ้าง', '', 'e - bidding', '163899000.00', 'รมว.กห.', 'รมว.กห.อนุมัติแล้ว', ' 2016-03-09', 'กิจการร่วมค้า เอนคอน - เสรี', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(6, 'ทบ.', '(ขส.ทบ.) การจ้างเหมาส่งกำลังและซ่อมบำรุงชิ้นส่วนซ่อมสำหรับฟื้นฟู ฮ.ท.1 จำนวน 1 งาน', 'จ้าง', '', 'พิเศษ', '271098601.00', 'รมว.กห.', 'รมว.กห.อนุมัติแล้ว', ' 2015-12-26', 'บริษัท โรยัลสกาย จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(7, 'ทบ.', '(ยย.ทบ.) โครงการก่อสร้างอาคาร ม.พัน 31', 'จ้าง', '', 'พิเศษ', '219665100.00', 'รมว.กห.', 'รมว.กห.อนุมัติแล้ว', ' 2015-12-27', 'บริษัท วิทย์การช่าง จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(8, 'ทบ.', '(ขส.ทบ.) การจ้างเหมาส่งกำลังและซ่อมบำรุงชิ้นส่วนซ่อมสำหรับฟื้นฟู ฮ.ท.212 จำนวน 1 งาน', 'จ้าง', '', 'พิเศษ', '298700805.00', 'รมว.กห.', 'รมว.กห.อนุมัติแล้ว', ' 2015-12-30', 'บริษัท โรยัลสกาย จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(9, 'ทบ.', '(สส.)  จัดหาระบบเครื่องมือแผนที่อัตโนมัติ จำนวน 3 ระบบ', 'ซื้อ', '', 'พิเศษ', '60000000.00', 'รมว.กห.', 'รมว.กห.อนุมัติแล้ว', ' 2015-12-31', 'บริษัท วสุรัตน์ แอนด์ แอสโซซิเอท จำกัด ', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(10, 'ทบ.', '(สพ.ทบ.) จ้างซ่อมรถยนต์บรรทุก ขนาด 1 1/4 ตัน ยูนิมอก จำนวน 60 คัน', 'จ้าง', '', 'พิเศษ', '60000000.00', 'รมว.กห.', 'รมว.กห.อนุมัติแล้ว', ' 2015-12-32', 'กิจการร่วมค้าอิทธิพร', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(11, 'ทบ.', '(สพ.ทบ.) จ้างซ่อมปรับปรุง รสพ. M113 A1 ให้เป็น รสพ. M113 A2 I จำนวน 6 คัน', 'จ้าง', '', 'พิเศษ', '65994000.00', 'รมว.กห.', 'รมว.กห.อนุมัติแล้ว', ' 2015-12-33', 'บริษัท ชัยเสรีเม็ททอล แอนด์รับเบอร์ จำกัด ', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(12, 'ทบ.', '(สพ.ทบ.) ขออนุมัติจ้างผลิต/ประกอบ รยบ.ขนาดเบา 4x4 แบบ 51B (ปรับปรุงใหม่) จำนวน 251 คัน ', 'จ้าง', '', 'พิเศษ', '342866000.00', 'รมว.กห.', 'รมว.กห.อนุมัติแล้ว', ' 2016-01-14', 'บริษัท เอส.เอส. ออโตโมทีฟอินดัสตรี จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(13, 'ทบ.', 'สพ.ทบ. จ้างซ่อมปรับปรุงปืนใหญ่ต่อสู้อากาศยาน ขนาด 20 มม. วัลแคน อัตตาจรจำนวน 4 หน่วยยิง', 'ซื้อ', '', 'พิเศษ', '85952000.00', 'รมว.กห.', 'รมว.กห.อนุมัติแล้ว', ' 2016-02-05', 'บริษัท ISRAEL MILITARY INDUSTRIES LTD รัฐอิสราเอล', NULL, NULL, 'รัฐอิสราเอล', NULL, NULL, NULL, NULL),
(14, 'ทบ.', 'สพ.ทบ. จัดหากระสุนปืนเล็กขนาด 5.56 มม. ธรรมดา จำนวน 18,008,150 นัด', 'จ้าง', '', 'พิเศษ', '180907001.50', 'รมว.กห.', NULL, NULL, 'บริษัท POONGSAN ', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(15, 'ทบ.', 'สพ.ทบ. จัดหากระสุนปืนเล็ก ขนาด 5.56 มม. ชนิดธรรมดา มีแกนเหล็ก จำนวน 22,000,000 นัด', 'ซื้อ', '', 'พิเศษ', '235620000.00', 'รมว.กห.', 'รมว.กห.อนุมัติแล้ว', ' 2016-02-20', 'บริษัท POONGSAN CORPORATION  สาธารณรัฐเกาหลี', NULL, NULL, ' สาธารณรัฐเกาหลี', NULL, NULL, NULL, NULL),
(16, 'ทบ.', 'โครงการจัดหาระบบการติดต่อ สื่อสารทางยุทธวิธีจำนวน ๕ รายการ ', 'จ้าง', '', 'พิเศษ', '89977786.40', 'รมว.กห.', 'รมว.กห.อนุมัติแล้ว', ' 2016-02-19', 'บริษัท จันทร์เกษม อินเตอร์เนทชั่นแนล จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(17, 'ทบ.', 'ขส.ทบ. จัดหาอุปกรณ์ระบบตรวจจับแจ้งเตือนและป้องกันอาวุธนำวิถีต่อสู้อากาศยาน พร้อมการติดตั้ง, การฝึกอบรมการใช้งานและการซ่อมบำรุง ', 'ซื้อ', '', 'พิเศษ', '196000000.00', 'รมว.กห.', 'รมว.กห.อนุมัติแล้ว', ' 2016-02-29', 'บริษัท Elbit Systems Eletro-option Elop LTD รัฐอิสราเอล ', NULL, NULL, 'รัฐอิสราเอล', NULL, NULL, NULL, NULL),
(18, 'ทบ.', 'สพ.ทบ. จัดหากระสุนปืนใหญ่กลางวิถีโค้ง ขนาด 155 มม. ชนิดส่องแสงเพิ่มระยะกลาง (ILLUM-ER-BT) จำนวน 450 นัด', 'ซื้อ', '', 'พิเศษ', '87750000.00', 'รมว.กห.', 'รมว.กห.อนุมัติแล้ว', ' 2016-03-03', 'บริษัท รอยัล ดีเฟนส์ จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(19, 'ทบ.', 'พธ.ทบ.  จ้างผลิตเสื้อยืดคอรูปตัววี (สีกากีแกมเขียว และสีพรางลายดิจิตอล) จำนวน 449,711 ตัว', 'จ้าง', '', 'e - bidding', '104715441.00', 'รมว.กห.', 'รมว.กห.อนุมัติแล้ว', ' 2016-03-03', 'บริษัท ไทยทูเวย์ แฟบริค จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(20, 'ทบ.', 'สพ.ทบ. จัดหากระสุนปืนใหญ่เบาวิถีโค้ง ขนาด 105 มม. ชนิดควัน RP เพิ่มระยะกลาง (RED PHOSPHOROUS ER-BT) จำนวน 720 นัด', 'ซื้อ', '', 'พิเศษ', '126000000.00', 'รมว.กห.', 'รมว.กห.อนุมัติแล้ว', ' 2016-03-03', 'บริษัท รอยัล ดีเฟนส์ จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(21, 'ทบ.', 'พธ.ทบ. จ้างผลิตรองเท้าทรงสูงครึ่งน่อง จำนวน 142,785 คู่', 'จ้าง', '', 'e - bidding', '157063500.00', 'รมว.กห.', 'รมว.กห.อนุมัติแล้ว', ' 2016-03-03', 'บริษัท เอส แอนด์ อาร์ ฟุตแวร์ จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(22, 'ทบ.', 'สพ.ทบ. จัดหากระสุนปืนใหญ่กลางวิถีโค้ง ขนาด 155 มม. ชนิดระเบิดแรงสูง (Super High Explosive) จำนวน 750 นัด', 'ซื้อ', '', 'พิเศษ', '137700000.00', 'รมว.กห.', 'รมว.กห.อนุมัติแล้ว', ' 2016-03-08', 'บริษัท ISRAEL MILITARY INDUSTRIES LTD (I.M.I)', NULL, NULL, 'รัฐอิสราเอล', NULL, NULL, NULL, NULL),
(23, 'ทบ.', 'สพ.ทบ. จัดหาลูกระเบิดยิงจากเครื่องยิงลูกระเบิด ขนาด60 มม. ชนิดส่องแสง แบบที่ 1 จำนวน 1,970 นัด', 'ซื้อ', '', 'พิเศษ', '79475788.80', 'รมว.กห.', 'รมว.กห.อนุมัติแล้ว', ' 2016-03-09', 'บริษัท ISRAEL MILITARY INDUSTRIES LTD (I.M.I)', NULL, NULL, 'รัฐอิสราเอล', NULL, NULL, NULL, NULL),
(24, 'ทบ.', 'สส.  โครงการจัดหาชุดวิทยุทดแทน AN/PRC-624 (ระยะที่ 1 ห้วงที่3) จัดหาชุดวิทยุVHF/FM ทางทหารระดับหมู่-มว. ชนิดมือถือ จำนวน 1,307 ชุด', 'ซื้อ', '59 - 61', 'พิเศษ', '420000000.00', 'รมว.กห.', 'รมว.กห.อนุมัติแล้ว', ' 2016-03-09', 'บริษัท Elbit System Land  And C41 Ltd.รัฐอิสราเอล', NULL, NULL, 'รัฐอิสราเอล', NULL, NULL, NULL, NULL),
(25, '', 'สส.  โครงการจัดหาเครื่องมือสื่อสาร (หน่วย ส.) จำนวน ๖ รายการ ได้แก่', 'ซื้อ', '', 'พิเศษ', '119907001.50', 'รมว.กห.', 'รมว.กห.อนุมัติแล้ว', ' 2016-03-13', 'บริษัท Elbit System Land  And C41 Ltd.รัฐอิสราเอล', NULL, NULL, 'รัฐอิสราเอล', NULL, NULL, NULL, NULL),
(26, 'ทบ.', 'สส.  โครงการจัดหาเครื่องมือด้านการข่าวตาม อจย.ขกท.', 'ซื้อ', '', 'พิเศษ', '80000000.00', 'รมว.กห.', 'รมว.กห.อนุมัติแล้ว', ' 2016-03-13', 'บริษัท เพลสซิ่ง แวลู จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(27, 'ทบ.', 'สพ.ทบ. จัดหาระบบเครื่องควบคุมการยิง รถถัง เอ็ม 60 เอ 3 จำนวน 15 ระบบ', 'ซื้อ', '59 - 61', 'พิเศษ', '648455310.00', 'รมว.กห.', 'รมว.กห.อนุมัติแล้ว', ' 2016-03-14', 'บริษัท Elbit System Land  And C41 Ltd.รัฐอิสราเอล', NULL, NULL, 'รัฐอิสราเอล', NULL, NULL, NULL, NULL),
(28, 'ทบ.', 'สพ.ทบ. โครงการจัดหา ถ. ทดแทน (ถ.เอ็ม 41) ระยะที่ 2 รถถังหลัก (Main Battle Tank VT4)  จำนวน ๒๘ คัน', 'จ้าง', '59 - 61', 'G TO G', '4985391600.00', 'รมว.กห.', 'รมว.กห.อนุมัติแล้ว', ' 2016-03-17', 'รัฐบาลสาธารณรัฐประชาชนจีน (สปจ.)', NULL, NULL, 'สาธารณรัฐประชาชนจีน (สปจ.)', NULL, NULL, NULL, NULL),
(29, 'ทบ.', 'ยย.ทบ. จ้างเหมางานก่อสร้างเรือนรับรองทำเนียบรัฐบาล', 'จ้าง', '59 - ๖๐', 'พิเศษ', '136987000.00', 'รมว.กห.', 'รมว.กห.อนุมัติแล้ว', ' 2016-03-18', 'กิจการร่วมค้า วิทย์การช่าง  -ไซเลนเทค ', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(30, 'ทบ.', 'สส. จัดหาเครื่องมือตรวจระบบเรดาร์ จำนวน 3 ชุด ', 'ซื้อ', '', 'พิเศษ', '180000000.00', 'รมว.กห.', 'รมว.กห.อนุมัติแล้ว', ' 2016-03-21', 'หจก.ไซแอนติ รีเสริช์', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(31, 'ทบ.', 'สส.  จัดหาระบบสื่อสารดาวเทียมแบบยุทธวิธีสนับสนุนหน่วยระดับกองพล จำนวน 3 ระบบ', 'ซื้อ', '', 'พิเศษ', '105000000.00', 'รมว.กห.', 'รมว.กห.อนุมัติแล้ว', ' 2016-03-22', 'บริษัท ล๊อกซเลย์ ไวร์เลส จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(32, 'ทบ.', 'สพ.ทบ. จัดหาปืนเล็กกล ขนาด 5.56 มม. แบบที่ 1 จำนวน 1,948 กระบอก', 'ซื้อ', '59 - 61', 'พิเศษ', '609466864.00', 'รมว.กห.', 'รมว.กห.อนุมัติแล้ว', ' 2016-03-22', 'บริษัท ISRAEL WEAPON INDUSTRIES (IWI) LTD ', NULL, NULL, 'รัฐอิสราเอล', NULL, NULL, NULL, NULL),
(33, 'ทบ.', 'สพ.ทบ. จ้างซ่อมปืนใหญ่กลางกระสุนวิถีโค้ง 37 ขนาด 155 มม. M109 A5 อัตตาจร จำนวน ๑๐ หน่วยยิง จ้างซ่อมรถสายพานบรรทุกกระสุน M992 A1 จำนวน 10 คัน', 'จ้าง', '', 'พิเศษ', '460000000.00', 'รมว.กห.', 'รมว.กห.อนุมัติแล้ว', ' 2016-03-24', 'บริษัท ฟิโก้ เทคโนโลยี เอ็นจีเนียริ่ง จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(34, 'ทบ.', 'สพ.ทบ. จัดหารถยนต์บรรทุก ขนาด 2 1/2 ตัน จำนวน 404 คัน', 'ซื้อ', '59 - 61', 'พิเศษ', '1458945000.00', 'รมว.กห.', 'รมว.กห.อนุมัติแล้ว', ' 2016-03-24', 'บริษัท อิทธิพร อิมปอร์ จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(35, 'ทบ.', '(สพ.ทบ.) ซื้อปืนกล 38 ขนาด 7.62 มม.จำนวน 1,359 กระบอก', 'ซื้อ', '59 - 61', 'พิเศษ', '1087200000.00', 'รมว.กห.', 'รมว.กห.อนุมัติแล้ว', ' 2016-03-23', 'บริษัท รอยัล ดีเฟนส์ จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(36, 'ทร.', 'อร. จ้างซ่อมทำเครื่องใหญ่ ขวา - ซ้าย ตราอักษร MTU รุ่น 20V1163 TB83 ขั้น major OverHaul ร.ล.รัตนโกสินทร์', 'ซื้อ', '', 'พิเศษ', '72800000.00', 'รมว.กห.', 'รมว.กห.อนุมัติแล้ว', ' 2016-03-20', 'บริษัท ยูพีเอส เอ็นจิน เซอร์วิส เซ็นเตอร์ จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(37, 'ทร.', 'สยป.ทร. โครงการจัดหาเรือตรวจการณ์ชายฝั่ง จำนวน 5 ลำ', 'ซื้อ', '59 - 61', 'พิเศษ', '705000000.00', 'รมว.กห.', 'รมว.กห.อนุมัติแล้ว', ' 2016-03-01', 'บริษัท มาร์ซัน จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(38, 'ทร.', 'ขออนุมัติจ้างปรับปรุงเรือล่าทำลายทุ่นระเบิดใกล้ฝั่ง ชุด ร.ล.บางระจัน', 'จ้าง', '', 'พิเศษ', '2749999995.32', 'รมว.กห.', 'รมว.กห.อนุมัติแล้ว', ' 2016-03-22', 'บริษัท THALES UK Ltd. สหราชอาณาจักร บริเตนใหญ่และไอร์แลนด์เหนือ', NULL, NULL, ' สหราชอาณาจักร บริเตนใหญ่และไอร์แลนด์เหนือ', NULL, NULL, NULL, NULL),
(39, 'ทอ.', 'ขออนุมัติจ้างเหมาบริการสนับสนุนเครื่องยนต์ และอุปกรณ์ Line Replacement Unit (LRUs) สำหรับ บ.ข.๒๐/ก', 'จ้าง', '', 'พิเศษ', '1051810000.00', 'รมว.กห.', 'รมว.กห.อนุมัติแล้ว', ' 2015-09-24', 'องค์การรักษาความปลอดภัยด้านการส่งออกทางทหารสวีเดน (The Swedish Defence and Security Export Agency (Försvarsexportmynigheten : FXM))  ราชอาณาจักรสวีเดน', NULL, NULL, 'ราชอาณาจักรสวีเดน', NULL, NULL, NULL, NULL),
(40, 'ทอ.', 'ขออนุมัติจ้างก่อสร้างอาคารรับรองบุคคลสำคัญที่ท่าอากาศยานทหาร 2 กองบิน 6', 'จ้าง', '', 'พิเศษ', '96300000.00', 'รมว.กห.', 'รมว.กห.อนุมัติแล้ว', ' 2016-02-01', 'บริษัท อิตาเลียนไทย ดีเวล๊อปเมนต์ จำกัด(มหาชน)', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(41, 'ทอ.', 'ชย.ทอ. สร้างโรงเก็บ บ.ปฏิบัติการสงครามอิเล็กทรอนิกส์ ที่ บน.7', 'จ้าง', '', 'พิเศษ', '140000000.00', 'รมว.กห.', 'รมว.กห.อนุมัติแล้ว', ' 2016-02-07', 'บริษัท ทีมวิศว์ คอนสรัคชั่น จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(42, 'ทอ.', 'ชย.ทอ. จ้างสร้างโรงตรวจซ่อม ฮ.พระราชพาหนะ พร้อมอุปกรณ์ และสิ่งอำนวยความสะดวก จำนวน 1 โรง', 'จ้าง', '59 - ๖๐', 'พิเศษ', '96270000.00', 'รมว.กห.', 'รมว.กห.อนุมัติแล้ว', ' 2016-02-20', 'บริษัท ที.พี.เอส  วัสดุภัณฑ์ จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(43, 'ทอ.', 'ชย.ทอ. งานติดตั้งระบบผลิตไฟฟ้าด้วยเซลล์แสงอาทิตย์ ขนาด ๑ เมกะวัตต์ ที่ บน.2', 'จ้าง', '', 'พิเศษ', '61340000.00', 'รมว.กห.', 'รมว.กห.อนุมัติแล้ว', ' 2016-02-22', 'กิจการร่วมค้า สมาร์ทพาวเวอร์ เอ็นจีเนียริ่ง ไทยวิจิตรประภา', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(44, 'ทอ.', 'ชย.ทอ. งานติดตั้งระบบผลิตไฟฟ้าด้วยเซลล์แสงอาทิตย์ ขนาด ๑ เมกะวัตต์ น้ำพอง ที่ ฝูง.237', 'จ้าง', '', 'พิเศษ', '61380000.00', 'รมว.กห.', 'รมว.กห.อนุมัติแล้ว', ' 2016-02-24', 'บริษัท ไทยรีนิวเอเบิล จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `procure_method`
--

CREATE TABLE `procure_method` (
  `idprocuremethod` int(11) NOT NULL COMMENT 'รหัส',
  `procuremethodname` varchar(255) NOT NULL COMMENT 'วิํธีจัดซื้อ',
  `detail` tinytext COMMENT 'รายละเอียด'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `procure_method`
--

INSERT INTO `procure_method` (`idprocuremethod`, `procuremethodname`, `detail`) VALUES
(1, 'พิเศษ', ''),
(2, 'e-bidding', '');

-- --------------------------------------------------------

--
-- Table structure for table `rank`
--

CREATE TABLE `rank` (
  `idrank` int(11) NOT NULL COMMENT 'ยศ',
  `rank_fullname` varchar(50) NOT NULL COMMENT 'ชื่อยศ',
  `rank_shortname` varchar(20) NOT NULL COMMENT 'ตัวย่อยศ'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `rank`
--

INSERT INTO `rank` (`idrank`, `rank_fullname`, `rank_shortname`) VALUES
(1, 'พลเรือเอก', 'พล.ร.อ.'),
(2, 'พลเรือเอกหญิง', 'พล.ร.อ.หญิง'),
(3, 'พลเรือโท', 'พล.ร.ท.'),
(4, 'พลเรือโทหญิง', 'พล.ร.ท.หญิง'),
(5, 'พลเรือตรี', 'พล.ร.ต.'),
(6, 'พลเรือตรีหญิง', 'พล.ร.ต.หญิง'),
(7, 'นาวาเอก', 'น.อ.'),
(8, 'นาวาเอกหญิง', 'น.อ.หญิง'),
(9, 'นาวาเอก', 'น.อ.'),
(10, 'นาวาเอกหญิง', 'น.อ.หญิง'),
(11, 'ว่าที่นาวาเอก', 'ว่าที่ น.อ.'),
(12, 'ว่าที่นาวาเอกหญิง', 'ว่าที่ น.อ.หญิง'),
(13, 'นาวาโท', 'น.ท.'),
(14, 'นาวาโทหญิง', 'น.ท.หญิง'),
(15, 'ว่าที่นาวาโท', 'ว่าที่ น.ท.'),
(16, 'ว่าที่นาวาโทหญิง', 'ว่าที่ น.ท.หญิง'),
(17, 'นาวาตรี', 'น.ต.'),
(18, 'นาวาตรีหญิง', 'น.ต.หญิง'),
(19, 'ว่าที่นาวาตรี', 'ว่าที่ น.ต.'),
(20, 'ว่าที่นาวาตรีหญิง', 'ว่าที่ น.ต.หญิง'),
(21, 'เรือเอก', 'ร.อ.'),
(22, 'เรือเอกหญิง', 'ร.อ.หญิง'),
(23, 'ว่าที่เรือเอก', 'ว่าที่ ร.อ.'),
(24, 'ว่าที่เรือเอกหญิง', 'ว่าที่ ร.อ.หญิง'),
(25, 'เรือโท', 'ร.ท.'),
(26, 'เรือโทหญิง', 'ร.ท.หญิง'),
(27, 'ว่าที่เรือโท', 'ว่าที่ ร.ท.'),
(28, 'ว่าที่เรือโทหญิง', 'ว่าที่ ร.ท.หญิง'),
(29, 'เรือตรี', 'ร.ต.'),
(30, 'เรือตรีหญิง', 'ร.ต.หญิง'),
(31, 'ว่าที่เรือตรี', 'ว่าที่ ร.ต.'),
(32, 'ว่าที่เรือตรีหญิง', 'ว่าที่ ร.ต.หญิง'),
(33, 'พันจ่าเอก', 'พ.จ.อ.'),
(34, 'พันจ่าเอกหญิง', 'พ.จ.อ.หญิง'),
(35, 'พันจ่าเอก', 'พ.จ.อ.'),
(36, 'พันจ่าเอกหญิง', 'พ.จ.อ.หญิง'),
(37, 'พันจ่าโท', 'พ.จ.ท.'),
(38, 'พันจ่าโทหญิง', 'พ.จ.ท.หญิง'),
(39, 'พันจ่าตรี', 'พ.จ.ต.'),
(40, 'พันจ่าตรีหญิง', 'พ.จ.ต.หญิง'),
(41, 'จ่าเอก', 'จ.อ.'),
(42, 'จ่าเอกหญิง', 'จ.อ.หญิง'),
(43, 'จ่าโท', 'จ.ท.'),
(44, 'จ่าโทหญิง', 'จ.ท.หญิง'),
(45, 'จ่าตรี', 'จ.ต.'),
(46, 'จ่าตรีหญิง', 'จ.ต.หญิง'),
(47, 'พลทหาร', 'พลฯ'),
(48, 'พลอาสาสมัคร', 'พลอาสาฯ'),
(49, 'นาย', 'นาย'),
(50, 'นาง', 'นาง'),
(51, 'นางสาว', 'นางสาว');

-- --------------------------------------------------------

--
-- Table structure for table `register_owner`
--

CREATE TABLE `register_owner` (
  `owner_id` int(11) NOT NULL COMMENT 'PK',
  `owner_fullname` varchar(100) NOT NULL COMMENT 'ชื่อเต็มหน่วย',
  `owner_shortname` varchar(50) NOT NULL COMMENT 'ชื่อย่อหน่วย'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `register_owner`
--

INSERT INTO `register_owner` (`owner_id`, `owner_fullname`, `owner_shortname`) VALUES
(1, 'สนผ.กห.', 'สนผ.กห.');

-- --------------------------------------------------------

--
-- Table structure for table `tbluser`
--

CREATE TABLE `tbluser` (
  `user_id` int(11) NOT NULL COMMENT 'รหัส',
  `user_name` varchar(45) NOT NULL COMMENT 'ชือผู้ใช้',
  `user_pwd` varchar(45) NOT NULL COMMENT 'รหัสผ่าน',
  `pre_name` varchar(45) DEFAULT NULL COMMENT 'คำนำหน้า',
  `first_name` varchar(100) NOT NULL COMMENT 'ชื่อ',
  `last_name` varchar(100) NOT NULL COMMENT 'นามสกุล',
  `department` text COMMENT 'สังกัดหน่วยงาน',
  `email` varchar(45) NOT NULL COMMENT 'อีเมล์',
  `tel` varchar(45) DEFAULT NULL COMMENT 'เบอร์โทรศัพท์',
  `position` varchar(100) DEFAULT NULL COMMENT 'ตำแหน่ง',
  `created` timestamp NULL DEFAULT CURRENT_TIMESTAMP COMMENT 'วันที่สร้าง',
  `modified` datetime DEFAULT NULL COMMENT 'วันที่แก้ไข',
  `user_level` enum('1','2','3') DEFAULT '1' COMMENT 'ระดับผู้ใช้ 1 admin,2 user',
  `last_login` datetime DEFAULT NULL COMMENT 'เข้าระบบล่าสุด',
  `count_visit` int(11) DEFAULT '0' COMMENT 'จำนวนที่เข้า'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;

--
-- Dumping data for table `tbluser`
--

INSERT INTO `tbluser` (`user_id`, `user_name`, `user_pwd`, `pre_name`, `first_name`, `last_name`, `department`, `email`, `tel`, `position`, `created`, `modified`, `user_level`, `last_login`, `count_visit`) VALUES
(1, 'admin', '827ccb0eea8a706c4c34a16891f84e7b', 'เรือเอก', 'รัตนะ', 'เต้นปักษี', 'กพน.สปก.สสท.ทร.', 'rattana.t@navy.mi.th', '57817', 'นายทหารโปรแกรม', '2014-07-18 02:25:46', '2016-03-21 13:41:43', '1', '2016-06-12 23:09:24', 136),
(2, 'rattana.t', 'f1887d3f9e6ee7a32fe5e76f4ab80d63', 'เรือเอก', 'รัตนะ', 'เต้นปักษี', 'กพน.สปก.สสท.ทร.', 'rattana.t@navy.mi.th', '0892034515', 'นายทหารโปรแกรม', '2015-03-30 07:09:16', '2016-03-21 10:50:00', '1', '2016-03-15 01:50:48', 37),
(3, 'saichon.c', '827ccb0eea8a706c4c34a16891f84e7b', 'นาวาโท', 'สายชล', 'ช้างแก้วมณี', 'อรม.อร.', 'saichon.c@navy.mi.th', '', '', '2015-04-09 18:00:26', '2016-03-21 13:41:56', '1', '2016-02-17 13:17:27', 12),
(4, 'akadet.j', '098f6bcd4621d373cade4e832627b4f6', 'นาวาเอก', 'อัครเดช', 'จุณศิริ', 'กองสรรพกำลัง สนผ.กห.', 'akadet.j@navy.mi.th', '', 'ตำแหน่ง', '0000-00-00 00:00:00', '2016-03-29 10:19:28', '1', '0000-00-00 00:00:00', 0);

-- --------------------------------------------------------

--
-- Table structure for table `tbl_procure`
--

CREATE TABLE `tbl_procure` (
  `idprocure` int(11) NOT NULL COMMENT 'รหัส',
  `unitname` varchar(100) NOT NULL COMMENT 'หน่วย',
  `description` varchar(255) NOT NULL COMMENT 'รายการ',
  `procure_type` enum('ซื้อ','จ้าง') NOT NULL COMMENT 'จัดซื้อ/จ้าง',
  `budgetyear` varchar(10) NOT NULL COMMENT 'งบปี',
  `method` varchar(100) DEFAULT NULL COMMENT 'วิธีการจัดซื้อ/จ้าง',
  `budget` decimal(15,2) DEFAULT NULL COMMENT 'วงเงิน',
  `approve_type` enum('รมว.กห','ปล.กห.','หน.นขต.สป.') NOT NULL COMMENT 'อำนาจอนุมัติ',
  `procure_status` enum('การดำเนินการ ของ นขต.สป. และเหล่าทัพ','การดำเนินการของ สงป.กห.','นำเรียน ปล.กห./รมว.กห.','รมว.กห.อนุมัติแล้ว') DEFAULT NULL COMMENT 'สถานะ',
  `approvedate` date DEFAULT NULL COMMENT 'วันที่ รมว.กห/ปล.กห..อนุมัติ',
  `saler` varchar(255) DEFAULT NULL COMMENT 'ผู้ขาย/ผู้รับจ้าง',
  `product` varchar(255) DEFAULT NULL COMMENT 'ผลิตภัณฑ์/ตราอักษร',
  `approve_budget` decimal(10,0) DEFAULT NULL,
  `country` varchar(100) DEFAULT NULL COMMENT 'ประเทศ',
  `period` int(5) DEFAULT NULL COMMENT 'ระยะเวลาส่งมอบ',
  `editor` date DEFAULT NULL COMMENT 'วันที่แก้ไขสัญญา',
  `remark` text COMMENT 'หมายเหตุ',
  `file` varchar(255) DEFAULT NULL COMMENT 'เอกสารอ้างอิง'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `tbl_procure`
--

INSERT INTO `tbl_procure` (`idprocure`, `unitname`, `description`, `procure_type`, `budgetyear`, `method`, `budget`, `approve_type`, `procure_status`, `approvedate`, `saler`, `product`, `approve_budget`, `country`, `period`, `editor`, `remark`, `file`) VALUES
(1, '1', 'โครงการดำรงขีดความสามารถและเพิ่มประสิทธิภาพโรงงานของ ศอว.ศอพท. ประจำปี 59', 'ซื้อ', '59', 'พิเศษ', 76638600.00, '', 'รมว.กห.อนุมัติแล้ว', '2015-12-29', 'บริษัท อินดี้ ซัพพลาย เอ็นจิเนียริ่ง จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(2, '2', 'พท.ศอพท.ขออนุมัติสร้างระบบผลิตไฟฟ้าและสูบน้ำด้วยพลังแสงอาทิตย์แบบเคลื่อนที่ ขนาดไม่น้อยกว่า 1,200 วัตต์ พร้อมติดตั้ง จำนวน 200 ระบบ (เงินจากกระทรวงพลังงาน)', 'จ้าง', '59', 'e -bidding', 239787000.00, '', 'รมว.กห.อนุมัติแล้ว', '2016-03-23', 'บริษัท โซลาร์ตรอน  จำกัด(มหาชน)', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(3, '3', '(ผท.ทหาร) ซื้อกล้องถ่ายภาพทางอากาศเชิงเลข พร้อมชุดอุปกรณ์ จำนวน ๑ ชุด (๑๑ รายการ)', 'ซื้อ', '59', 'e - bidding', 236577000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท โกลเบิล อินฟอร์เมชั่น จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(4, '4', 'ศรภ. จัดซื้อระบบรวบรวมข้อมูลข่าวกรองทางการสื่อสารแบบดิจิตอล', 'ซื้อ', '59', 'พิเศษ', 59000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท กันโน่ ซิสเต็มส์ อินทีเกรชั่น จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(5, '5', 'สยย.ทหาร โครงการก่อสร้างบ้านพักข้าราชการ บก.ทท. ระยะที่ 2 พื้นที่ทุ่งสีกัน 1 และ 4', 'จ้าง', '59', 'e - bidding', 163899000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'กิจการร่วมค้า เอนคอน - เสรี', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(6, '6', '(ขส.ทบ.) การจ้างเหมาส่งกำลังและซ่อมบำรุงชิ้นส่วนซ่อมสำหรับฟื้นฟู ฮ.ท.1 จำนวน 1 งาน', 'จ้าง', '59', 'พิเศษ', 271098601.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท โรยัลสกาย จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(7, '7', '(ยย.ทบ.) โครงการก่อสร้างอาคาร ม.พัน 31', 'จ้าง', '59', 'พิเศษ', 219665100.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท วิทย์การช่าง จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(8, '8', '(ขส.ทบ.) การจ้างเหมาส่งกำลังและซ่อมบำรุงชิ้นส่วนซ่อมสำหรับฟื้นฟู ฮ.ท.212 จำนวน 1 งาน', 'จ้าง', '59', 'พิเศษ', 298700805.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท โรยัลสกาย จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(9, '9', '(สส.)  จัดหาระบบเครื่องมือแผนที่อัตโนมัติ จำนวน 3 ระบบ', 'ซื้อ', '59', 'พิเศษ', 60000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท วสุรัตน์ แอนด์ แอสโซซิเอท จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(10, '10', '(สพ.ทบ.) จ้างซ่อมรถยนต์บรรทุก ขนาด 1 1/4 ตัน ยูนิมอก จำนวน 60 คัน', 'จ้าง', '59', 'พิเศษ', 60000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'กิจการร่วมค้าอิทธิพร', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(11, '11', '(สพ.ทบ.) จ้างซ่อมปรับปรุง รสพ. M113 A1 ให้เป็น รสพ. M113 A2 I จำนวน 6 คัน', 'จ้าง', '59', 'พิเศษ', 65994000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ชัยเสรีเม็ททอล แอนด์รับเบอร์ จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(12, '12', '(สพ.ทบ.) ขออนุมัติจ้างผลิต/ประกอบ รยบ.ขนาดเบา 4x4 แบบ 51B (ปรับปรุงใหม่) จำนวน 251 คัน ', 'จ้าง', '59', 'พิเศษ', 342866000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท เอส.เอส. ออโตโมทีฟอินดัสตรี จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(13, '13', 'สพ.ทบ. จ้างซ่อมปรับปรุงปืนใหญ่ต่อสู้อากาศยาน ขนาด 20 มม. วัลแคน อัตตาจรจำนวน 4 หน่วยยิง', 'จ้าง', '59', 'พิเศษ', 85952000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ISRAEL MILITARY INDUSTRIES LTD รัฐอิสราเอล', NULL, NULL, 'รัฐอิสราเอล', NULL, NULL, NULL, NULL),
(14, '14', 'สพ.ทบ. จัดหากระสุนปืนเล็กขนาด 5.56 มม. ธรรมดา จำนวน 18,008,150 นัด', 'ซื้อ', '59', 'พิเศษ', 180907002.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท POONGSAN ', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(15, '15', 'สพ.ทบ. จัดหากระสุนปืนเล็ก ขนาด 5.56 มม. ชนิดธรรมดา มีแกนเหล็ก จำนวน 22,000,000 นัด', 'ซื้อ', '59', 'พิเศษ', 235620000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท POONGSAN CORPORATION  สาธารณรัฐเกาหลี', NULL, NULL, 'สาธารณรัฐเกาหลี', NULL, NULL, NULL, NULL),
(16, '16', 'โครงการจัดหาระบบการติดต่อ สื่อสารทางยุทธวิธีจำนวน ๕ รายการ', 'ซื้อ', '59', 'พิเศษ', 89977786.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท จันทร์เกษม อินเตอร์เนทชั่นแนล จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(17, '17', 'ขส.ทบ. จัดหาอุปกรณ์ระบบตรวจจับแจ้งเตือนและป้องกันอาวุธนำวิถีต่อสู้อากาศยาน พร้อมการติดตั้ง, การฝึกอบรมการใช้งานและการซ่อมบำรุง ', 'ซื้อ', '59', 'พิเศษ', 196000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท Elbit Systems Eletro-option Elop LTD รัฐอิสราเอล ', NULL, NULL, 'รัฐอิสราเอล', NULL, NULL, NULL, NULL),
(18, '18', 'สพ.ทบ. จัดหากระสุนปืนใหญ่กลางวิถีโค้ง ขนาด 155 มม. ชนิดส่องแสงเพิ่มระยะกลาง (ILLUM-ER-BT) จำนวน 450 นัด', 'ซื้อ', '59', 'พิเศษ', 87750000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท รอยัล ดีเฟนส์ จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(19, '19', 'พธ.ทบ.  จ้างผลิตเสื้อยืดคอรูปตัววี (สีกากีแกมเขียว และสีพรางลายดิจิตอล) จำนวน 449,711 ตัว', 'จ้าง', '59', 'e - bidding', 104715441.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ไทยทูเวย์ แฟบริค จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(20, '20', 'สพ.ทบ. จัดหากระสุนปืนใหญ่เบาวิถีโค้ง ขนาด 105 มม. ชนิดควัน RP เพิ่มระยะกลาง (RED PHOSPHOROUS ER-BT) จำนวน 720 นัด', 'ซื้อ', '59', 'พิเศษ', 126000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท รอยัล ดีเฟนส์ จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(21, '21', 'พธ.ทบ. จ้างผลิตรองเท้าทรงสูงครึ่งน่อง จำนวน 142,785 คู่', 'จ้าง', '59', 'e - bidding', 157063500.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท เอส แอนด์ อาร์ ฟุตแวร์ จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(22, '22', 'สพ.ทบ. จัดหากระสุนปืนใหญ่กลางวิถีโค้ง ขนาด 155 มม. ชนิดระเบิดแรงสูง (Super High Explosive) จำนวน 750 นัด', 'ซื้อ', '59', 'พิเศษ', 137700000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ISRAEL MILITARY INDUSTRIES LTD (I.M.I)', NULL, NULL, 'รัฐอิสราเอล', NULL, NULL, NULL, NULL),
(23, '23', 'สพ.ทบ. จัดหาลูกระเบิดยิงจากเครื่องยิงลูกระเบิด ขนาด60 มม. ชนิดส่องแสง แบบที่ 1 จำนวน 1,970 นัด', 'จ้าง', '59', 'พิเศษ', 79475789.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ISRAEL MILITARY INDUSTRIES LTD (I.M.I)', NULL, NULL, 'รัฐอิสราเอล', NULL, NULL, NULL, NULL),
(24, '24', 'สส.  โครงการจัดหาชุดวิทยุทดแทน AN/PRC-624 (ระยะที่ 1 ห้วงที่3) จัดหาชุดวิทยุVHF/FM ทางทหารระดับหมู่-มว. ชนิดมือถือ จำนวน 1,307 ชุด', 'ซื้อ', '๕๙ - ๖๑', 'พิเศษ', 420000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท Elbit System Land  And C41 Ltd.รัฐอิสราเอล', NULL, NULL, 'รัฐอิสราเอล', NULL, NULL, NULL, NULL),
(25, '25', 'สส.  โครงการจัดหาเครื่องมือสื่อสาร (หน่วย ส.) จำนวน ๖ รายการ ได้แก่', 'ซื้อ', '59', 'พิเศษ', 119907002.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท Elbit System Land  And C41 Ltd.รัฐอิสราเอล', NULL, NULL, 'รัฐอิสราเอล', NULL, NULL, NULL, NULL),
(26, '26', 'สส.  โครงการจัดหาเครื่องมือด้านการข่าวตาม อจย.ขกท.', 'ซื้อ', '59', 'พิเศษ', 80000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท เพลสซิ่ง แวลู จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(27, '27', 'สพ.ทบ. จัดหาระบบเครื่องควบคุมการยิง รถถัง เอ็ม 60 เอ 3 จำนวน 15 ระบบ', 'ซื้อ', '๕๙ - ๖๑', 'พิเศษ', 648455310.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท Elbit System Land  And C41 Ltd.รัฐอิสราเอล', NULL, NULL, 'รัฐอิสราเอล', NULL, NULL, NULL, NULL),
(28, '28', 'สพ.ทบ. โครงการจัดหา ถ. ทดแทน (ถ.เอ็ม 41) ระยะที่ 2 รถถังหลัก (Main Battle Tank VT4)  จำนวน ๒๘ คัน', 'ซื้อ', '๕๙ - ๖๑', 'G TO G', 4985391600.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'รัฐบาลสาธารณรัฐประชาชนจีน (สปจ.)', NULL, NULL, 'สาธารณรัฐประชาชนจีน (สปจ.)', NULL, NULL, NULL, NULL),
(29, '29', 'ยย.ทบ. จ้างเหมางานก่อสร้างเรือนรับรองทำเนียบรัฐบาล', 'จ้าง', '๕๙ - ๖๐', 'พิเศษ', 136987000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'กิจการร่วมค้า วิทย์การช่าง  -ไซเลนเทค ', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(30, '30', 'สส. จัดหาเครื่องมือตรวจระบบเรดาร์ จำนวน 3 ชุด ', 'ซื้อ', '59', 'พิเศษ', 180000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'หจก.ไซแอนติ รีเสริช์', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(31, '31', 'สส.  จัดหาระบบสื่อสารดาวเทียมแบบยุทธวิธีสนับสนุนหน่วยระดับกองพล จำนวน 3 ระบบ', 'ซื้อ', '59', 'พิเศษ', 105000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ล๊อกซเลย์ ไวร์เลส จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(32, '32', 'สพ.ทบ. จัดหาปืนเล็กกล ขนาด 5.56 มม. แบบที่ 1 จำนวน 1,948 กระบอก', 'ซื้อ', '๕๙ - ๖๑', 'พิเศษ', 609466864.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ISRAEL WEAPON INDUSTRIES (IWI) LTD ', NULL, NULL, 'รัฐอิสราเอล', NULL, NULL, NULL, NULL),
(33, '33', 'สพ.ทบ. จ้างซ่อมปืนใหญ่กลางกระสุนวิถีโค้ง 37 ขนาด 155 มม. M109 A5 อัตตาจร จำนวน ๑๐ หน่วยยิง จ้างซ่อมรถสายพานบรรทุกกระสุน M992 A1 จำนวน 10 คัน', 'จ้าง', '59', 'พิเศษ', 460000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ฟิโก้ เทคโนโลยี เอ็นจีเนียริ่ง จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(34, '34', 'สพ.ทบ. จัดหารถยนต์บรรทุก ขนาด 2 1/2 ตัน จำนวน 404 คัน', 'ซื้อ', '๕๙ - ๖๑', 'พิเศษ', 1458945000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท อิทธิพร อิมปอร์ จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(35, '35', '(สพ.ทบ.) ซื้อปืนกล 38 ขนาด 7.62 มม.จำนวน 1,359 กระบอก', 'ซื้อ', '๕๙ - ๖๑', 'พิเศษ', 1087200000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท รอยัล ดีเฟนส์ จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(36, '36', 'อร. จ้างซ่อมทำเครื่องใหญ่ ขวา - ซ้าย ตราอักษร MTU รุ่น 20V1163 TB83 ขั้น major OverHaul ร.ล.รัตนโกสินทร์', 'จ้าง', '59', 'พิเศษ', 72800000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ยูพีเอส เอ็นจิน เซอร์วิส เซ็นเตอร์ จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(37, '37', 'สยป.ทร. โครงการจัดหาเรือตรวจการณ์ชายฝั่ง จำนวน 5 ลำ', 'จ้าง', '๕๙ - ๖๑', 'พิเศษ', 705000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท มาร์ซัน จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(38, '39', 'ขออนุมัติจ้างเหมาบริการสนับสนุนเครื่องยนต์ และอุปกรณ์ Line Replacement Unit (LRUs) สำหรับ บ.ข.๒๐/ก', 'จ้าง', '59', 'พิเศษ', 1051810000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'องค์การรักษาความปลอดภัยด้านการส่งออกทางทหารสวีเดน (The Swedish Defence and Security Export Agency (Försvarsexportmynigheten : FXM))  ราชอาณาจักรสวีเดน', NULL, NULL, 'ราชอาณาจักรสวีเดน', NULL, NULL, NULL, NULL),
(39, '40', 'ขออนุมัติจ้างก่อสร้างอาคารรับรองบุคคลสำคัญที่ท่าอากาศยานทหาร 2 กองบิน 6', 'จ้าง', '58', 'พิเศษ', 96300000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท อิตาเลียนไทย ดีเวล๊อปเมนต์ จำกัด(มหาชน)', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(40, '41', 'ชย.ทอ. สร้างโรงเก็บ บ.ปฏิบัติการสงครามอิเล็กทรอนิกส์ ที่ บน.7', 'จ้าง', '59', 'พิเศษ', 140000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ทีมวิศว์ คอนสรัคชั่น จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(41, '42', 'ชย.ทอ. จ้างสร้างโรงตรวจซ่อม ฮ.พระราชพาหนะ พร้อมอุปกรณ์ และสิ่งอำนวยความสะดวก จำนวน 1 โรง', 'จ้าง', '๕๙ - ๖๐', 'พิเศษ', 96270000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ที.พี.เอส  วัสดุภัณฑ์ จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(42, '43', 'ชย.ทอ. งานติดตั้งระบบผลิตไฟฟ้าด้วยเซลล์แสงอาทิตย์ ขนาด ๑ เมกะวัตต์ ที่ บน.2', 'จ้าง', '59', 'พิเศษ', 61340000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'กิจการร่วมค้า สมาร์ทพาวเวอร์ เอ็นจีเนียริ่ง ไทยวิจิตรประภา', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(43, '44', 'ชย.ทอ. งานติดตั้งระบบผลิตไฟฟ้าด้วยเซลล์แสงอาทิตย์ ขนาด ๑ เมกะวัตต์ น้ำพอง ที่ ฝูง.237', 'จ้าง', '59', 'พิเศษ', 61380000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ไทยรีนิวเอเบิล จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(44, '1', 'โครงการดำรงขีดความสามารถและเพิ่มประสิทธิภาพโรงงานของ ศอว.ศอพท. ประจำปี 59', 'ซื้อ', '59', 'พิเศษ', 76638600.00, '', 'รมว.กห.อนุมัติแล้ว', '2015-12-29', 'บริษัท อินดี้ ซัพพลาย เอ็นจิเนียริ่ง จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(45, '2', 'พท.ศอพท.ขออนุมัติสร้างระบบผลิตไฟฟ้าและสูบน้ำด้วยพลังแสงอาทิตย์แบบเคลื่อนที่ ขนาดไม่น้อยกว่า 1,200 วัตต์ พร้อมติดตั้ง จำนวน 200 ระบบ (เงินจากกระทรวงพลังงาน)', 'จ้าง', '59', 'e -bidding', 239787000.00, '', 'รมว.กห.อนุมัติแล้ว', '2016-03-23', 'บริษัท โซลาร์ตรอน  จำกัด(มหาชน)', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(46, '3', '(ผท.ทหาร) ซื้อกล้องถ่ายภาพทางอากาศเชิงเลข พร้อมชุดอุปกรณ์ จำนวน ๑ ชุด (๑๑ รายการ)', 'ซื้อ', '59', 'e - bidding', 236577000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท โกลเบิล อินฟอร์เมชั่น จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(47, '4', 'ศรภ. จัดซื้อระบบรวบรวมข้อมูลข่าวกรองทางการสื่อสารแบบดิจิตอล', 'ซื้อ', '59', 'พิเศษ', 59000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท กันโน่ ซิสเต็มส์ อินทีเกรชั่น จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(48, '5', 'สยย.ทหาร โครงการก่อสร้างบ้านพักข้าราชการ บก.ทท. ระยะที่ 2 พื้นที่ทุ่งสีกัน 1 และ 4', 'จ้าง', '59', 'e - bidding', 163899000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'กิจการร่วมค้า เอนคอน - เสรี', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(49, '6', '(ขส.ทบ.) การจ้างเหมาส่งกำลังและซ่อมบำรุงชิ้นส่วนซ่อมสำหรับฟื้นฟู ฮ.ท.1 จำนวน 1 งาน', 'จ้าง', '59', 'พิเศษ', 271098601.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท โรยัลสกาย จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(50, '7', '(ยย.ทบ.) โครงการก่อสร้างอาคาร ม.พัน 31', 'จ้าง', '59', 'พิเศษ', 219665100.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท วิทย์การช่าง จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(51, '8', '(ขส.ทบ.) การจ้างเหมาส่งกำลังและซ่อมบำรุงชิ้นส่วนซ่อมสำหรับฟื้นฟู ฮ.ท.212 จำนวน 1 งาน', 'จ้าง', '59', 'พิเศษ', 298700805.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท โรยัลสกาย จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(52, '9', '(สส.)  จัดหาระบบเครื่องมือแผนที่อัตโนมัติ จำนวน 3 ระบบ', 'ซื้อ', '59', 'พิเศษ', 60000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท วสุรัตน์ แอนด์ แอสโซซิเอท จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(53, '10', '(สพ.ทบ.) จ้างซ่อมรถยนต์บรรทุก ขนาด 1 1/4 ตัน ยูนิมอก จำนวน 60 คัน', 'จ้าง', '59', 'พิเศษ', 60000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'กิจการร่วมค้าอิทธิพร', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(54, '11', '(สพ.ทบ.) จ้างซ่อมปรับปรุง รสพ. M113 A1 ให้เป็น รสพ. M113 A2 I จำนวน 6 คัน', 'จ้าง', '59', 'พิเศษ', 65994000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ชัยเสรีเม็ททอล แอนด์รับเบอร์ จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(55, '12', '(สพ.ทบ.) ขออนุมัติจ้างผลิต/ประกอบ รยบ.ขนาดเบา 4x4 แบบ 51B (ปรับปรุงใหม่) จำนวน 251 คัน ', 'จ้าง', '59', 'พิเศษ', 342866000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท เอส.เอส. ออโตโมทีฟอินดัสตรี จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(56, '13', 'สพ.ทบ. จ้างซ่อมปรับปรุงปืนใหญ่ต่อสู้อากาศยาน ขนาด 20 มม. วัลแคน อัตตาจรจำนวน 4 หน่วยยิง', 'จ้าง', '59', 'พิเศษ', 85952000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ISRAEL MILITARY INDUSTRIES LTD รัฐอิสราเอล', NULL, NULL, 'รัฐอิสราเอล', NULL, NULL, NULL, NULL),
(57, '14', 'สพ.ทบ. จัดหากระสุนปืนเล็กขนาด 5.56 มม. ธรรมดา จำนวน 18,008,150 นัด', 'ซื้อ', '59', 'พิเศษ', 180907002.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท POONGSAN ', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(58, '15', 'สพ.ทบ. จัดหากระสุนปืนเล็ก ขนาด 5.56 มม. ชนิดธรรมดา มีแกนเหล็ก จำนวน 22,000,000 นัด', 'ซื้อ', '59', 'พิเศษ', 235620000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท POONGSAN CORPORATION  สาธารณรัฐเกาหลี', NULL, NULL, 'สาธารณรัฐเกาหลี', NULL, NULL, NULL, NULL),
(59, '16', 'โครงการจัดหาระบบการติดต่อ สื่อสารทางยุทธวิธีจำนวน ๕ รายการ', 'ซื้อ', '59', 'พิเศษ', 89977786.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท จันทร์เกษม อินเตอร์เนทชั่นแนล จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(60, '17', 'ขส.ทบ. จัดหาอุปกรณ์ระบบตรวจจับแจ้งเตือนและป้องกันอาวุธนำวิถีต่อสู้อากาศยาน พร้อมการติดตั้ง, การฝึกอบรมการใช้งานและการซ่อมบำรุง ', 'ซื้อ', '59', 'พิเศษ', 196000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท Elbit Systems Eletro-option Elop LTD รัฐอิสราเอล ', NULL, NULL, 'รัฐอิสราเอล', NULL, NULL, NULL, NULL),
(61, '18', 'สพ.ทบ. จัดหากระสุนปืนใหญ่กลางวิถีโค้ง ขนาด 155 มม. ชนิดส่องแสงเพิ่มระยะกลาง (ILLUM-ER-BT) จำนวน 450 นัด', 'ซื้อ', '59', 'พิเศษ', 87750000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท รอยัล ดีเฟนส์ จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(62, '19', 'พธ.ทบ.  จ้างผลิตเสื้อยืดคอรูปตัววี (สีกากีแกมเขียว และสีพรางลายดิจิตอล) จำนวน 449,711 ตัว', 'จ้าง', '59', 'e - bidding', 104715441.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ไทยทูเวย์ แฟบริค จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(63, '20', 'สพ.ทบ. จัดหากระสุนปืนใหญ่เบาวิถีโค้ง ขนาด 105 มม. ชนิดควัน RP เพิ่มระยะกลาง (RED PHOSPHOROUS ER-BT) จำนวน 720 นัด', 'ซื้อ', '59', 'พิเศษ', 126000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท รอยัล ดีเฟนส์ จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(64, '21', 'พธ.ทบ. จ้างผลิตรองเท้าทรงสูงครึ่งน่อง จำนวน 142,785 คู่', 'จ้าง', '59', 'e - bidding', 157063500.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท เอส แอนด์ อาร์ ฟุตแวร์ จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(65, '22', 'สพ.ทบ. จัดหากระสุนปืนใหญ่กลางวิถีโค้ง ขนาด 155 มม. ชนิดระเบิดแรงสูง (Super High Explosive) จำนวน 750 นัด', 'ซื้อ', '59', 'พิเศษ', 137700000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ISRAEL MILITARY INDUSTRIES LTD (I.M.I)', NULL, NULL, 'รัฐอิสราเอล', NULL, NULL, NULL, NULL),
(66, '23', 'สพ.ทบ. จัดหาลูกระเบิดยิงจากเครื่องยิงลูกระเบิด ขนาด60 มม. ชนิดส่องแสง แบบที่ 1 จำนวน 1,970 นัด', 'จ้าง', '59', 'พิเศษ', 79475789.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ISRAEL MILITARY INDUSTRIES LTD (I.M.I)', NULL, NULL, 'รัฐอิสราเอล', NULL, NULL, NULL, NULL),
(67, '24', 'สส.  โครงการจัดหาชุดวิทยุทดแทน AN/PRC-624 (ระยะที่ 1 ห้วงที่3) จัดหาชุดวิทยุVHF/FM ทางทหารระดับหมู่-มว. ชนิดมือถือ จำนวน 1,307 ชุด', 'ซื้อ', '๕๙ - ๖๑', 'พิเศษ', 420000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท Elbit System Land  And C41 Ltd.รัฐอิสราเอล', NULL, NULL, 'รัฐอิสราเอล', NULL, NULL, NULL, NULL),
(68, '25', 'สส.  โครงการจัดหาเครื่องมือสื่อสาร (หน่วย ส.) จำนวน ๖ รายการ ได้แก่', 'ซื้อ', '59', 'พิเศษ', 119907002.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท Elbit System Land  And C41 Ltd.รัฐอิสราเอล', NULL, NULL, 'รัฐอิสราเอล', NULL, NULL, NULL, NULL),
(69, '26', 'สส.  โครงการจัดหาเครื่องมือด้านการข่าวตาม อจย.ขกท.', 'ซื้อ', '59', 'พิเศษ', 80000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท เพลสซิ่ง แวลู จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(70, '27', 'สพ.ทบ. จัดหาระบบเครื่องควบคุมการยิง รถถัง เอ็ม 60 เอ 3 จำนวน 15 ระบบ', 'ซื้อ', '๕๙ - ๖๑', 'พิเศษ', 648455310.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท Elbit System Land  And C41 Ltd.รัฐอิสราเอล', NULL, NULL, 'รัฐอิสราเอล', NULL, NULL, NULL, NULL),
(71, '28', 'สพ.ทบ. โครงการจัดหา ถ. ทดแทน (ถ.เอ็ม 41) ระยะที่ 2 รถถังหลัก (Main Battle Tank VT4)  จำนวน ๒๘ คัน', 'ซื้อ', '๕๙ - ๖๑', 'G TO G', 4985391600.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'รัฐบาลสาธารณรัฐประชาชนจีน (สปจ.)', NULL, NULL, 'สาธารณรัฐประชาชนจีน (สปจ.)', NULL, NULL, NULL, NULL),
(72, '29', 'ยย.ทบ. จ้างเหมางานก่อสร้างเรือนรับรองทำเนียบรัฐบาล', 'จ้าง', '๕๙ - ๖๐', 'พิเศษ', 136987000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'กิจการร่วมค้า วิทย์การช่าง  -ไซเลนเทค ', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(73, '30', 'สส. จัดหาเครื่องมือตรวจระบบเรดาร์ จำนวน 3 ชุด ', 'ซื้อ', '59', 'พิเศษ', 180000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'หจก.ไซแอนติ รีเสริช์', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(74, '31', 'สส.  จัดหาระบบสื่อสารดาวเทียมแบบยุทธวิธีสนับสนุนหน่วยระดับกองพล จำนวน 3 ระบบ', 'ซื้อ', '59', 'พิเศษ', 105000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ล๊อกซเลย์ ไวร์เลส จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(75, '32', 'สพ.ทบ. จัดหาปืนเล็กกล ขนาด 5.56 มม. แบบที่ 1 จำนวน 1,948 กระบอก', 'ซื้อ', '๕๙ - ๖๑', 'พิเศษ', 609466864.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ISRAEL WEAPON INDUSTRIES (IWI) LTD ', NULL, NULL, 'รัฐอิสราเอล', NULL, NULL, NULL, NULL),
(76, '33', 'สพ.ทบ. จ้างซ่อมปืนใหญ่กลางกระสุนวิถีโค้ง 37 ขนาด 155 มม. M109 A5 อัตตาจร จำนวน ๑๐ หน่วยยิง จ้างซ่อมรถสายพานบรรทุกกระสุน M992 A1 จำนวน 10 คัน', 'จ้าง', '59', 'พิเศษ', 460000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ฟิโก้ เทคโนโลยี เอ็นจีเนียริ่ง จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(77, '34', 'สพ.ทบ. จัดหารถยนต์บรรทุก ขนาด 2 1/2 ตัน จำนวน 404 คัน', 'ซื้อ', '๕๙ - ๖๑', 'พิเศษ', 1458945000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท อิทธิพร อิมปอร์ จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(78, '35', '(สพ.ทบ.) ซื้อปืนกล 38 ขนาด 7.62 มม.จำนวน 1,359 กระบอก', 'ซื้อ', '๕๙ - ๖๑', 'พิเศษ', 1087200000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท รอยัล ดีเฟนส์ จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(79, '36', 'อร. จ้างซ่อมทำเครื่องใหญ่ ขวา - ซ้าย ตราอักษร MTU รุ่น 20V1163 TB83 ขั้น major OverHaul ร.ล.รัตนโกสินทร์', 'จ้าง', '59', 'พิเศษ', 72800000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ยูพีเอส เอ็นจิน เซอร์วิส เซ็นเตอร์ จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(80, '37', 'สยป.ทร. โครงการจัดหาเรือตรวจการณ์ชายฝั่ง จำนวน 5 ลำ', 'จ้าง', '๕๙ - ๖๑', 'พิเศษ', 705000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท มาร์ซัน จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(81, '39', 'ขออนุมัติจ้างเหมาบริการสนับสนุนเครื่องยนต์ และอุปกรณ์ Line Replacement Unit (LRUs) สำหรับ บ.ข.๒๐/ก', 'จ้าง', '59', 'พิเศษ', 1051810000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'องค์การรักษาความปลอดภัยด้านการส่งออกทางทหารสวีเดน (The Swedish Defence and Security Export Agency (Försvarsexportmynigheten : FXM))  ราชอาณาจักรสวีเดน', NULL, NULL, 'ราชอาณาจักรสวีเดน', NULL, NULL, NULL, NULL),
(82, '40', 'ขออนุมัติจ้างก่อสร้างอาคารรับรองบุคคลสำคัญที่ท่าอากาศยานทหาร 2 กองบิน 6', 'จ้าง', '58', 'พิเศษ', 96300000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท อิตาเลียนไทย ดีเวล๊อปเมนต์ จำกัด(มหาชน)', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(83, '41', 'ชย.ทอ. สร้างโรงเก็บ บ.ปฏิบัติการสงครามอิเล็กทรอนิกส์ ที่ บน.7', 'จ้าง', '59', 'พิเศษ', 140000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ทีมวิศว์ คอนสรัคชั่น จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(84, '42', 'ชย.ทอ. จ้างสร้างโรงตรวจซ่อม ฮ.พระราชพาหนะ พร้อมอุปกรณ์ และสิ่งอำนวยความสะดวก จำนวน 1 โรง', 'จ้าง', '๕๙ - ๖๐', 'พิเศษ', 96270000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ที.พี.เอส  วัสดุภัณฑ์ จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(85, '43', 'ชย.ทอ. งานติดตั้งระบบผลิตไฟฟ้าด้วยเซลล์แสงอาทิตย์ ขนาด ๑ เมกะวัตต์ ที่ บน.2', 'จ้าง', '59', 'พิเศษ', 61340000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'กิจการร่วมค้า สมาร์ทพาวเวอร์ เอ็นจีเนียริ่ง ไทยวิจิตรประภา', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(86, '44', 'ชย.ทอ. งานติดตั้งระบบผลิตไฟฟ้าด้วยเซลล์แสงอาทิตย์ ขนาด ๑ เมกะวัตต์ น้ำพอง ที่ ฝูง.237', 'จ้าง', '59', 'พิเศษ', 61380000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ไทยรีนิวเอเบิล จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(87, '1', 'โครงการดำรงขีดความสามารถและเพิ่มประสิทธิภาพโรงงานของ ศอว.ศอพท. ประจำปี 59', 'ซื้อ', '59', 'พิเศษ', 76638600.00, '', 'รมว.กห.อนุมัติแล้ว', '2015-12-29', 'บริษัท อินดี้ ซัพพลาย เอ็นจิเนียริ่ง จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(88, '2', 'พท.ศอพท.ขออนุมัติสร้างระบบผลิตไฟฟ้าและสูบน้ำด้วยพลังแสงอาทิตย์แบบเคลื่อนที่ ขนาดไม่น้อยกว่า 1,200 วัตต์ พร้อมติดตั้ง จำนวน 200 ระบบ (เงินจากกระทรวงพลังงาน)', 'จ้าง', '59', 'e -bidding', 239787000.00, '', 'รมว.กห.อนุมัติแล้ว', '2016-03-23', 'บริษัท โซลาร์ตรอน  จำกัด(มหาชน)', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(89, '3', '(ผท.ทหาร) ซื้อกล้องถ่ายภาพทางอากาศเชิงเลข พร้อมชุดอุปกรณ์ จำนวน ๑ ชุด (๑๑ รายการ)', 'ซื้อ', '59', 'e - bidding', 236577000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท โกลเบิล อินฟอร์เมชั่น จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(90, '4', 'ศรภ. จัดซื้อระบบรวบรวมข้อมูลข่าวกรองทางการสื่อสารแบบดิจิตอล', 'ซื้อ', '59', 'พิเศษ', 59000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท กันโน่ ซิสเต็มส์ อินทีเกรชั่น จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(91, '5', 'สยย.ทหาร โครงการก่อสร้างบ้านพักข้าราชการ บก.ทท. ระยะที่ 2 พื้นที่ทุ่งสีกัน 1 และ 4', 'จ้าง', '59', 'e - bidding', 163899000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'กิจการร่วมค้า เอนคอน - เสรี', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(92, '6', '(ขส.ทบ.) การจ้างเหมาส่งกำลังและซ่อมบำรุงชิ้นส่วนซ่อมสำหรับฟื้นฟู ฮ.ท.1 จำนวน 1 งาน', 'จ้าง', '59', 'พิเศษ', 271098601.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท โรยัลสกาย จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(93, '7', '(ยย.ทบ.) โครงการก่อสร้างอาคาร ม.พัน 31', 'จ้าง', '59', 'พิเศษ', 219665100.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท วิทย์การช่าง จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(94, '8', '(ขส.ทบ.) การจ้างเหมาส่งกำลังและซ่อมบำรุงชิ้นส่วนซ่อมสำหรับฟื้นฟู ฮ.ท.212 จำนวน 1 งาน', 'จ้าง', '59', 'พิเศษ', 298700805.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท โรยัลสกาย จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(95, '9', '(สส.)  จัดหาระบบเครื่องมือแผนที่อัตโนมัติ จำนวน 3 ระบบ', 'ซื้อ', '59', 'พิเศษ', 60000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท วสุรัตน์ แอนด์ แอสโซซิเอท จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(96, '10', '(สพ.ทบ.) จ้างซ่อมรถยนต์บรรทุก ขนาด 1 1/4 ตัน ยูนิมอก จำนวน 60 คัน', 'จ้าง', '59', 'พิเศษ', 60000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'กิจการร่วมค้าอิทธิพร', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(97, '11', '(สพ.ทบ.) จ้างซ่อมปรับปรุง รสพ. M113 A1 ให้เป็น รสพ. M113 A2 I จำนวน 6 คัน', 'จ้าง', '59', 'พิเศษ', 65994000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ชัยเสรีเม็ททอล แอนด์รับเบอร์ จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(98, '12', '(สพ.ทบ.) ขออนุมัติจ้างผลิต/ประกอบ รยบ.ขนาดเบา 4x4 แบบ 51B (ปรับปรุงใหม่) จำนวน 251 คัน ', 'จ้าง', '59', 'พิเศษ', 342866000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท เอส.เอส. ออโตโมทีฟอินดัสตรี จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(99, '13', 'สพ.ทบ. จ้างซ่อมปรับปรุงปืนใหญ่ต่อสู้อากาศยาน ขนาด 20 มม. วัลแคน อัตตาจรจำนวน 4 หน่วยยิง', 'จ้าง', '59', 'พิเศษ', 85952000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ISRAEL MILITARY INDUSTRIES LTD รัฐอิสราเอล', NULL, NULL, 'รัฐอิสราเอล', NULL, NULL, NULL, NULL),
(100, '14', 'สพ.ทบ. จัดหากระสุนปืนเล็กขนาด 5.56 มม. ธรรมดา จำนวน 18,008,150 นัด', 'ซื้อ', '59', 'พิเศษ', 180907002.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท POONGSAN ', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(101, '15', 'สพ.ทบ. จัดหากระสุนปืนเล็ก ขนาด 5.56 มม. ชนิดธรรมดา มีแกนเหล็ก จำนวน 22,000,000 นัด', 'ซื้อ', '59', 'พิเศษ', 235620000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท POONGSAN CORPORATION  สาธารณรัฐเกาหลี', NULL, NULL, 'สาธารณรัฐเกาหลี', NULL, NULL, NULL, NULL),
(102, '16', 'โครงการจัดหาระบบการติดต่อ สื่อสารทางยุทธวิธีจำนวน ๕ รายการ', 'ซื้อ', '59', 'พิเศษ', 89977786.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท จันทร์เกษม อินเตอร์เนทชั่นแนล จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(103, '17', 'ขส.ทบ. จัดหาอุปกรณ์ระบบตรวจจับแจ้งเตือนและป้องกันอาวุธนำวิถีต่อสู้อากาศยาน พร้อมการติดตั้ง, การฝึกอบรมการใช้งานและการซ่อมบำรุง ', 'ซื้อ', '59', 'พิเศษ', 196000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท Elbit Systems Eletro-option Elop LTD รัฐอิสราเอล ', NULL, NULL, 'รัฐอิสราเอล', NULL, NULL, NULL, NULL),
(104, '18', 'สพ.ทบ. จัดหากระสุนปืนใหญ่กลางวิถีโค้ง ขนาด 155 มม. ชนิดส่องแสงเพิ่มระยะกลาง (ILLUM-ER-BT) จำนวน 450 นัด', 'ซื้อ', '59', 'พิเศษ', 87750000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท รอยัล ดีเฟนส์ จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(105, '19', 'พธ.ทบ.  จ้างผลิตเสื้อยืดคอรูปตัววี (สีกากีแกมเขียว และสีพรางลายดิจิตอล) จำนวน 449,711 ตัว', 'จ้าง', '59', 'e - bidding', 104715441.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ไทยทูเวย์ แฟบริค จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(106, '20', 'สพ.ทบ. จัดหากระสุนปืนใหญ่เบาวิถีโค้ง ขนาด 105 มม. ชนิดควัน RP เพิ่มระยะกลาง (RED PHOSPHOROUS ER-BT) จำนวน 720 นัด', 'ซื้อ', '59', 'พิเศษ', 126000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท รอยัล ดีเฟนส์ จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(107, '21', 'พธ.ทบ. จ้างผลิตรองเท้าทรงสูงครึ่งน่อง จำนวน 142,785 คู่', 'จ้าง', '59', 'e - bidding', 157063500.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท เอส แอนด์ อาร์ ฟุตแวร์ จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(108, '22', 'สพ.ทบ. จัดหากระสุนปืนใหญ่กลางวิถีโค้ง ขนาด 155 มม. ชนิดระเบิดแรงสูง (Super High Explosive) จำนวน 750 นัด', 'ซื้อ', '59', 'พิเศษ', 137700000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ISRAEL MILITARY INDUSTRIES LTD (I.M.I)', NULL, NULL, 'รัฐอิสราเอล', NULL, NULL, NULL, NULL),
(109, '23', 'สพ.ทบ. จัดหาลูกระเบิดยิงจากเครื่องยิงลูกระเบิด ขนาด60 มม. ชนิดส่องแสง แบบที่ 1 จำนวน 1,970 นัด', 'จ้าง', '59', 'พิเศษ', 79475789.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ISRAEL MILITARY INDUSTRIES LTD (I.M.I)', NULL, NULL, 'รัฐอิสราเอล', NULL, NULL, NULL, NULL),
(110, '24', 'สส.  โครงการจัดหาชุดวิทยุทดแทน AN/PRC-624 (ระยะที่ 1 ห้วงที่3) จัดหาชุดวิทยุVHF/FM ทางทหารระดับหมู่-มว. ชนิดมือถือ จำนวน 1,307 ชุด', 'ซื้อ', '๕๙ - ๖๑', 'พิเศษ', 420000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท Elbit System Land  And C41 Ltd.รัฐอิสราเอล', NULL, NULL, 'รัฐอิสราเอล', NULL, NULL, NULL, NULL),
(111, '25', 'สส.  โครงการจัดหาเครื่องมือสื่อสาร (หน่วย ส.) จำนวน ๖ รายการ ได้แก่', 'ซื้อ', '59', 'พิเศษ', 119907002.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท Elbit System Land  And C41 Ltd.รัฐอิสราเอล', NULL, NULL, 'รัฐอิสราเอล', NULL, NULL, NULL, NULL),
(112, '26', 'สส.  โครงการจัดหาเครื่องมือด้านการข่าวตาม อจย.ขกท.', 'ซื้อ', '59', 'พิเศษ', 80000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท เพลสซิ่ง แวลู จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(113, '27', 'สพ.ทบ. จัดหาระบบเครื่องควบคุมการยิง รถถัง เอ็ม 60 เอ 3 จำนวน 15 ระบบ', 'ซื้อ', '๕๙ - ๖๑', 'พิเศษ', 648455310.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท Elbit System Land  And C41 Ltd.รัฐอิสราเอล', NULL, NULL, 'รัฐอิสราเอล', NULL, NULL, NULL, NULL),
(114, '28', 'สพ.ทบ. โครงการจัดหา ถ. ทดแทน (ถ.เอ็ม 41) ระยะที่ 2 รถถังหลัก (Main Battle Tank VT4)  จำนวน ๒๘ คัน', 'ซื้อ', '๕๙ - ๖๑', 'G TO G', 4985391600.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'รัฐบาลสาธารณรัฐประชาชนจีน (สปจ.)', NULL, NULL, 'สาธารณรัฐประชาชนจีน (สปจ.)', NULL, NULL, NULL, NULL),
(115, '29', 'ยย.ทบ. จ้างเหมางานก่อสร้างเรือนรับรองทำเนียบรัฐบาล', 'จ้าง', '๕๙ - ๖๐', 'พิเศษ', 136987000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'กิจการร่วมค้า วิทย์การช่าง  -ไซเลนเทค ', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(116, '30', 'สส. จัดหาเครื่องมือตรวจระบบเรดาร์ จำนวน 3 ชุด ', 'ซื้อ', '59', 'พิเศษ', 180000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'หจก.ไซแอนติ รีเสริช์', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(117, '31', 'สส.  จัดหาระบบสื่อสารดาวเทียมแบบยุทธวิธีสนับสนุนหน่วยระดับกองพล จำนวน 3 ระบบ', 'ซื้อ', '59', 'พิเศษ', 105000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ล๊อกซเลย์ ไวร์เลส จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(118, '32', 'สพ.ทบ. จัดหาปืนเล็กกล ขนาด 5.56 มม. แบบที่ 1 จำนวน 1,948 กระบอก', 'ซื้อ', '๕๙ - ๖๑', 'พิเศษ', 609466864.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ISRAEL WEAPON INDUSTRIES (IWI) LTD ', NULL, NULL, 'รัฐอิสราเอล', NULL, NULL, NULL, NULL),
(119, '33', 'สพ.ทบ. จ้างซ่อมปืนใหญ่กลางกระสุนวิถีโค้ง 37 ขนาด 155 มม. M109 A5 อัตตาจร จำนวน ๑๐ หน่วยยิง จ้างซ่อมรถสายพานบรรทุกกระสุน M992 A1 จำนวน 10 คัน', 'จ้าง', '59', 'พิเศษ', 460000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ฟิโก้ เทคโนโลยี เอ็นจีเนียริ่ง จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(120, '34', 'สพ.ทบ. จัดหารถยนต์บรรทุก ขนาด 2 1/2 ตัน จำนวน 404 คัน', 'ซื้อ', '๕๙ - ๖๑', 'พิเศษ', 1458945000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท อิทธิพร อิมปอร์ จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(121, '35', '(สพ.ทบ.) ซื้อปืนกล 38 ขนาด 7.62 มม.จำนวน 1,359 กระบอก', 'ซื้อ', '๕๙ - ๖๑', 'พิเศษ', 1087200000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท รอยัล ดีเฟนส์ จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(122, '36', 'อร. จ้างซ่อมทำเครื่องใหญ่ ขวา - ซ้าย ตราอักษร MTU รุ่น 20V1163 TB83 ขั้น major OverHaul ร.ล.รัตนโกสินทร์', 'จ้าง', '59', 'พิเศษ', 72800000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ยูพีเอส เอ็นจิน เซอร์วิส เซ็นเตอร์ จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(123, '37', 'สยป.ทร. โครงการจัดหาเรือตรวจการณ์ชายฝั่ง จำนวน 5 ลำ', 'จ้าง', '๕๙ - ๖๑', 'พิเศษ', 705000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท มาร์ซัน จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(124, '39', 'ขออนุมัติจ้างเหมาบริการสนับสนุนเครื่องยนต์ และอุปกรณ์ Line Replacement Unit (LRUs) สำหรับ บ.ข.๒๐/ก', 'จ้าง', '59', 'พิเศษ', 1051810000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'องค์การรักษาความปลอดภัยด้านการส่งออกทางทหารสวีเดน (The Swedish Defence and Security Export Agency (Försvarsexportmynigheten : FXM))  ราชอาณาจักรสวีเดน', NULL, NULL, 'ราชอาณาจักรสวีเดน', NULL, NULL, NULL, NULL),
(125, '40', 'ขออนุมัติจ้างก่อสร้างอาคารรับรองบุคคลสำคัญที่ท่าอากาศยานทหาร 2 กองบิน 6', 'จ้าง', '58', 'พิเศษ', 96300000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท อิตาเลียนไทย ดีเวล๊อปเมนต์ จำกัด(มหาชน)', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(126, '41', 'ชย.ทอ. สร้างโรงเก็บ บ.ปฏิบัติการสงครามอิเล็กทรอนิกส์ ที่ บน.7', 'จ้าง', '59', 'พิเศษ', 140000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ทีมวิศว์ คอนสรัคชั่น จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(127, '42', 'ชย.ทอ. จ้างสร้างโรงตรวจซ่อม ฮ.พระราชพาหนะ พร้อมอุปกรณ์ และสิ่งอำนวยความสะดวก จำนวน 1 โรง', 'จ้าง', '๕๙ - ๖๐', 'พิเศษ', 96270000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ที.พี.เอส  วัสดุภัณฑ์ จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(128, '43', 'ชย.ทอ. งานติดตั้งระบบผลิตไฟฟ้าด้วยเซลล์แสงอาทิตย์ ขนาด ๑ เมกะวัตต์ ที่ บน.2', 'จ้าง', '59', 'พิเศษ', 61340000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'กิจการร่วมค้า สมาร์ทพาวเวอร์ เอ็นจีเนียริ่ง ไทยวิจิตรประภา', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(129, '44', 'ชย.ทอ. งานติดตั้งระบบผลิตไฟฟ้าด้วยเซลล์แสงอาทิตย์ ขนาด ๑ เมกะวัตต์ น้ำพอง ที่ ฝูง.237', 'จ้าง', '59', 'พิเศษ', 61380000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ไทยรีนิวเอเบิล จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(130, '1', 'โครงการดำรงขีดความสามารถและเพิ่มประสิทธิภาพโรงงานของ ศอว.ศอพท. ประจำปี 59', 'ซื้อ', '59', 'พิเศษ', 76638600.00, '', 'รมว.กห.อนุมัติแล้ว', '2015-12-29', 'บริษัท อินดี้ ซัพพลาย เอ็นจิเนียริ่ง จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(131, '2', 'พท.ศอพท.ขออนุมัติสร้างระบบผลิตไฟฟ้าและสูบน้ำด้วยพลังแสงอาทิตย์แบบเคลื่อนที่ ขนาดไม่น้อยกว่า 1,200 วัตต์ พร้อมติดตั้ง จำนวน 200 ระบบ (เงินจากกระทรวงพลังงาน)', 'จ้าง', '59', 'e -bidding', 239787000.00, '', 'รมว.กห.อนุมัติแล้ว', '2016-03-23', 'บริษัท โซลาร์ตรอน  จำกัด(มหาชน)', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(132, '3', '(ผท.ทหาร) ซื้อกล้องถ่ายภาพทางอากาศเชิงเลข พร้อมชุดอุปกรณ์ จำนวน ๑ ชุด (๑๑ รายการ)', 'ซื้อ', '59', 'e - bidding', 236577000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท โกลเบิล อินฟอร์เมชั่น จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(133, '4', 'ศรภ. จัดซื้อระบบรวบรวมข้อมูลข่าวกรองทางการสื่อสารแบบดิจิตอล', 'ซื้อ', '59', 'พิเศษ', 59000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท กันโน่ ซิสเต็มส์ อินทีเกรชั่น จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(134, '5', 'สยย.ทหาร โครงการก่อสร้างบ้านพักข้าราชการ บก.ทท. ระยะที่ 2 พื้นที่ทุ่งสีกัน 1 และ 4', 'จ้าง', '59', 'e - bidding', 163899000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'กิจการร่วมค้า เอนคอน - เสรี', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(135, '6', '(ขส.ทบ.) การจ้างเหมาส่งกำลังและซ่อมบำรุงชิ้นส่วนซ่อมสำหรับฟื้นฟู ฮ.ท.1 จำนวน 1 งาน', 'จ้าง', '59', 'พิเศษ', 271098601.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท โรยัลสกาย จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(136, '7', '(ยย.ทบ.) โครงการก่อสร้างอาคาร ม.พัน 31', 'จ้าง', '59', 'พิเศษ', 219665100.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท วิทย์การช่าง จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(137, '8', '(ขส.ทบ.) การจ้างเหมาส่งกำลังและซ่อมบำรุงชิ้นส่วนซ่อมสำหรับฟื้นฟู ฮ.ท.212 จำนวน 1 งาน', 'จ้าง', '59', 'พิเศษ', 298700805.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท โรยัลสกาย จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(138, '9', '(สส.)  จัดหาระบบเครื่องมือแผนที่อัตโนมัติ จำนวน 3 ระบบ', 'ซื้อ', '59', 'พิเศษ', 60000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท วสุรัตน์ แอนด์ แอสโซซิเอท จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(139, '10', '(สพ.ทบ.) จ้างซ่อมรถยนต์บรรทุก ขนาด 1 1/4 ตัน ยูนิมอก จำนวน 60 คัน', 'จ้าง', '59', 'พิเศษ', 60000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'กิจการร่วมค้าอิทธิพร', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(140, '11', '(สพ.ทบ.) จ้างซ่อมปรับปรุง รสพ. M113 A1 ให้เป็น รสพ. M113 A2 I จำนวน 6 คัน', 'จ้าง', '59', 'พิเศษ', 65994000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ชัยเสรีเม็ททอล แอนด์รับเบอร์ จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(141, '12', '(สพ.ทบ.) ขออนุมัติจ้างผลิต/ประกอบ รยบ.ขนาดเบา 4x4 แบบ 51B (ปรับปรุงใหม่) จำนวน 251 คัน ', 'จ้าง', '59', 'พิเศษ', 342866000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท เอส.เอส. ออโตโมทีฟอินดัสตรี จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(142, '13', 'สพ.ทบ. จ้างซ่อมปรับปรุงปืนใหญ่ต่อสู้อากาศยาน ขนาด 20 มม. วัลแคน อัตตาจรจำนวน 4 หน่วยยิง', 'จ้าง', '59', 'พิเศษ', 85952000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ISRAEL MILITARY INDUSTRIES LTD รัฐอิสราเอล', NULL, NULL, 'รัฐอิสราเอล', NULL, NULL, NULL, NULL),
(143, '14', 'สพ.ทบ. จัดหากระสุนปืนเล็กขนาด 5.56 มม. ธรรมดา จำนวน 18,008,150 นัด', 'ซื้อ', '59', 'พิเศษ', 180907002.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท POONGSAN ', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(144, '15', 'สพ.ทบ. จัดหากระสุนปืนเล็ก ขนาด 5.56 มม. ชนิดธรรมดา มีแกนเหล็ก จำนวน 22,000,000 นัด', 'ซื้อ', '59', 'พิเศษ', 235620000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท POONGSAN CORPORATION  สาธารณรัฐเกาหลี', NULL, NULL, 'สาธารณรัฐเกาหลี', NULL, NULL, NULL, NULL),
(145, '16', 'โครงการจัดหาระบบการติดต่อ สื่อสารทางยุทธวิธีจำนวน ๕ รายการ', 'ซื้อ', '59', 'พิเศษ', 89977786.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท จันทร์เกษม อินเตอร์เนทชั่นแนล จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(146, '17', 'ขส.ทบ. จัดหาอุปกรณ์ระบบตรวจจับแจ้งเตือนและป้องกันอาวุธนำวิถีต่อสู้อากาศยาน พร้อมการติดตั้ง, การฝึกอบรมการใช้งานและการซ่อมบำรุง ', 'ซื้อ', '59', 'พิเศษ', 196000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท Elbit Systems Eletro-option Elop LTD รัฐอิสราเอล ', NULL, NULL, 'รัฐอิสราเอล', NULL, NULL, NULL, NULL),
(147, '18', 'สพ.ทบ. จัดหากระสุนปืนใหญ่กลางวิถีโค้ง ขนาด 155 มม. ชนิดส่องแสงเพิ่มระยะกลาง (ILLUM-ER-BT) จำนวน 450 นัด', 'ซื้อ', '59', 'พิเศษ', 87750000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท รอยัล ดีเฟนส์ จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(148, '19', 'พธ.ทบ.  จ้างผลิตเสื้อยืดคอรูปตัววี (สีกากีแกมเขียว และสีพรางลายดิจิตอล) จำนวน 449,711 ตัว', 'จ้าง', '59', 'e - bidding', 104715441.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ไทยทูเวย์ แฟบริค จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(149, '20', 'สพ.ทบ. จัดหากระสุนปืนใหญ่เบาวิถีโค้ง ขนาด 105 มม. ชนิดควัน RP เพิ่มระยะกลาง (RED PHOSPHOROUS ER-BT) จำนวน 720 นัด', 'ซื้อ', '59', 'พิเศษ', 126000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท รอยัล ดีเฟนส์ จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(150, '21', 'พธ.ทบ. จ้างผลิตรองเท้าทรงสูงครึ่งน่อง จำนวน 142,785 คู่', 'จ้าง', '59', 'e - bidding', 157063500.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท เอส แอนด์ อาร์ ฟุตแวร์ จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(151, '1', 'โครงการดำรงขีดความสามารถและเพิ่มประสิทธิภาพโรงงานของ ศอว.ศอพท. ประจำปี 59', 'ซื้อ', '59', 'พิเศษ', 76638600.00, '', 'รมว.กห.อนุมัติแล้ว', '2015-12-29', 'บริษัท อินดี้ ซัพพลาย เอ็นจิเนียริ่ง จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(152, '22', 'สพ.ทบ. จัดหากระสุนปืนใหญ่กลางวิถีโค้ง ขนาด 155 มม. ชนิดระเบิดแรงสูง (Super High Explosive) จำนวน 750 นัด', 'ซื้อ', '59', 'พิเศษ', 137700000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ISRAEL MILITARY INDUSTRIES LTD (I.M.I)', NULL, NULL, 'รัฐอิสราเอล', NULL, NULL, NULL, NULL),
(153, '2', 'พท.ศอพท.ขออนุมัติสร้างระบบผลิตไฟฟ้าและสูบน้ำด้วยพลังแสงอาทิตย์แบบเคลื่อนที่ ขนาดไม่น้อยกว่า 1,200 วัตต์ พร้อมติดตั้ง จำนวน 200 ระบบ (เงินจากกระทรวงพลังงาน)', 'จ้าง', '59', 'e -bidding', 239787000.00, '', 'รมว.กห.อนุมัติแล้ว', '2016-03-23', 'บริษัท โซลาร์ตรอน  จำกัด(มหาชน)', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(154, '23', 'สพ.ทบ. จัดหาลูกระเบิดยิงจากเครื่องยิงลูกระเบิด ขนาด60 มม. ชนิดส่องแสง แบบที่ 1 จำนวน 1,970 นัด', 'จ้าง', '59', 'พิเศษ', 79475789.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ISRAEL MILITARY INDUSTRIES LTD (I.M.I)', NULL, NULL, 'รัฐอิสราเอล', NULL, NULL, NULL, NULL),
(155, '3', '(ผท.ทหาร) ซื้อกล้องถ่ายภาพทางอากาศเชิงเลข พร้อมชุดอุปกรณ์ จำนวน ๑ ชุด (๑๑ รายการ)', 'ซื้อ', '59', 'e - bidding', 236577000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท โกลเบิล อินฟอร์เมชั่น จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(156, '24', 'สส.  โครงการจัดหาชุดวิทยุทดแทน AN/PRC-624 (ระยะที่ 1 ห้วงที่3) จัดหาชุดวิทยุVHF/FM ทางทหารระดับหมู่-มว. ชนิดมือถือ จำนวน 1,307 ชุด', 'ซื้อ', '๕๙ - ๖๑', 'พิเศษ', 420000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท Elbit System Land  And C41 Ltd.รัฐอิสราเอล', NULL, NULL, 'รัฐอิสราเอล', NULL, NULL, NULL, NULL),
(157, '4', 'ศรภ. จัดซื้อระบบรวบรวมข้อมูลข่าวกรองทางการสื่อสารแบบดิจิตอล', 'ซื้อ', '59', 'พิเศษ', 59000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท กันโน่ ซิสเต็มส์ อินทีเกรชั่น จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(158, '25', 'สส.  โครงการจัดหาเครื่องมือสื่อสาร (หน่วย ส.) จำนวน ๖ รายการ ได้แก่', 'ซื้อ', '59', 'พิเศษ', 119907002.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท Elbit System Land  And C41 Ltd.รัฐอิสราเอล', NULL, NULL, 'รัฐอิสราเอล', NULL, NULL, NULL, NULL),
(159, '5', 'สยย.ทหาร โครงการก่อสร้างบ้านพักข้าราชการ บก.ทท. ระยะที่ 2 พื้นที่ทุ่งสีกัน 1 และ 4', 'จ้าง', '59', 'e - bidding', 163899000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'กิจการร่วมค้า เอนคอน - เสรี', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(160, '26', 'สส.  โครงการจัดหาเครื่องมือด้านการข่าวตาม อจย.ขกท.', 'ซื้อ', '59', 'พิเศษ', 80000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท เพลสซิ่ง แวลู จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(161, '6', '(ขส.ทบ.) การจ้างเหมาส่งกำลังและซ่อมบำรุงชิ้นส่วนซ่อมสำหรับฟื้นฟู ฮ.ท.1 จำนวน 1 งาน', 'จ้าง', '59', 'พิเศษ', 271098601.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท โรยัลสกาย จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(162, '27', 'สพ.ทบ. จัดหาระบบเครื่องควบคุมการยิง รถถัง เอ็ม 60 เอ 3 จำนวน 15 ระบบ', 'ซื้อ', '๕๙ - ๖๑', 'พิเศษ', 648455310.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท Elbit System Land  And C41 Ltd.รัฐอิสราเอล', NULL, NULL, 'รัฐอิสราเอล', NULL, NULL, NULL, NULL),
(163, '7', '(ยย.ทบ.) โครงการก่อสร้างอาคาร ม.พัน 31', 'จ้าง', '59', 'พิเศษ', 219665100.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท วิทย์การช่าง จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(164, '28', 'สพ.ทบ. โครงการจัดหา ถ. ทดแทน (ถ.เอ็ม 41) ระยะที่ 2 รถถังหลัก (Main Battle Tank VT4)  จำนวน ๒๘ คัน', 'ซื้อ', '๕๙ - ๖๑', 'G TO G', 4985391600.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'รัฐบาลสาธารณรัฐประชาชนจีน (สปจ.)', NULL, NULL, 'สาธารณรัฐประชาชนจีน (สปจ.)', NULL, NULL, NULL, NULL),
(165, '8', '(ขส.ทบ.) การจ้างเหมาส่งกำลังและซ่อมบำรุงชิ้นส่วนซ่อมสำหรับฟื้นฟู ฮ.ท.212 จำนวน 1 งาน', 'จ้าง', '59', 'พิเศษ', 298700805.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท โรยัลสกาย จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(166, '29', 'ยย.ทบ. จ้างเหมางานก่อสร้างเรือนรับรองทำเนียบรัฐบาล', 'จ้าง', '๕๙ - ๖๐', 'พิเศษ', 136987000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'กิจการร่วมค้า วิทย์การช่าง  -ไซเลนเทค ', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(167, '9', '(สส.)  จัดหาระบบเครื่องมือแผนที่อัตโนมัติ จำนวน 3 ระบบ', 'ซื้อ', '59', 'พิเศษ', 60000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท วสุรัตน์ แอนด์ แอสโซซิเอท จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(168, '30', 'สส. จัดหาเครื่องมือตรวจระบบเรดาร์ จำนวน 3 ชุด ', 'ซื้อ', '59', 'พิเศษ', 180000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'หจก.ไซแอนติ รีเสริช์', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(169, '10', '(สพ.ทบ.) จ้างซ่อมรถยนต์บรรทุก ขนาด 1 1/4 ตัน ยูนิมอก จำนวน 60 คัน', 'จ้าง', '59', 'พิเศษ', 60000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'กิจการร่วมค้าอิทธิพร', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(170, '31', 'สส.  จัดหาระบบสื่อสารดาวเทียมแบบยุทธวิธีสนับสนุนหน่วยระดับกองพล จำนวน 3 ระบบ', 'ซื้อ', '59', 'พิเศษ', 105000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ล๊อกซเลย์ ไวร์เลส จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(171, '11', '(สพ.ทบ.) จ้างซ่อมปรับปรุง รสพ. M113 A1 ให้เป็น รสพ. M113 A2 I จำนวน 6 คัน', 'จ้าง', '59', 'พิเศษ', 65994000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ชัยเสรีเม็ททอล แอนด์รับเบอร์ จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(172, '32', 'สพ.ทบ. จัดหาปืนเล็กกล ขนาด 5.56 มม. แบบที่ 1 จำนวน 1,948 กระบอก', 'ซื้อ', '๕๙ - ๖๑', 'พิเศษ', 609466864.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ISRAEL WEAPON INDUSTRIES (IWI) LTD ', NULL, NULL, 'รัฐอิสราเอล', NULL, NULL, NULL, NULL),
(173, '12', '(สพ.ทบ.) ขออนุมัติจ้างผลิต/ประกอบ รยบ.ขนาดเบา 4x4 แบบ 51B (ปรับปรุงใหม่) จำนวน 251 คัน ', 'จ้าง', '59', 'พิเศษ', 342866000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท เอส.เอส. ออโตโมทีฟอินดัสตรี จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(174, '33', 'สพ.ทบ. จ้างซ่อมปืนใหญ่กลางกระสุนวิถีโค้ง 37 ขนาด 155 มม. M109 A5 อัตตาจร จำนวน ๑๐ หน่วยยิง จ้างซ่อมรถสายพานบรรทุกกระสุน M992 A1 จำนวน 10 คัน', 'จ้าง', '59', 'พิเศษ', 460000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ฟิโก้ เทคโนโลยี เอ็นจีเนียริ่ง จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(175, '13', 'สพ.ทบ. จ้างซ่อมปรับปรุงปืนใหญ่ต่อสู้อากาศยาน ขนาด 20 มม. วัลแคน อัตตาจรจำนวน 4 หน่วยยิง', 'จ้าง', '59', 'พิเศษ', 85952000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ISRAEL MILITARY INDUSTRIES LTD รัฐอิสราเอล', NULL, NULL, 'รัฐอิสราเอล', NULL, NULL, NULL, NULL),
(176, '34', 'สพ.ทบ. จัดหารถยนต์บรรทุก ขนาด 2 1/2 ตัน จำนวน 404 คัน', 'ซื้อ', '๕๙ - ๖๑', 'พิเศษ', 1458945000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท อิทธิพร อิมปอร์ จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(177, '14', 'สพ.ทบ. จัดหากระสุนปืนเล็กขนาด 5.56 มม. ธรรมดา จำนวน 18,008,150 นัด', 'ซื้อ', '59', 'พิเศษ', 180907002.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท POONGSAN ', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(178, '35', '(สพ.ทบ.) ซื้อปืนกล 38 ขนาด 7.62 มม.จำนวน 1,359 กระบอก', 'ซื้อ', '๕๙ - ๖๑', 'พิเศษ', 1087200000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท รอยัล ดีเฟนส์ จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(179, '15', 'สพ.ทบ. จัดหากระสุนปืนเล็ก ขนาด 5.56 มม. ชนิดธรรมดา มีแกนเหล็ก จำนวน 22,000,000 นัด', 'ซื้อ', '59', 'พิเศษ', 235620000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท POONGSAN CORPORATION  สาธารณรัฐเกาหลี', NULL, NULL, 'สาธารณรัฐเกาหลี', NULL, NULL, NULL, NULL),
(180, '36', 'อร. จ้างซ่อมทำเครื่องใหญ่ ขวา - ซ้าย ตราอักษร MTU รุ่น 20V1163 TB83 ขั้น major OverHaul ร.ล.รัตนโกสินทร์', 'จ้าง', '59', 'พิเศษ', 72800000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ยูพีเอส เอ็นจิน เซอร์วิส เซ็นเตอร์ จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(181, '16', 'โครงการจัดหาระบบการติดต่อ สื่อสารทางยุทธวิธีจำนวน ๕ รายการ', 'ซื้อ', '59', 'พิเศษ', 89977786.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท จันทร์เกษม อินเตอร์เนทชั่นแนล จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(182, '37', 'สยป.ทร. โครงการจัดหาเรือตรวจการณ์ชายฝั่ง จำนวน 5 ลำ', 'จ้าง', '๕๙ - ๖๑', 'พิเศษ', 705000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท มาร์ซัน จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(183, '17', 'ขส.ทบ. จัดหาอุปกรณ์ระบบตรวจจับแจ้งเตือนและป้องกันอาวุธนำวิถีต่อสู้อากาศยาน พร้อมการติดตั้ง, การฝึกอบรมการใช้งานและการซ่อมบำรุง ', 'ซื้อ', '59', 'พิเศษ', 196000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท Elbit Systems Eletro-option Elop LTD รัฐอิสราเอล ', NULL, NULL, 'รัฐอิสราเอล', NULL, NULL, NULL, NULL),
(184, '39', 'ขออนุมัติจ้างเหมาบริการสนับสนุนเครื่องยนต์ และอุปกรณ์ Line Replacement Unit (LRUs) สำหรับ บ.ข.๒๐/ก', 'จ้าง', '59', 'พิเศษ', 1051810000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'องค์การรักษาความปลอดภัยด้านการส่งออกทางทหารสวีเดน (The Swedish Defence and Security Export Agency (Försvarsexportmynigheten : FXM))  ราชอาณาจักรสวีเดน', NULL, NULL, 'ราชอาณาจักรสวีเดน', NULL, NULL, NULL, NULL),
(185, '18', 'สพ.ทบ. จัดหากระสุนปืนใหญ่กลางวิถีโค้ง ขนาด 155 มม. ชนิดส่องแสงเพิ่มระยะกลาง (ILLUM-ER-BT) จำนวน 450 นัด', 'ซื้อ', '59', 'พิเศษ', 87750000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท รอยัล ดีเฟนส์ จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(186, '40', 'ขออนุมัติจ้างก่อสร้างอาคารรับรองบุคคลสำคัญที่ท่าอากาศยานทหาร 2 กองบิน 6', 'จ้าง', '58', 'พิเศษ', 96300000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท อิตาเลียนไทย ดีเวล๊อปเมนต์ จำกัด(มหาชน)', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(187, '19', 'พธ.ทบ.  จ้างผลิตเสื้อยืดคอรูปตัววี (สีกากีแกมเขียว และสีพรางลายดิจิตอล) จำนวน 449,711 ตัว', 'จ้าง', '59', 'e - bidding', 104715441.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ไทยทูเวย์ แฟบริค จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(188, '41', 'ชย.ทอ. สร้างโรงเก็บ บ.ปฏิบัติการสงครามอิเล็กทรอนิกส์ ที่ บน.7', 'จ้าง', '59', 'พิเศษ', 140000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ทีมวิศว์ คอนสรัคชั่น จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL);
INSERT INTO `tbl_procure` (`idprocure`, `unitname`, `description`, `procure_type`, `budgetyear`, `method`, `budget`, `approve_type`, `procure_status`, `approvedate`, `saler`, `product`, `approve_budget`, `country`, `period`, `editor`, `remark`, `file`) VALUES
(189, '20', 'สพ.ทบ. จัดหากระสุนปืนใหญ่เบาวิถีโค้ง ขนาด 105 มม. ชนิดควัน RP เพิ่มระยะกลาง (RED PHOSPHOROUS ER-BT) จำนวน 720 นัด', 'ซื้อ', '59', 'พิเศษ', 126000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท รอยัล ดีเฟนส์ จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(190, '42', 'ชย.ทอ. จ้างสร้างโรงตรวจซ่อม ฮ.พระราชพาหนะ พร้อมอุปกรณ์ และสิ่งอำนวยความสะดวก จำนวน 1 โรง', 'จ้าง', '๕๙ - ๖๐', 'พิเศษ', 96270000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ที.พี.เอส  วัสดุภัณฑ์ จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(191, '21', 'พธ.ทบ. จ้างผลิตรองเท้าทรงสูงครึ่งน่อง จำนวน 142,785 คู่', 'จ้าง', '59', 'e - bidding', 157063500.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท เอส แอนด์ อาร์ ฟุตแวร์ จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(192, '43', 'ชย.ทอ. งานติดตั้งระบบผลิตไฟฟ้าด้วยเซลล์แสงอาทิตย์ ขนาด ๑ เมกะวัตต์ ที่ บน.2', 'จ้าง', '59', 'พิเศษ', 61340000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'กิจการร่วมค้า สมาร์ทพาวเวอร์ เอ็นจีเนียริ่ง ไทยวิจิตรประภา', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(193, '22', 'สพ.ทบ. จัดหากระสุนปืนใหญ่กลางวิถีโค้ง ขนาด 155 มม. ชนิดระเบิดแรงสูง (Super High Explosive) จำนวน 750 นัด', 'ซื้อ', '59', 'พิเศษ', 137700000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ISRAEL MILITARY INDUSTRIES LTD (I.M.I)', NULL, NULL, 'รัฐอิสราเอล', NULL, NULL, NULL, NULL),
(194, '44', 'ชย.ทอ. งานติดตั้งระบบผลิตไฟฟ้าด้วยเซลล์แสงอาทิตย์ ขนาด ๑ เมกะวัตต์ น้ำพอง ที่ ฝูง.237', 'จ้าง', '59', 'พิเศษ', 61380000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ไทยรีนิวเอเบิล จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(195, '23', 'สพ.ทบ. จัดหาลูกระเบิดยิงจากเครื่องยิงลูกระเบิด ขนาด60 มม. ชนิดส่องแสง แบบที่ 1 จำนวน 1,970 นัด', 'จ้าง', '59', 'พิเศษ', 79475789.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ISRAEL MILITARY INDUSTRIES LTD (I.M.I)', NULL, NULL, 'รัฐอิสราเอล', NULL, NULL, NULL, NULL),
(196, '24', 'สส.  โครงการจัดหาชุดวิทยุทดแทน AN/PRC-624 (ระยะที่ 1 ห้วงที่3) จัดหาชุดวิทยุVHF/FM ทางทหารระดับหมู่-มว. ชนิดมือถือ จำนวน 1,307 ชุด', 'ซื้อ', '๕๙ - ๖๑', 'พิเศษ', 420000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท Elbit System Land  And C41 Ltd.รัฐอิสราเอล', NULL, NULL, 'รัฐอิสราเอล', NULL, NULL, NULL, NULL),
(197, '25', 'สส.  โครงการจัดหาเครื่องมือสื่อสาร (หน่วย ส.) จำนวน ๖ รายการ ได้แก่', 'ซื้อ', '59', 'พิเศษ', 119907002.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท Elbit System Land  And C41 Ltd.รัฐอิสราเอล', NULL, NULL, 'รัฐอิสราเอล', NULL, NULL, NULL, NULL),
(198, '26', 'สส.  โครงการจัดหาเครื่องมือด้านการข่าวตาม อจย.ขกท.', 'ซื้อ', '59', 'พิเศษ', 80000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท เพลสซิ่ง แวลู จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(199, '27', 'สพ.ทบ. จัดหาระบบเครื่องควบคุมการยิง รถถัง เอ็ม 60 เอ 3 จำนวน 15 ระบบ', 'ซื้อ', '๕๙ - ๖๑', 'พิเศษ', 648455310.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท Elbit System Land  And C41 Ltd.รัฐอิสราเอล', NULL, NULL, 'รัฐอิสราเอล', NULL, NULL, NULL, NULL),
(200, '28', 'สพ.ทบ. โครงการจัดหา ถ. ทดแทน (ถ.เอ็ม 41) ระยะที่ 2 รถถังหลัก (Main Battle Tank VT4)  จำนวน ๒๘ คัน', 'ซื้อ', '๕๙ - ๖๑', 'G TO G', 4985391600.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'รัฐบาลสาธารณรัฐประชาชนจีน (สปจ.)', NULL, NULL, 'สาธารณรัฐประชาชนจีน (สปจ.)', NULL, NULL, NULL, NULL),
(201, '29', 'ยย.ทบ. จ้างเหมางานก่อสร้างเรือนรับรองทำเนียบรัฐบาล', 'จ้าง', '๕๙ - ๖๐', 'พิเศษ', 136987000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'กิจการร่วมค้า วิทย์การช่าง  -ไซเลนเทค ', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(202, '30', 'สส. จัดหาเครื่องมือตรวจระบบเรดาร์ จำนวน 3 ชุด ', 'ซื้อ', '59', 'พิเศษ', 180000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'หจก.ไซแอนติ รีเสริช์', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(203, '31', 'สส.  จัดหาระบบสื่อสารดาวเทียมแบบยุทธวิธีสนับสนุนหน่วยระดับกองพล จำนวน 3 ระบบ', 'ซื้อ', '59', 'พิเศษ', 105000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ล๊อกซเลย์ ไวร์เลส จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(204, '32', 'สพ.ทบ. จัดหาปืนเล็กกล ขนาด 5.56 มม. แบบที่ 1 จำนวน 1,948 กระบอก', 'ซื้อ', '๕๙ - ๖๑', 'พิเศษ', 609466864.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ISRAEL WEAPON INDUSTRIES (IWI) LTD ', NULL, NULL, 'รัฐอิสราเอล', NULL, NULL, NULL, NULL),
(205, '33', 'สพ.ทบ. จ้างซ่อมปืนใหญ่กลางกระสุนวิถีโค้ง 37 ขนาด 155 มม. M109 A5 อัตตาจร จำนวน ๑๐ หน่วยยิง จ้างซ่อมรถสายพานบรรทุกกระสุน M992 A1 จำนวน 10 คัน', 'จ้าง', '59', 'พิเศษ', 460000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ฟิโก้ เทคโนโลยี เอ็นจีเนียริ่ง จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(206, '34', 'สพ.ทบ. จัดหารถยนต์บรรทุก ขนาด 2 1/2 ตัน จำนวน 404 คัน', 'ซื้อ', '๕๙ - ๖๑', 'พิเศษ', 1458945000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท อิทธิพร อิมปอร์ จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(207, '35', '(สพ.ทบ.) ซื้อปืนกล 38 ขนาด 7.62 มม.จำนวน 1,359 กระบอก', 'ซื้อ', '๕๙ - ๖๑', 'พิเศษ', 1087200000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท รอยัล ดีเฟนส์ จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(208, '36', 'อร. จ้างซ่อมทำเครื่องใหญ่ ขวา - ซ้าย ตราอักษร MTU รุ่น 20V1163 TB83 ขั้น major OverHaul ร.ล.รัตนโกสินทร์', 'จ้าง', '59', 'พิเศษ', 72800000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ยูพีเอส เอ็นจิน เซอร์วิส เซ็นเตอร์ จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(209, '37', 'สยป.ทร. โครงการจัดหาเรือตรวจการณ์ชายฝั่ง จำนวน 5 ลำ', 'จ้าง', '๕๙ - ๖๑', 'พิเศษ', 705000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท มาร์ซัน จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(210, '39', 'ขออนุมัติจ้างเหมาบริการสนับสนุนเครื่องยนต์ และอุปกรณ์ Line Replacement Unit (LRUs) สำหรับ บ.ข.๒๐/ก', 'จ้าง', '59', 'พิเศษ', 1051810000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'องค์การรักษาความปลอดภัยด้านการส่งออกทางทหารสวีเดน (The Swedish Defence and Security Export Agency (Försvarsexportmynigheten : FXM))  ราชอาณาจักรสวีเดน', NULL, NULL, 'ราชอาณาจักรสวีเดน', NULL, NULL, NULL, NULL),
(211, '40', 'ขออนุมัติจ้างก่อสร้างอาคารรับรองบุคคลสำคัญที่ท่าอากาศยานทหาร 2 กองบิน 6', 'จ้าง', '58', 'พิเศษ', 96300000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท อิตาเลียนไทย ดีเวล๊อปเมนต์ จำกัด(มหาชน)', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(212, '41', 'ชย.ทอ. สร้างโรงเก็บ บ.ปฏิบัติการสงครามอิเล็กทรอนิกส์ ที่ บน.7', 'จ้าง', '59', 'พิเศษ', 140000000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ทีมวิศว์ คอนสรัคชั่น จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(213, '42', 'ชย.ทอ. จ้างสร้างโรงตรวจซ่อม ฮ.พระราชพาหนะ พร้อมอุปกรณ์ และสิ่งอำนวยความสะดวก จำนวน 1 โรง', 'จ้าง', '๕๙ - ๖๐', 'พิเศษ', 96270000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ที.พี.เอส  วัสดุภัณฑ์ จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(214, '43', 'ชย.ทอ. งานติดตั้งระบบผลิตไฟฟ้าด้วยเซลล์แสงอาทิตย์ ขนาด ๑ เมกะวัตต์ ที่ บน.2', 'จ้าง', '59', 'พิเศษ', 61340000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'กิจการร่วมค้า สมาร์ทพาวเวอร์ เอ็นจีเนียริ่ง ไทยวิจิตรประภา', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL),
(215, '44', 'ชย.ทอ. งานติดตั้งระบบผลิตไฟฟ้าด้วยเซลล์แสงอาทิตย์ ขนาด ๑ เมกะวัตต์ น้ำพอง ที่ ฝูง.237', 'จ้าง', '59', 'พิเศษ', 61380000.00, '', 'รมว.กห.อนุมัติแล้ว', '0000-00-00', 'บริษัท ไทยรีนิวเอเบิล จำกัด', NULL, NULL, 'ประเทศไทย', NULL, NULL, NULL, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `unit`
--

CREATE TABLE `unit` (
  `idunit` int(11) NOT NULL COMMENT 'รหัส',
  `unitname` varchar(100) NOT NULL COMMENT 'ชืือหน่วยงาน',
  `detail` tinytext COMMENT 'รายละเอียด'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `unit`
--

INSERT INTO `unit` (`idunit`, `unitname`, `detail`) VALUES
(1, 'สป.', ''),
(2, 'รอ.', ''),
(3, 'ทท.', ''),
(4, 'ทบ.', ''),
(5, 'ทร.', ''),
(6, 'ทอ.', '');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `cologistic_h`
--
ALTER TABLE `cologistic_h`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `cotype`
--
ALTER TABLE `cotype`
  ADD PRIMARY KEY (`idcotype`);

--
-- Indexes for table `country`
--
ALTER TABLE `country`
  ADD PRIMARY KEY (`idcountry`);

--
-- Indexes for table `file`
--
ALTER TABLE `file`
  ADD PRIMARY KEY (`id`),
  ADD KEY `coid` (`coid`);

--
-- Indexes for table `flag`
--
ALTER TABLE `flag`
  ADD PRIMARY KEY (`idflag`);

--
-- Indexes for table `industryplan`
--
ALTER TABLE `industryplan`
  ADD PRIMARY KEY (`id`),
  ADD KEY `coid` (`industrydid`);

--
-- Indexes for table `industry_d`
--
ALTER TABLE `industry_d`
  ADD PRIMARY KEY (`id`),
  ADD KEY `industryhid` (`industryhid`);

--
-- Indexes for table `industry_h`
--
ALTER TABLE `industry_h`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `log`
--
ALTER TABLE `log`
  ADD PRIMARY KEY (`log_id`),
  ADD KEY `fk_tb_log_user1_idx` (`username`),
  ADD KEY `fk_tb_log_log_type1_idx` (`log_type`);

--
-- Indexes for table `manual`
--
ALTER TABLE `manual`
  ADD PRIMARY KEY (`idmanul`);

--
-- Indexes for table `operation`
--
ALTER TABLE `operation`
  ADD PRIMARY KEY (`idoperation`);

--
-- Indexes for table `plan`
--
ALTER TABLE `plan`
  ADD PRIMARY KEY (`id`),
  ADD KEY `coid` (`coid`);

--
-- Indexes for table `procure`
--
ALTER TABLE `procure`
  ADD PRIMARY KEY (`idprocure`);

--
-- Indexes for table `procure59`
--
ALTER TABLE `procure59`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `procure_method`
--
ALTER TABLE `procure_method`
  ADD PRIMARY KEY (`idprocuremethod`);

--
-- Indexes for table `rank`
--
ALTER TABLE `rank`
  ADD PRIMARY KEY (`idrank`);

--
-- Indexes for table `register_owner`
--
ALTER TABLE `register_owner`
  ADD PRIMARY KEY (`owner_id`),
  ADD UNIQUE KEY `regis_year` (`owner_fullname`);

--
-- Indexes for table `tbluser`
--
ALTER TABLE `tbluser`
  ADD PRIMARY KEY (`user_id`),
  ADD KEY `fk_user_details_users1_idx` (`user_id`);

--
-- Indexes for table `tbl_procure`
--
ALTER TABLE `tbl_procure`
  ADD PRIMARY KEY (`idprocure`);

--
-- Indexes for table `unit`
--
ALTER TABLE `unit`
  ADD PRIMARY KEY (`idunit`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `cologistic_h`
--
ALTER TABLE `cologistic_h`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;
--
-- AUTO_INCREMENT for table `cotype`
--
ALTER TABLE `cotype`
  MODIFY `idcotype` int(11) NOT NULL AUTO_INCREMENT COMMENT 'รหัส', AUTO_INCREMENT=5;
--
-- AUTO_INCREMENT for table `country`
--
ALTER TABLE `country`
  MODIFY `idcountry` int(11) NOT NULL AUTO_INCREMENT COMMENT 'รหัส', AUTO_INCREMENT=17;
--
-- AUTO_INCREMENT for table `file`
--
ALTER TABLE `file`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'รหัส', AUTO_INCREMENT=4;
--
-- AUTO_INCREMENT for table `flag`
--
ALTER TABLE `flag`
  MODIFY `idflag` int(11) NOT NULL AUTO_INCREMENT COMMENT 'รหัส', AUTO_INCREMENT=7;
--
-- AUTO_INCREMENT for table `industryplan`
--
ALTER TABLE `industryplan`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'รหัส';
--
-- AUTO_INCREMENT for table `industry_d`
--
ALTER TABLE `industry_d`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'รหัส', AUTO_INCREMENT=6;
--
-- AUTO_INCREMENT for table `industry_h`
--
ALTER TABLE `industry_h`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'รหัส', AUTO_INCREMENT=6;
--
-- AUTO_INCREMENT for table `log`
--
ALTER TABLE `log`
  MODIFY `log_id` smallint(6) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=49;
--
-- AUTO_INCREMENT for table `manual`
--
ALTER TABLE `manual`
  MODIFY `idmanul` int(11) NOT NULL AUTO_INCREMENT COMMENT 'รหัส', AUTO_INCREMENT=11;
--
-- AUTO_INCREMENT for table `operation`
--
ALTER TABLE `operation`
  MODIFY `idoperation` int(11) NOT NULL AUTO_INCREMENT COMMENT 'รหัส', AUTO_INCREMENT=2;
--
-- AUTO_INCREMENT for table `plan`
--
ALTER TABLE `plan`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'รหัส';
--
-- AUTO_INCREMENT for table `procure`
--
ALTER TABLE `procure`
  MODIFY `idprocure` int(11) NOT NULL AUTO_INCREMENT COMMENT 'รหัส', AUTO_INCREMENT=185;
--
-- AUTO_INCREMENT for table `procure59`
--
ALTER TABLE `procure59`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=45;
--
-- AUTO_INCREMENT for table `procure_method`
--
ALTER TABLE `procure_method`
  MODIFY `idprocuremethod` int(11) NOT NULL AUTO_INCREMENT COMMENT 'รหัส', AUTO_INCREMENT=3;
--
-- AUTO_INCREMENT for table `rank`
--
ALTER TABLE `rank`
  MODIFY `idrank` int(11) NOT NULL AUTO_INCREMENT COMMENT 'ยศ', AUTO_INCREMENT=52;
--
-- AUTO_INCREMENT for table `register_owner`
--
ALTER TABLE `register_owner`
  MODIFY `owner_id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'PK', AUTO_INCREMENT=2;
--
-- AUTO_INCREMENT for table `tbluser`
--
ALTER TABLE `tbluser`
  MODIFY `user_id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'รหัส', AUTO_INCREMENT=5;
--
-- AUTO_INCREMENT for table `tbl_procure`
--
ALTER TABLE `tbl_procure`
  MODIFY `idprocure` int(11) NOT NULL AUTO_INCREMENT COMMENT 'รหัส', AUTO_INCREMENT=216;
--
-- AUTO_INCREMENT for table `unit`
--
ALTER TABLE `unit`
  MODIFY `idunit` int(11) NOT NULL AUTO_INCREMENT COMMENT 'รหัส', AUTO_INCREMENT=7;
--
-- Constraints for dumped tables
--

--
-- Constraints for table `file`
--
ALTER TABLE `file`
  ADD CONSTRAINT `FK_cotype` FOREIGN KEY (`coid`) REFERENCES `cotype` (`idcotype`) ON UPDATE CASCADE;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
